{"name":"A.H. Capp Reserve, Preston","description":"Mamma thinks you’d be hard-pressed finding a more tranquil, fun and spacious spot for a play with the kids and dog! A.H. Capp Reserve has everything you need for a gathering with friends, with picnic tables, shade and a playground with elements suited to both younger and older kids. On the larger structure there’s a rock climbing wall and a large slide and on the smaller there is a chain bridge, smaller slide and noughts and crosses. There’s also a little merri-go-round and swings (including a basket swing). Add to this a basketball court, leash-less dog oval and exercise equipment - there is something for everyone here!\n\nThe best part is that it’s set along the beautiful Merri Creek Trail, making it just such a pretty and peaceful spot. There’s a relaxed and friendly dog scene after 5pm on the oval, a great way to see out the end of the day. Mamma's special mention: Grab a coffee & pastry from Joe’s Market Garden on your way (open Saturdays and every day of lockdown 9am-1pm).\n\nthe nitty gritty  undercover picnic tables - playground - basketball court - exercise equipment - street parking - dogs off leash on oval - toilets at the sport pavilion","urgency":"medium","formattedAddress":"13 Halwyn Cres, Preston, 3072","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5e5b70e67a7f3216d6cb4ef3/1631679599393/A.H+Capp+Reserve+excerpt+.jpg?format=1500w","_status":"ok"}
{"name":"AJ Davis Reserve Playground, Airport West","description":"NEW PLAYGROUND ALERT! There is a new playground at AJ Davis Reserve in Airport West and it’s a really unique and fun playground with lots of natural play elements set over multiple levels (it’s on a hillside)!\n\nThis is certainly one for little daredevils with lots to climb and steep, fast tube slides. Boulders, logs and yellow soft fall provide areas to scale between the floor levels with slides, swings, round about, dry river bed (BYO diggers) and lots of paths to tear around on.\n\nThe nitty gritty:\n298 Fullarton Rd, Airport West. Wurundjeri and Woi‑Wurrung Country. Amenities: bench seats - undercover picnic tables - carpark - no toilets.\n\nMamma's special mention: Slices Keilor is a short drive away and a great place to head for lunch or dinner!","urgency":"medium","formattedAddress":"298 Fullarton Rd, Airport West","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/64c0a9292ee2932e8d44d3e1/1690353927253/aj+davis+reserve+playground%2C+airport+west+-+copyright+2023+mamma+knows+melbourne.jpg?format=1500w","_status":"ok"}
{"name":"Alistair Knox Park, Eltham","description":"The Alistair Knox Reserve in Eltham is a hub for community life. It's where mothers and little ones come together during the week for playdates, where galahs and cockatoos sing, where families ride bicycles along the edges of the Diamond Creek and where groups gather for weekend celebrations. The play area hosts a range of spaces for children to explore. The play space is dotted amongst gum trees. There are a range of large wooden carvings including a huge platypus, owl and big tree stump seat and lovely metal figures of people. The main play structure has a curved slide, walkways, hanging disks, rising step bridge, steering wheel, tunnel, scrambling wall, shop front and monkey bars. There is also a spinning donut, music making equipment, birds nest swing and huge family sized see-saw. Rocks to jump across. This place is something sweet.\n\nMamma's special mention: Grab a bite to eat at Shillinglaw Cafe or you can even check out storytime for little ones at Eltham Library for a little quiet time to finish your day.\n\nThe nitty gritty: Accessible - Toilets - Car park - BBQ - BMX track - Walking/bike track - Picnic tables - Shaded areas.\n\nWant to know more: http://www.nillumbik.vic.gov.au/Parks-sport-and-recreation/Alistair-Knox-Park","urgency":"medium","formattedAddress":"829 Main Rd, Eltham","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/595c338be4fcb506751e8c75/1602462574078/alisterfront.jpg?format=1500w","_status":"ok"}
{"name":"anderson reserve, coburg","description":"Anderson Reserve is one of those perfect toddler playgrounds! It’s bright, fresh and recently upgraded and it’s fully FENCED! (It’s also large enough for each section of equipment to be separated, helping with social distancing!) There are lots of unique play opportunities in this transport themed playground - there are simulated train tracks, trucks built out of tyres and logs, bike and car rockers, tunnels and a bumpy grass ‘road’ perfect for running and jumping over. There’s a toddler tower and slide, swings and an upright rainbow wind pipe set for making music. Most of the equipment is low to the ground but there are some more challenging pieces for older kids including monkey bars, mini rock climbing wall, a tower with larger slide and a balancing spring seesaw. To top it off it’s set in leafy surrounds with shady spots for picnics, there’s a basketball half court and dogs are allowed off leash (away from the playground). Mamma's special mention: If you’re looking for a family friendly meal, the Post Office Hotel is just down the road (https://www.mammaknowsnorth.com.au/eats/post-office-hotel-coburg).\n\nthe nitty gritty fully fenced playground - basketball half court - drinking tap - park benches - grassy areas for picnics - dogs allowed off leash (away from playground) - easy surrounding street parking.","urgency":"medium","formattedAddress":"44-46 Linda St, Coburg","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/t/60a5b77d65ffd53bbd75ec93/1759732775412/","_status":"ok"}
{"name":"All Nations Park, Northcote","description":"All Nations park in Northcote is a little explorer’s haven (even for your furry friends!). With two playgrounds, dog park, lake, skate park plus loads of rocks and trees to climb. What more could Mamma want? That's right - chuck in a basketball half court, chess boards and tennis/down ball wall and you have the whole morning or afternoon sorted. The 13 hectare regional park was created on the site of the former 'Northcote Landfill' in 2002, making this place super cool.\n\nThe first play space is great for little ones. This recently upgraded playground includes your favourites - slides, swings, climbing ladders and a sandpit. Playspace number two is perfect for the bigger kids. It's a natural structure, and the modern design makes this playground exciting and fun. It includes a long wave slide, a long curved tunnel slide, a wooden and chain climbing wall and various little obstacles using different heights.\n\nThe nitty gritty: Separation St, Northcote — park benches - picnic tables - pram access - dogs off leash - play spaces - public toilets - lots of shade - BBQs - parking. Mamma's special mention: Tinker in Northcote is the only way when it comes to fresh tasty food. Drop in for a bite to eat or grab and go.","urgency":"medium","formattedAddress":"Separation St, Northcote","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5ad5d9960e2e72ed9a171b31/1689545184225/all+nations.jpg?format=1500w","_status":"ok"}
{"name":"all abilities play space and splash park, mill park","description":"Wowee!! This is our kind of play space! It’s wonderfully spacious and spread out into zones with play options to suit all ages and abilities. Let’s start with the WATER PLAY! With multiple splash pads, a mist ring tunnel, basin and trough stations with manual push and pump facilities and a shallow stream running throughout, you’ll want to hang here with the kids all summer long!\n\nThe playground tower structures have been designed flat, wide and spacious as to be wheelchair accessible so that everyone gets the opportunity to play. There are sound installations like rainbow instrumental pipes, floor-mounted musical pedals and several speak and listen tubes. There’s a spiral tunnel slide and a wide metal slide for side-by-side action as well as a colourful rock climbing wall, a HUGE double flying fox run (with accessible/adult chair), in-ground trampolines (including a wheelchair accessible trampoline with side rails), several swing options for everyone and so much more! The structures are adorned with insect sculptures made from locally sourced scrap metal and if you look closely you might see cars, trucks and animals ‘fossilised’ in the rocks!\n\nToddlers can enjoy the shaded smaller structures and slides, climb on cars (including a sway glider for wheelchair access) and play in the cubby house. In its own zone is a ‘chill out’ area for a bit of quiet time and nature play. There’s a dry creek bed, tree stumps and balance logs, native plant life and even a Labyrinth for mindful play. Further afield you’ll find a large, shaded sandpit with diggers and play bench. This is such a well considered play space, you’ll want to spend hours here. Be sure to pack some snacks, swimmers and a towel and make an adventure of it!\n\nthe nitty gritty: toilets, picnic tables with cover, water refill station, wheelchair accessible playground, BBQs, fully fenced, carpark, water play, basketball court — Recreation Reserve, Morang Drive, Mill Park\n\nmamma’s special mention: Too cold or wet to play here? Check out Eden Play in Mill Park.","urgency":"medium","formattedAddress":"Recreation Reserve, Morang Drive, Mill Park","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/602f4fd18ead7215feb6474e/1733195180025/20241121_130550.jpg?format=1500w","_status":"ok"}
{"name":"allard park playground and pump track, brunswick east","description":"How cool is this!? Allard Park in Brunswick East has a playground and a mini pump track to enjoy! The gravel pump track loop is perfect for small or new riders, with a wide track, little hills and rubber tires to help keep everyone in their lane. It’s right next to the playground so the kids go from playing to riding, to playing again without mamma having to get up from her seat. If you forget your bike or are not yet riding one, you can pretend to ride on one of the 2 bike rockers in the playground! There’s also a swing set, a nest swing, rainbow balancing logs and merry go round that you can spin yourself on.\n\nThe main play structure here has monkey bars attached, a vertical rope climbing frame, rope tunnel, fireman’s pole, shop front and 2 slides to choose from. It’s a good size for young primary and preschool climbers. Older kids might prefer to bring a ball to kick around on the oval. There’s a few seating options including normal benches, a wide square bench and tables and chairs. A drinking tap can be found near the tables and a toilet across the oval, behind the pavilion. The park also has plenty of trees to help create some shade at times.\n\nThe nitty gritty: Mini pump track, Benches, Picnic Tables, Drink Tap, Toilets (behind the pavilion), Local sports oval.\n\nMamma's special mention: Hungry after your play and ride? Take a short drive to Long Bahn Mi for some amazing Vietnamese sandwiches!","urgency":"medium","formattedAddress":"150 Mitchell St, Brunswick East","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/678da19d6ff41e1111a3880c/1745374381580/20250120_131813.jpg?format=1500w","_status":"ok"}
{"name":"Cardinal Road Playground, Glenroy","description":"New playground alert! Moreland Council (soon to be renamed Merri-bek) has done it again. The ‘A Park Close to Home’ initiative has seen lots of great little playgrounds pop up throughout the Moreland area and this one is no exception.\n\nIt’s FENCED, there is WATER PLAY, shaded picnic tables, fitness equipment, an in-ground trampoline, a triple swing set and a climbing frame. The kids will love this!\n\nMamma’s Special Mention: Siconi, gelato. Mamma can see this being a popular spot in summer - so much gelato nearby too - check out Siconi or Augustus Pascoe Vale.","urgency":"medium","formattedAddress":"132 -134 Cardinal Road, Glenroy","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/62de167cd29a5377dcf07ddb/1730710218653/cardinal+road+playground+.jpg?format=1500w","_status":"ok"}
{"name":"balfe park, brunswick east","description":"Here’s a cute little newly upgraded playground to stop off at with the pooch in tow! We love the cool dragon sculpture and there’s also a climbing structure with slides, a double swing set, spinners and rockers and a sandpit with some trucks and diggers to play with. Add to that the large, off-lead oval, exercise equipment and toilet block and you’ve got the perfect place for a little play date.\n\nmamma’s special mention: You’re a 7 minute walk from Messina Gelato!\n\nthe nitty gritty: toilets - picnic tables - pram accessible - off-lead dog oval - sandpit - nature play - exercise station. John Street, Brunswick East","urgency":"medium","formattedAddress":"John Street, Brunswick East","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/t/60a5b77d65ffd53bbd75ec93/1759732775412/","_status":"ok"}
{"name":"Bedford St Pocket Park, North Melbourne","description":"This brand-new park in North Melbourne is perfect for a day out, with lots of green space for picnics, ball games, or just getting away from the city's hustle. The playground isn’t huge but has climbing frames, slides, swings, and areas for water and sand play, which makes it great for toddlers. There are no high structures, so it's quite safe for younger kids. It’s also partially fenced to keep little ones from running into the street, with openings leading to the park, footpath, and BBQ area.\n\nThe playground connects to another section with picnic benches and BBQs, making it a great spot for family gatherings or birthday parties. The large lawn area has plenty of shaded seating, perfect for chilling out or reading a book. Plus, there are new trees and ferns planted throughout, and as they grow, they’ll offer even more shade, making the park even more inviting over time.\n\nThe nitty gritty: 2 Bedford St, North Melbourne. No toilet facilities - BBQ available - toddler friendly play equipment - water play - sandpit - pram friendly - wheelchair accessible - ample street parking and allocated parking on site.\n\nMamma's special mention: Pack some picnic lunch or stop by Queen Victoria Market on the way to the playground for some yummy treats.","urgency":"medium","formattedAddress":"2 Bedford St, North Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/6789c4adc6dfb26a7858a7a6/1738901846794/Bedford+St+Pocket+Park+Mamma+Knows+North+Copyright.jpg?format=1500w","_status":"ok"}
{"name":"Canning Reserve, Avondale Heights","description":"Flying fox - yes, great swings - yes! Oh and we should mention the lovely river views, the huge shady trees and lots of open space! This is a great park for a birthday party or to spend your family BBQ Sunday!\n\nThis reserve is on the banks of the Maribyrnong River and you can get here via the Maribyrnong River Bike Trail too.\n\nMamma's special mention: If you head up the hill from here you will find a great spot called Hippos Lifestyle Store and Cafe - perfect for a cuppa!\n\nThe nitty gritty: lots of shady trees - toilets - lots of free parking - BBQ - picnic table\n\n2A Canning St, Avondale Heights","urgency":"medium","formattedAddress":"2A Canning St, Avondale Heights","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5b690a2d1ae6cf304f4d3d7b/1602461965646/canning+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"Bushranger Drive Playground, Sunbury","description":"NEWLY OPENED! Sunbury has a new park and MY GOODNESS it will become a family favourite very fast! Situated behind Woolworths in the Rosenthal Estate located on top of a hill overlooking Sunbury, your little ones will absolutely love this park. There’s so much to do for kids young and old, it’s huge!!\n\nThe little ones will love the equipment designed just for them - slides, ropes, musical chimes, seesaws, spinners and even water play. There’s huge slides for the older kids, as well as climbing ropes, swings, tunnels, a flying fox, and more. Bring your equipment as this park has a large grass area and a half basketball court. There are tables and chairs under the shelter for when you need a food pit stop.\n\nThe nitty gritty: Bushranger Drive, Sunbury (Behind the Woolworths). No toilets.\n\nMamma's special mention: The Court Coffee Bar is a 5 minute drive from here for GREAT coffee and a kids play area.","urgency":"medium","formattedAddress":"Bushranger Drive, Sunbury (Behind the Woolworths)","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/65de8e8a6dac9734f49c6b40/1709087037600/Bushranger+Drive+Sunbury+Mamma+Knows+West-13.jpg?format=1500w","_status":"ok"}
{"name":"Brimbank Park, Keilor East","description":"As soon as you leave the freeway and start to drive down into Brimbank Park, you instantly start to feel a little more relaxed. The houses and suburbs disappear and are replaced with trees, picnic shelters and bush land - there is oodles to explore, lots of families and plenty of space. The feature 'playscape' area is excellent - with swings, a giant pea pod, cow park bench, an alphabet maze, a HUGE platypus and so so much more! Look closely and you will find all kinds of treasures scattered throughout the space. There are even a few trees to clamber and climb which is super spesh for the nature lovers. This playground and parkland is beautifully integrated into nature with some fab highlights dotted throughout to uncover and surprise you and the kids. For the explorers, there are also trails to follow along the river and further around the park. AND there is also Lumbar & Co Cafe as well where we love to grab a bacon and egg sandwich to enjoy out in the courtyard sunshine - what more could you want!? Take your time here, it's definitely somewhere to spend a good few hours.\n\nMamma's special mention: Parks Victoria is working to increase the accessibility of its parks for people on the autism spectrum. The social script you can print and read they have created for this park has photographs and simple text to show children what they may see and experience during a visit to Brimbank park. You can read them this resource or download the Word document to print out. You can also cut and paste the pages to create a story that best suits your child and your planned park visit. Please visit the Parks Victoria website HERE to download the script.","urgency":"medium","formattedAddress":"Keilor Park Drive, Keilor East","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1652072914259-2QCY9B4ZD6O7ZVIF8O6U/brimbank+park.jpg?format=300w","_status":"ok"}
{"name":"batman park, northcote","description":"Legend says if you run fast, climb high and slide down every slide in the park, you may just see Batman... You need to be quick because he's fast.\n\nBatman Park in Northcote has always been a favourite of Mamma's. It's not only on the way to and from the city - making drives a little easier after a quick play - it's also the home to community events and family gatherings. Batman Park also has a great sized playspace which is completely fenced and includes two play structures sandpit, swings, nature play and chalkboards. Mamma says bring some chalk when you visit and get creative. Playground one is great for smaller kids and includes two slides, climbing pole and counting equipment. Playground two's wooden structure includes, walking bridge, climbing walls, slide and tunnels. This playground is fully enclosed, making your park visit super relaxing. The park also includes a large gazebo complete with tables, seats and bbq's. Perfect for large gatherings and birthday parties. Not to mention a bike track that your little ones will definitely want to scoot around on.","urgency":"medium","formattedAddress":"St Georges Rd & Arthurton Rd, Northcote","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1533627670198-QG7AWEJ0Z6SO8B0Q1ZXI/batman+park%2C+northcote-9.jpg?format=750w","_status":"ok"}
{"name":"binnak park, watsonia north","description":"What a picturesque spot! Binnak park playground has a beautiful, lush, green backdrop and is a popular spot for barbeques and gatherings. It has areas suitable for all abilities access, toddler friendly swings, ride-on kangaroo structures, a family sized see-saw and Mamma’s favourite, a set of 2 low to the ground slippery slides that toddlers can master safely on their own (and being 2 of them there is less wait time!) There are more challenging structures for older kids like a large climbing frame, a fort with rope ladder, monkey bars, rock climbing wall and fire pole. In a separate area there is also one of the tallest hammock swings Mamma has ever seen - you can get some serious air! This is a lovely spot to gather with friends and family.\n\nMamma's special mention: Bundoora Park Farm playspace is also only a hop, skip and a jump away!\n\nthe nitty gritty: under cover bbq & picnic table - toilets - park benches - car park - drinking fountain - pram friendly - nearby walking tracks - dog friendly","urgency":"medium","formattedAddress":"anderson parade, watsonia north","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5d627afd31910c000175a6e1/1602461202874/Untitled.+jpg.jpg?format=1500w","_status":"ok"}
{"name":"bundoora all abilities playspace, bundoora","description":"Mamma went to visit a farm one day. She saw a park along the way - and what did you think she heard it say? FUN, FUN, FUN! The All Abilities Playspace right next door to Bundoora Park Farm is of course, a farm themed adventure! The tractors, the water tank slide, the wobbly sheep and cows are all at home in the park that is designed to be inclusive. There is a great spinning merry-go-round that doesn't have any steps up and at ground level. The slide is a hill climb style making it perfect for crawlers. And there is a huge sand pit with heaps of room to share. There is water play feature which was out of action last time we were there but makes it awesome for sticking those sandcastles together. Bubs is a big fan of a maze and be sure to search out the horse inside. Besides all this greatness, the BEST thing - a cafe next door! They will even bring out your coffee if you choose to sit at a table by the door.\n\nMamma's special mention: Next door is Bundoora Park Farm and is a BRILLIANT space for the whole family.\n\nthe nitty gritty: partly shaded - pram friendly - cafe - nearly walking tracks - public toilets - undercover seating - picnic seating - fully fenced","urgency":"medium","formattedAddress":"Plenty Road, Bundoora, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5892fe55f7e0aba7b7225d94/1613372493796/bundoora+playspace2.jpg?format=1500w","_status":"ok"}
{"name":"bryant family reserve, oak park","description":"This is a great little park in a lovely bush setting. It was updated last year to include some fresh equipment pieces, a new basket swing and nature play elements including, logs, rocks and WATER PLAY! The little one loves the water pump and watching leaves float down the waterway. Toddler parents will appreciate the low to the ground playground elements and older kids will enjoy the big slide and basketball half court. A great little secret spot where locals come to picnic, play and walk their dogs!\n\nMamma's special mention: If you’re after some water play on a bigger scale you can’t go past Oak Park Sports & Aquatic Centre. There is also a gorgeous little cafe down the road for your coffee, check out Francis Winifred!\n\nthe nitty gritty  nature/water play, bench seats - dogs on lead - parking further up Vincent Street (be mindful of no stopping signs) or otherwise park on Winifred Street and walk to the end of Vincent Street","urgency":"medium","formattedAddress":"End of Francis Street, Oak Park","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5dd8fa66c040f62cf124d2f9/1733195114554/bryant+family+reserve+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"Bollygum Park Playground, Kinglake","description":"The first time we saw this place, Mamma’s eyes almost popped out at the site of this magnificent playspace. The playground is amazing. It features the characters from Garry Fleming's story Bollygum and the different sections around the space are named after the characters and settings in the book.\n\nIt is a fantastic wooden park with great of options for your little ones (which Mamma always loves) and heaps of things to move through to keep things interesting. It is a very noisy park as well with STACKS of musical structures, things to bash, crash, hit and stomp on. The top of the park is great for imaginative play with Platypus's house and a dry river bed that runs down into the centre of the playground (even some fishing rods set up to catch some dinner!). Heaps of climbing and typical park features, including a great swing set up with a roped birds nest swing (much easier to hold on to).\n\nMamma’s special mention: Throughout the year on the second Sunday of the month (with a break during winter), the Bollygum Community Market is held here. The Christmas market is always a brilliant event with the market and community carols happening all at once!\n\nThe nitty gritty: BBQs - great shaded areas - skate park - public toilets - amphitheater seating - sandpit - pram access - nature trails. 40 Whittlesea-Kinglake Rd, Kinglake","urgency":"medium","formattedAddress":"40 Whittlesea-Kinglake Rd, Kinglake","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/58f710ecf5e2314662f5b6ba/1644377734429/01+Copyright+Mamma+Knows+East+-+Bollygum+Park%2C+Kinglake+%281+of+18%29.jpg?format=1500w","_status":"ok"}
{"name":"bush reserve, coburg","description":"Shh, Mamma has a secret and it's pretty special. Using only recycled materials from the old depot site, Merri Bek City Council created this unique place for locals to meet, play and have fun in a sustainable community space. Bush Reserve has everything you need for a family fun day out or just a quick visit. The playground features a tree house, with 2 slide options and a rock climbing wall. It also has musical sculptures all around that make the coolest sounds by tapping and spinning!\n\nThere’s a flying fox, swing set, a wheel chair accessible liberty swing or jump aboard the boat, but be careful, its set amongst rocky seas! Make sure you also say hello to the chicken and rooster as well. Mamma is especially impressed with the banana lounges overlooking the grass area. Kick back and watch the kids play on the lush green grass. If you have a basketball or ping pong equipment, bring it along and play on the court and table available here!\n\nThe nitty gritty: 227 Bell St Coburg\nBBQ - toilets - undercover tables - parking - wheelchair liberty swing - banana lounge\nMamma's special mention: This little beauty is only a short drive to Blu for some yummy fish and chips.","urgency":"medium","formattedAddress":"227 Bell St Coburg","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/591d8d645016e1c2af452f43/1737076329880/bush+reserve+front.jpg?format=1500w","_status":"ok"}
{"name":"Castlemaine Botanical Gardens Playground, Castlemaine","description":"Nestled in the gorgeous surrounds of Castlemaine Botanical Gardens is a beautiful and spacious playground. An enormous acorn tree is the centrepiece with lots of unique and natural play equipment circling out from the base of the gargantuan skyscraper.\n\nOur fave country feature was a sweet little homestead cubby. There are also swings, slides, old school flying foxes (“these were the flying foxes Mamma used on playgrounds when she was little!”), monkey bars and a little wooden train (to match the VLines tooting by on the nearby tracks).\n\nA huge shed makes for an impressive playground party venue, fit-out with barbecues and LOTS of tables. There is plenty of seating in and around the play equipment, and lots of picnic tables dotted about, and what’s a botanical garden if not a picnic palace!\n\nMamma visited in early winter, where the autumn leaves were still around and the kids had a blast traipsing through the thick layer of leaf litter (as well as throwing bunches at the parents of course). Mamma will have to come and see this playground in all it's glorious seasons as it’s sure to be stunning. This (for sure) is day-trip worthy. From the Melbourne CBD, it’s an easy 90 minute drive.\n\nThe nitty gritty:\nDownes Rd, Castlemaine\npark benches - picnic tables - toilets - water refill - undercover bbq and seating - off the lead dog walking - wildlife observation\nMamma's special mention: The Victorian Goldfields Railway departs from Castlemaine.","urgency":"medium","formattedAddress":"Downes Rd, Castlemaine","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/cfd6fa1d-e837-4d16-ab38-c8863be0d7a2/castlemaine+botanical+gardens+playground%2C+castlemaine+-+copyright+2023+mamma+knows+melbourne-4.jpg","_status":"ok"}
{"name":"Bell to Moreland playgrounds & public spaces, Coburg","description":"We are just loving the new-look Bell and Moreland train stations and the new open spaces in between them. The level crossing removal project in this area - which saw the removal of 4 level crossings and the raising of the rail line up over the road - has made way for a very cool array of public recreational spaces. It’s even cooler for little ones to see and hear the trains overhead. There are brand new playgrounds at both Coburg and Moreland stations and between the two there’s an enclosed dog park, basketball half courts, outdoor exercise stations, a mini skate park and parkour equipment, table tennis tables and bicycle repair stations. We also spied a mini library! The stretch between the stations is approximately 1.5kms so you can park at one station carpark and scoot or ride along to explore - just be careful of cyclists and stick to the pedestrian paths if walking. Otherwise drive and park at each station if you just want to visit the playgrounds.\n\nThe playground at Coburg station is suited to slightly younger children and has more green space than the one at Moreland however both are small. The mini skate park is closest to Moreland Station.\n\nMamma's special mention: Need coffee? The Eastern Bloc is right near Coburg Station.\n\nthe nitty gritty: Moreland Train Station, Coburg Train Station — toilets and car parks at both Moreland and Coburg stations - pram accessible - bike and pedestrian paths - bbqs - water stations - seating and green space for picnics at the playgrounds.","urgency":"medium","formattedAddress":null,"isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/616251bd31cd26788069c50f/1644315448696/excerpt+level+crossing.jpg?format=1500w","_status":"ok"}
{"name":"bulleke-bek park, brunswick","description":"Well how cool is this? A brand NEW playground in the heart of Brunswick! The park’s name, Bulleke-Bek, means Brunswick in Woi Wurrung language and the space has just opened as part of Moreland Council’s ‘A Park Close to Home’ program which will see several more areas across Moreland returned to parks and green spaces for public use. Yay!\n\nThis is a lovely space where you’ll see and hear trains passing overhead. There are two large fort structures with small and large slides, a see-saw, a set of swings including a basket swing, lots of nature play elements like tree stumps and rocks and of course, the manual water pump which the kids will LOVE - the water filters down through a mosaic adorned stream with wooden bridges and is captured in a dry creek bed at the end (which looks to be filling up to create a small lake!). There is enough green space for picnics and lots of undercover seating and tables with a bbq. The front section of the park is being prepared for community gardens with composting and worm farm facilities!\n\nmamma’s special mention: Babycino time? LOBBS is a short stroll away!","urgency":"medium","formattedAddress":"Cnr West & Breese Streets, Brunswick","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/600a27635e3e3924148808bd/1703894626425/bulleke-bek+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"Carlton Gardens playspaces, Carlton","description":"A two for one special is right here at the northern end of the Carlton Gardens. Two playgrounds to explore while spending quality family time on the edge of our beautiful city. The Gardens are tucked behind the Melbourne Museum and are a great way to cap off an adventure after all that learning.\n\nThe main play structure is uniquely designed with layers of walls dividing the space with musical walkways, slides and tunnels connecting each section. Walk through these colourful wavy walls to get to the large structures with more things to climb, slide down and explore. The second playground is more your traditional plastic style with a cute cubby, slides, monkey bars, old school flying fox and a cute little swing-slash-surfboard thingo. The gardens themselves span down to Victoria Street, with the Museum and Royal Exhibition Building in its heart. There is plenty of green space to spread out, paths to explore by bike and autumn leaves to collect.\n\nMamma's special mention: Melbourne Museum and IMAX are only just behind that wall and add to a great day out with the whole family.\n\nThe nitty gritty: walking tracks - basketball court - limited shade - tennis club - public toilet - paid parking at museum or some street parking.","urgency":"medium","formattedAddress":"Carlton Street, Carlton","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5aefa10d1ae6cf3823c8ef95/1602462129859/02+Carlton+Gardens+%281+of+14%29.jpg?format=1500w","_status":"ok"}
{"name":"Aston's Champion Parade (Burt Kur Min Reserve), Craigieburn","description":"This park takes Mamma right back to when she was a little girl - such excitement. Not only does it resemble a tree house, it's a climbers heaven.\n\nFrom rope ladders to walking tunnels divided by little nest like huts, this place is super cute. There is even a little toddler hub for the little ones with soft landings so nobody gets hurt. You will also find the park also includes swings, slide, see saw and a zooming flying fox. Perfect for everyone!\n\nMamma's special mention: Check out some of the other awesome Peet parks in the north; Aston’s ‘Traffic Park’ Observation Park, Craigieburn (right around the corner!), Debonair Parade Park Craigieburn, Aston Fields Playground, Aspect’s Destination Drive Park, Greenvale.\n\nThe nitty gritty: Champion Parade, Craigieburn — pram accessible; drinking fountains; shelter; bike and walking trails.","urgency":"medium","formattedAddress":"Champion Parade, Craigieburn","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/591440c69f7456878ba910ff/1692595505369/03+Champion+Pde+-+Mamma+Knows+North+%281+of+22%29.jpg?format=1500w","_status":"ok"}
{"name":"Aspect's Destination Drive Park, Greenvale","description":"This gorgeous little park has everything you could ever want in a community playground and more. The fresh playspace is ready for play and it is fabulous. With a mix of slides, rope climbing frames, swings, see-saw and even a rodeo platform AND a seriously cool flying fox - it is built for all ages. The position of the playground takes full advantage of the breathtaking views of the Greenvale Reservoir, parklands and the city skyline too. Aspect’s Destination Drive park is perfect for a birthday picnic or afternoon with the family. You might want to pack a snack.\n\nMamma's special mention: Check out some of the other awesome Peet parks in the north; Aston’s Debonair Parade Park Craigieburn, Aston Fields Playground Craigieburn, Aston’s Champion Parade Playground Craigieburn, Aston’s Observation Park Craigieburn.\n\nThe nitty gritty: parking - pram access - BBQs - shelters - seating - toilet facilities - basketball court - soccer field and goal.","urgency":"medium","formattedAddress":"Destination Drive, Greenvale","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1556100135745-FIILGGANBGQKYUQ8QVJM/Destination+Drive+-+Mamma+Knows+North+%283+of+14%29.jpg?format=500w","_status":"ok"}
{"name":"Aurora Treetops Park, Wollert","description":"Ever heard of a park that has 3 in-ground mini trampolines, solar panel ‘trees’ that power an undercover, communal barbeque AND allow you to plug in to charge your phone or laptop, 2 different sized slides, a spider web rope climbing frame, 3 towers, a suspension bridge and tunnel, swings and lots of smaller, spring based equipment for the little ones? This park is nearly unbelievable! It’s fresh and super modern and has something to suit little and big kids. Mamma intended just a quick stop off but ended up saying an hour with a 1 year old and 11 year old both happy and occupied.\n\nMamma special mention: While you’re in the area, be SURE to check out some of the other incredible parks that Aurora has to offer. Mamma particularly loves Aurora Adventure Playground!\n\nNitty gritty: Undercover picnic tables and barbeque; USB charging stations. Parking is plentiful albeit a little tricky as it’s in a residential area with quite narrow streets. No toilets unfortunately!","urgency":"medium","formattedAddress":"cnr Agnes Lane and Werribee Cres, Wollert","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1562472981380-CSEE6XTGV30W4E7UW1VC/01+Treetops+-+Mamma+Knows+North+%281+of+7%29.jpg","_status":"ok"}
{"name":"ANZAC Memorial Park, Hurstbridge","description":"Nestled in amongst greenery and surrounded by cafes, Anzac Memorial Park is a great spot. Despite being a smaller playground, it packs a punch with options to role play being a medic in the medical tent, driving an army tank, taking on a challenge on the ropes course or doing mind games with a word search or maze.\n\nPretty unique and pretty fun!\n\nDetails: the nitty gritty — picnic table; cafes nearby; fenced from the road (no gate). Address: 910 Heidelberg - Kinglake Rd, Hurstbridge.\n\nMamma’s special mention: Don’t forget to grab a coffee from Black Vice Cafe and Roastery.","urgency":"medium","formattedAddress":"910 Heidelberg - Kinglake Rd, Hurstbridge","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/3c62c1e8-c10c-41b2-8fd1-925aa6bbf489/Copyright+Mamma+Knows+Melbourne+-+ANZAC+Park%2C+Hurstbridge-3754.jpg","_status":"ok"}
{"name":"Anthony Beale Reserve, St Helena","description":"Tucked away among the homes in St Helena, is this bright and colourful, with fun aplenty, little playground. The highlight is a big revolving hamster wheel for humans. It got Mamma's heart pumping. There is also a big stand on carousel which the little ones loved. The playspace includes small slides, rope net climbing frame, two stand on spinners, little wooden stump balance trail, birds nest swing, hammock and a double flying fox with a disk seat and a seat with a harness. All perfect for all ages and all abilities. Check out the wheelchair accessible sandpit which has a creek water feature with hand pump and sluice gates to control the flow of water into the sandpit. The reserve also includes a half basketball court, great for the older kids and a small junior skate area with ramp. Mamma says don't forget your scooters for this one. But this just isn't all - Anthony Beale Reserve has Wi-Fi! You heard right - Wi Fi.\n\nMamma's special mention: Want to get the kids moving, check out Watermarc in Greensborough for some indoor water play or even book into their weekly lessons. (https://www.mammaknowsnorth.com.au/indoor-adventures/watermarc-greensborough?rq=watermarc)\n\nThe nitty gritty: park benches - picnic tables - pram access - walking/bike tracks - wifi - BBQ - water tap - wheelchair accessible - toilets. Want to know more? (https://www.banyule.vic.gov.au/Services/Parks-and-Facilities/Anthony-Beale-Reserve)","urgency":"medium","formattedAddress":"277 St Helena Rd, St Helena, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/599bf2d22994caf792a50a95/1602462506330/anthony+front.jpg?format=1500w","_status":"ok"}
{"name":"Austin Crescent Reserve Playground, Pascoe Vale","description":"Looking for a playground for your next catch up with friends? Mamma’s got you covered with Austin Crescent Reserve Playground. There’s a car park, walking trails from the train station and bike paths all leading to this great playground in Pascoe Vale, it’s easy access for all. And the kids are going to love it! Mamma’s little ones burn off so much energy here thanks to all the climbing options: there’s a ropes course, rock climbing wedge (that also makes a great hiding nook underneath), climbing poles, monkey bars and a giant geometric climbing frame. There’s swings for everyone including two belt swings attached to a clown, a familiar face to many in the North. The merry go round here will get you nice and dizzy, a slide, rope tunnel, and a flying fox that will get you zooming!\n\nThere’s a seesaw to seat 2 or 4 people, or possibly more! Maybe you can see how many you can fit on and let Mamma know! BBQs and undercover tables and seating are a huge plus here! There is a public toilet found across the road where the reserve continues. The playground is mostly fenced off from the road, just open at the crossing, and there is a gate to access the car park which is fully fenced off. So let your friends know and tell them to meet you at Austin Crescent Reserve!\n\nThe nitty gritty: 22 Austin Crescent, Pascoe Vale — carpark; BBQs; undercover seating; toilets; partially fenced.\n\nMamma's special mention: Jack and Daisy’s is close by if you need a coffee fix or feed!","urgency":"medium","formattedAddress":"22 Austin Crescent, Pascoe Vale","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/67203b0cc508865daba622d6/1732614394836/austin+crescent+playground+grid.jpg?format=1500w","_status":"ok"}
{"name":"Aston Fields Playground, Craigieburn","description":"Peet has done it again with this awesome park in Craigieburn. This little beauty, or should Mamma say big beauty will have the little ones exploring and loving it all. The playspace includes full spider constructed playground with climbing pyramid, bridge and nests.\n\nThere are slides, swings, tunnels, rock climbing wall and basketball court. This place is huge. Not to mention the pump water play. Don’t forget you ball and cricket bat because this playspace also includes three soccer pitches and a cricket field. Aston Fields Reserve is perfect for your next family Sunday fun day with BBQ’s and tables big enough for the whole family.\n\nThe nitty gritty: Vantage Blvd, Craigieburn — parking - shade - BBQ's - waterplay - no toilets. Click here for more great parks and playspaces in the north.","urgency":"medium","formattedAddress":"Vantage Blvd, Craigieburn","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5bd6c5618165f5a5e92160a6/1706753894926/aston+fields.jpg?format=1500w","_status":"ok"}
{"name":"Bain Reserve, Coburg North","description":"Bain Reserve in Coburg North is such a great meeting place! There’s a playground with plenty of seating and toilets! There’s also a shopping strip across the road to pick up takeaway coffees or to run a quick errand afterwards.The playground has all the essentials, bucket swing, trampoline, merry-go-round, tunnel, cubby house, slides and climbing frames. There are also excellent additions like a height chart, step-on musical bells and a 4-person seesaw. Pretty cool! The playground is better suited for preschool children. However, the older kids don’t have to miss out. A more advanced climbing frame and a large decking area with a table tennis table can be found along one side of the playground. So, don’t forget to bring your rackets and ball.\n\nBain Reserve is easily accessible by train, bus or car, with Merlynston Station a stone's throw away and the bus stop right on the corner. The playground is semi-fenced along one side, so the kids can safely watch the big buses pull up!\n\nthe nitty gritty: 2 Merlyn St, Coburg North. Picnic table - BBQs - toddler friendly - toilets - water fountain","urgency":"medium","formattedAddress":"2 Merlyn St, Coburg North","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/64ac9edd49b6652f49a74533/1730710108010/bain+reserve.jpg?format=1500w","_status":"ok"}
{"name":"Condell Reserve, Fitzroy","description":"Mamma has just spotted the quietest little park and playspace that is just perfect for a weekday adventure with little ones or a weekend picnic with friends. Perfectly located across from the Fitzroy Town Hall and amongst some of Fitzroy’s favourite places to eat, Condell Reserve is the perfect spot to let the little ones play while you sip your coffee and enjoy the sunshine.\n\nThe park is partially fenced but all in the right places, making it safe for little ones. There are swings, a slide, climbing ropes and bars, a Condell Street Grocer to play shops and lots of green grass to kick the ball around. Condell Reserve is that little piece of delight in a busy city. This playspace is definitely worth visiting.\n\nGrab a bite to eat from Kewpie in Fitzroy and grab a picnic blanket and make a day of it.","urgency":"medium","formattedAddress":"Condell St, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/6447bee43c4dea7c968a6105/1682458146801/condell.jpg?format=1500w","_status":"ok"}
{"name":"Foundation Park, Mickleham","description":"Have you ever seen a piece of play equipment like the centrepiece at this park? You’ll spot this unique tumble slide structure from a mile off and have lots of fun climbing and rolling down once you arrive! There are also in-ground trampolines, a bridge tower with slides, swings, a smaller toddler area, nature play - including Australian animal sculptures - a full basketball court, picnic tables covered and uncovered (including a cute kids sized table set) and TOILETS!\n\nmamma’s special mention: We’ve spotted a coffee cart across the road on weekends!\n\nthe nitty gritty: toilets - picnic tables - pram accessible - basketball court.","urgency":"medium","formattedAddress":"Cnr Balmain & St Georges Blvd, Mickleham, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/6045e55e1bee6050c1e50efc/1622280479540/foundation+park+mickleham.jpg?format=1500w","_status":"ok"}
{"name":"Fortress Park, Doreen","description":"We love being outdoors, especially when it includes a great playground where everybody has a chance to get involved. Fortress Park in Doreen is perfect for a day out. The great wooden structure as the centrepiece of the playground helps enhance the natural surrounding and those beautiful trees. The playground includes a flying fox, swings and climbing web and there are slides for all ages, a walking bridge, fireman's pole, plus a rock climbing wall. This park is huge! There are also bikes tracks, perfect for beginners - a basketball court, tennis wall and even exercise equipment. The grassy grounds with soccer poles are worth a mention too!\n\nMamma's special mention: Have you checked out Slices Restraunt. They are only a short drive away and make some super delicious pasta. Head over for lunch","urgency":"medium","formattedAddress":"Fortress Rd, Doreen, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5b5aed37352f53b21203a58e/1602462018268/fortress+park+front.jpg?format=1500w","_status":"ok"}
{"name":"craigieburn road east playspace 2, wollert","description":"Craigieburn Road East Playspace is the sister playground to the new and very popular Craigieburn Road East Adventure Park. It's only across the road and loads of fun. This playspace is about climbing and slides. So if your little one is a climber then this is perfect. Make a morning of it and invite some friends and pop over to the Craigieburn Road East Adventure Park.\n\nMamma's special mention: Looking for a treat while you're in the area? Check out Two Beans and a Farm Restaurant, open for breakfast, lunch and dinner.\n\nJust give them a call to book.\n\nthe nitty gritty pram access - climb - coffee hub - parking\n\nWant to know more? click here (Facebook link provided on page).\n\nCnr Craigieburn East Road and Edgars Road, Wollert.","urgency":"medium","formattedAddress":"Cnr Craigieburn East Road and Edgars Road, Wollert.","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/59c9dec32994cacd93de7f2e/1602462467307/aurorafront.jpg?format=1500w","_status":"ok"}
{"name":"Civic Drive Playspace, Greensborough","description":"Caution! There is a HUGE snake weaving it’s way through the Civic Drive Playspace in Greensborough! But never fear - this concrete giant ain’t too fast. The scales have been painted by local kiddos and it’s a pretty friendly pal to find in the park. This playground is a brilliant space for the whole gang. There is the epic slide structure reaching into the clouds, a great challenging rock climbing blob and a funky round-shaped - yes round - basketball half court. Then there are the wheel chair accessible features including the spinner and the wheel-up sand pit. There are musical elements including the shiny drums, classic swings, climbing ropes, a log forest AND a flying fox! You guys are going to love this beauty.\n\nMamma's special mention: Around the corner you will find the Diamond Valley Library. A great spot for a quieter moment after the fun of the playground. OR drop in for storytime.\n\nThe nitty gritty: sand - bbq - picnic shelter - opposite leisure centre - library nearby - green space for a picnic - half court basketball - limited shade.","urgency":"medium","formattedAddress":"Civic Circuit, Greensborough","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5c6a25ab53450ac8afaa9c13/1613274265141/03+Civic+Drive+Playspace%2C+Greensborough+-+Mamma+Knows+North+%281+of+18%29.jpg?format=1500w","_status":"ok"}
{"name":"Derby St Reserve, Tullamarine","description":"New playground alert! Derby St Reserve in Tullamarine is more than a playground: a funky new playground, large BMX track, tennis and basketball courts, and an outdoor gym for adults to enjoy a workout. The playground has fun for all ages, with little and big slides, lots to climb, swings, a flying fox, monkey bars… For group sports, there are 2 tennis courts and a multi-purpose basketball/netball/futsal court, plus a separate basketball hoop for shooting practice.\n\nThere’s a dedicated carpark as well as public toilets, plus an undercover seating area with a BBQ and drinking fountain, making the reserve a great place to spend a bit of time.\n\nMamma's special mention: Grab a bite to eat at the lovely Ninth Avenue cafe, which is just down the road.\n\nThe nitty gritty: 26 Derby St, Tullamarine. Public toilets - on-site parking - undercover picnic tables.","urgency":"medium","formattedAddress":"26 Derby St, Tullamarine","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1749092240164-9IRMCGND8HIR3556STJB/Derby+St+Reserve+Tullamarine+Copyright+Mamma+Knows+North-3.jpg","_status":"ok"}
{"name":"Fitzroy Adventure Playground, Fitzroy","description":"Fitzroy Adventure Playground locally known as Cubbies, offers a safe “backyard” for the children of the inner city Melbourne suburb of Fitzroy; a safe place to play, enjoy and develop friendships. It is a mixture of child focused play and activity programs under the direction of staff engaged through Save the Children Australia. This place is fantastic! The playspace features 25 solar panels, energy generating 7.6kw of power on peak days, much of which will go into the club house. There are slides, cubbies, a veggie patch and playspace for ball games. During opening hours Fitzroy Adventure Playground is supervised by three staff members, both male and female.\n\nMamma's special mention: This is a community playground and is only open five days of the week. All families must be registered to play and children under 5 must be with an adult.\n\nThe nitty gritty:\nOPEN Monday, Tuesday, Thursday and Friday 3.30PM - 5.30\nSaturday 12.30PM - 5.30PM\n\nWant to know more? http://cubbies.org.au/","urgency":"medium","formattedAddress":"Cnr Condell and Young St, Fitzroy North, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/593b776e1b631b4d311d59e7/1602462592622/fitzroy+front.jpg?format=1500w","_status":"ok"}
{"name":"Delta Reserve Playground & Bike Education Track, Greensborough","description":"UPGRADE ALERT! UPGRADE ALERT! We love this newly upgraded, unassuming little spot! The bike education/traffic park section is heaps of fun with bike and scooter tracks, a roundabout, pedestrian crossing, give way and stop signs AND petrol station pumps. It’s educational and fun! The playground is small but there are unique pieces of play equipment, some of which we have never seen before. The standout being the cableway: a halfpipe shaped tracked skateboard with chain pulleys. There are also 2 climbing towers with slides; one for smaller kids, a sit-in car rocker, mini rock climbing wall, 2 swing sets as well as a stand alone sling swing, balance logs, half court with basketball and netball hoops and several tables and chairs (one of which is undercover).\n\nMamma's special mention: Directly across the road is Diamond Village Bakery where you can get pastries, treats and a great Vietnamese Roll. If you’re after more of a sit down meal and a great coffee, jump in the car and head to Espresso 3094 which is a 9 minute drive. There are NO TOILETS at this playground but inside Diamond Village Shopping Centre is an IGA where you can get the key to the toilets behind the centre.\n\nthe nitty gritty: Delta Road, Greensborough — traffic park - playground - half court with basketball and netball hoop - pram accessible - several bench seats - shade from trees - covered picnic table - car park at shopping strip - grassy space","urgency":"medium","formattedAddress":"Delta Road, Greensborough","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/60ea7b6b563c1506a8c401d1/1627285386519/excerpt+delta+reserve.jpg?format=1500w","_status":"ok"}
{"name":"copper butterfly playspace, eltham","description":"A playspace with a message - the significance of the Eltham Copper Butterfly. Sitting in the Lower Eltham Reserve is this unique space that is a hive of activity, especially on a sunny Sunday afternoon when the Diamond Valley Railway is running right next door. This playground is all inclusive with an alphabet frieze with the corresponding AUSLAN sign, braille on all its signage and easily accessed play equipment. The space beautiful butterfly climbing panels, a sensory corner with sandpit and water source, a single tunnel slide (that is particularly popular) and a twin flying fox. There is intricate art pieces throughout the fenced space and information boards explaining the significance and the lifecycle of Eltham's own Copper Butterfly.\n\nMamma's special mention: Each Sunday the Lower Eltham Reserve really comes alive with the running of the Diamond Valley Railway. The kind of busy that you might have to do a couple of laps before you score a car park - don't worry - it will be all worth it (plus there is a coffee van)!\n\nthe nitty grittyfully fenced - pram accessible - public toilets - good shade - picnic seating - astro-turf - bbqs - water fountain - sand","urgency":"medium","formattedAddress":"Main Road, Eltham","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/58f710d5d2b857107dfb8e78/1602462829435/Butterfly3.jpg?format=1500w","_status":"ok"}
{"name":"Donnybrook Park, Peppercorn Hill, Donnybrook","description":"Yay, another great playground in Donnybrook! Donnybrook Park is bright and colourful, it’s relatively small but has so much to offer. There are 3 climbing towers in varying heights, elevated mesh tunnels, in ground trampolines and spinner, balancing logs, a rock climbing drawbridge, a mega slide, a basketball half court and shaded picnic areas. The kids will love how bright and engaging the equipment is and being in a new development area, it’s been nice and quiet during our visits.\n\nMamma's special mention: You can’t visit Donnybrook without a trip to Gumnut Park. (There you’ll also find toilets and a cafe).\n\nThe nitty gritty: street parking, nature play, sheltered picnic tables, basketball half court.","urgency":"medium","formattedAddress":"17 Feathertop Cres, Donnybrook, 3064","isPublic":true,"tags":["park","playground"],"imageURL":"https://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/61fde23e72ce5c1f48762387/1657421410228/donnybrook+park-20.jpg?format=1500w","_status":"ok"}
{"name":"Fisher Reserve, Brunswick East","description":"Fisher Reserve in Brunswick East has had an upgrade and it is looking FANTASTIC! Toddler parents, get excited, because there is so much for the little ones to enjoy here and this massive space is fully fenced. The main playground has all the usual favourite play features but on the smaller scale, so an enclosed tube slide with one twist, a low to the ground rope bridge and a short fire mans pole. There’s a shop and cafe front, letter and alphabet boards, as well as an interactive clock and weather station. Scattered around are some other fun items, such as swings, two seesaws, a spinning climbing frame and tunnel climbing frame.\n\nTake a short stroll to the back part of the park to find some balancing logs and stepping stones. The nature play set up here again is great for younger kids, and there’s a little wooden lizard on the ground to say hi to! Older kids can also have some fun here, there’s so much space to run around and a ping pong table (BYO rackets and ball). Mamma can take a seat on the many benches available and if you need, there's a picnic table as well.\n\nThe nitty gritty: 8 Noel Street, Brunswick East. Amenities: Drink taps, Playground, No Toilets. Two entry points - Noel St or Glenlyon Rd.\n\nMamma's special mention: Feeling a little hungry? Head just around the corner to Bellboy Cafe!","urgency":"medium","formattedAddress":"8 Noel Street, Brunswick East","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/66b18838cba7457f6b0746e4/1730709962952/fisher+reserve+brunswick-09.jpg?format=1500w","_status":"ok"}
{"name":"diamond creek reserve playground, diamond creek","description":"There is somethin' special about a kids party in the park, and this playground and community space is made for it. The Diamond Creek playground is delightful. It has got a great fresh feel with the spongy flooring and some cool modern equipment including a hammock for Mamma to chill out in, a cool spinner that will certainly make you dizzy and acute shop counter complete with cash register. The playground is suitable for a mixture of ages plus with a basketball half court, open fields, bike tracks and a table tennis table, everyone will have a ball before returning for a snag off the barbie in the Rotary picnic shelter.\n\nMamma's special mention: If you are looking for a bite to eat before or after your play, head to Shillinglaw Cafe in Eltham. It's only a short drive away but worth every quiet sip while the little ones enjoy the outdoor sandpit.\n\nthe nitty gritty: toilets - bbqs - picnic shelter - table tennis (bat hire from service station over the road) - walking trails - semi fenced - netball courts - basketball half court","urgency":"medium","formattedAddress":"2 Diamond Street reserve, Diamond Creek, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5a8ca6f8ec212d6749c39a51/1602462372013/03+Diamond+Creek+Reserve+Mamma+Knows+North+%281+of+22%29.jpg?format=1500w","_status":"ok"}
{"name":"Cross Keys Reserve, Essendon","description":"Essendon has a brand NEW playground, and it is AMAZING! There is much to do here at Cross Keys Reserve with equipment encouraging sensory, natural, imaginative and physical play! You might start at the giant busy board, which is full of things that move and make noise and then head to the 4-seater seesaw. Next, find your way onto the rope climbing platform or climb up what looks like a giant ant hill to find a trampoline!! There’s also an interactive cubby house to keep little ones busy, three swings to choose from and a massive climbing structure leading to a long twirly slide.\n\nBring your bikes or scooters to ride on the mini arrowed circuit with road signs and even an interactive petrol pump to refuel at. Then stop off at the play cafe, where you’ll find a set of scales, table, and chairs or visit the play vet fitted out with a cash register. The space here has some new plants and greenery growing and some beautifully carved animal statues scattered around to find; it’s hard to miss the huge owl, but Mamma also spotted a frog, bat, possum and spider. BBQ facilities, tables and chairs, a water fountain and heaps of parking options also exist. The Cross Keys Reserve oval and a new basketball court are next to the playground.\n\nSo whether you need somewhere for a quick play or to spend a whole afternoon, Cross Keys Reserve playground is a fantastic choice!\n\nthe nitty gritty: Woodland St, Strathmore — Picnic tables, BBQ - playground - basketball court - oval - NO toilets.\n\nMamma’s Special Mention: Francis Winifred is just a short drive away and serve up some delicious burgers.","urgency":"medium","formattedAddress":"Woodland St, Strathmore","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/64e0a010709e751e86166f3d/1692650661278/cross+keys.jpg?format=1500w","_status":"ok"}
{"name":"Coronet Park, Flemington","description":"Coronet Park is a very sweet little suburban park nestled between the lovely Stables Community Cafe and neighbouring homes. We have been here on occasions and spotted a horse and carriage in the surrounding streets too. It is a lovely neck of the woods. The park itself is small but has a number of draw cards to it that keep us going back. The big one is of course......is the community cafe - we love a side of coffee with our climbing and playing action. That's the way Mamma and her crew are! The other important factor is of course the play equipment. The climbing frame, the cubby, the nest swing and all the other bits and bobs plus the park is fairly well fenced in too and all of those things make it tricky to drag the kids away....which is again, Mamma reiterates why the cafe comes in handy for latte number 2 or perhaps even lunch.\n\nMamma's special mentions: Aside from Stables Community Cafe, you are not far from the fabulously famous - Mama Bear Cafe too!\n\nThe nitty gritty: lots of parking - pram access - toilets nearby (in the Stables Community Cafe) - some shade - BBQ - lots of seating.","urgency":"medium","formattedAddress":"Coronet St, Flemington VIC 3031, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1493584182836-817GP3RE1RVON8DIYJ0P/coro%2Bpark%2Bcoll%2B2.jpg","_status":"ok"}
{"name":"Cloverton Water Playground and Park, Kalkallo","description":"What fun this place is! Huge swirly slide, water play, flying fox, cafe, swings and lots more in the one fantastic spot. This lovely space has been created for the local new development estate but all are welcome to enjoy it (lucky us!). The huge slide was a favourite - but on a hot day the water play with overhead mist, and underfoot water jets is the most fun!!\n\nThe seed pods are a great place to enjoy too with interesting little surprises in the floor! There are lots of little tidbits to look for which tells the history of the area too. Hang out on the grass, take a seat on a rock bench seat or sip on a coffee and snack on some lunch while the kids have a wonderful time exploring!\n\nThe nitty gritty: Corner Dwyer Street & Design Way, Kalkallo. This playground is open limited hours during 10am-5pm 7 days. FREE - parking - toilets - cafe - highchairs - enclosed - water play.","urgency":"medium","formattedAddress":"Corner Dwyer Street & Design Way, Kalkallo","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5c48ff1cbba223630db15e43/1731992333877/livvis+excerpt+2.jpg?format=1500w","_status":"ok"}
{"name":"Diamond Creek Regional Playspace, Diamond Creek","description":"Whether you have bigger kids or little kids, the whole family is going to LOVE this ENORMOUS playspace. Based on the gold panning history of the town, this giant playground has everything you could want for a family adventure. The big kids will flock to the Parkour zone around the replica poppet head and other climbing frames or head straight to the wide open green space in the middle. The little kids will wanna have a swing, crawl in the tunnel, find the cubby houses or whiz down a slide. But everyone will want to have a dig! Mamma’s favourite feature has to be the huge sandpit. This unique design has its own mining carts that travel around the entire perimeter of the space. Kids will transport their sandy ‘finds’ around to sorting stations, digging pits that are located at points around the sandpit. If you are REALLY lucky … there could even be some gold hidden. The central depot is brilliant too - complete with water pump and shade - what all good sand pits should have!\n\nWhat is better than a playground … a playground with a CAFE INSIDE IT! That is right. The local Rotary Club worked together to restore this beautiful W Class Tram and have converted it to a really cool coffee shop, called the Tram Cafe. It is located at the back of the playspace where you can enjoy the beautiful view of the park and grab a coffee, a milkshake or an ice cream. It is an exceptional play zone that will be enjoyed by families for years to come!\n\nMamma’s special mention: The Playspace is located along the Diamond Creek Trail - just like some other Mamma favourites - the Edendale Community Environment Farm and Eltham North Adventure Playground.\n\nThe nitty gritty: picnic tables - green space - bbq - public toilets - shade sails - off street parking - local tourism kiosk - walking paths - fully fenced dog park nearby - close to public transport.","urgency":"medium","formattedAddress":"Enter from 28 Main Hurstbridge Road, Diamond Creek and head to behind the bowls club","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5f9cea360e604768dbf5898f/1659841910226/05+Diamond+Creek+Playspace+-+Mamma+Knows+East+%281+of+58%29.jpg?format=1500w","_status":"ok"}
{"name":"Clarinda Park Playspace, Essendon","description":"Well folks, the cutest little playspace in Essendon has expanded, and Mamma sure isn’t mad about it! Clarinda Park Playspace is small, but mighty - mighty fun for your little ones! The space sparks fun and adventure through a huge range of equipment and nature play.\n\nThe play space includes a swing set, slide, ladder, trak ride, 4-way animal themed springer, in addition to a high rope climb, bright coloured cluster climbers, a humongous sand pit, an obstacle trail made of rocks and timber logs, and balance beams galore! So much fun! Mamma loves how the majority of this play space is covered by a shade sail to keep things cool and comfortable, and how there are plenty of benches for relaxing and gathering.\n\nThe nitty gritty: 38 Clarinda Road, Essendon — drinking fountain - undercover areas - seating - street parking - no toilets. Mamma's special mention: Grab yourself a sandwich from 3 Salamis on the way!","urgency":"medium","formattedAddress":"38 Clarinda Road, Essendon","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/687b6d4b90921d333f8a53cd/1754347079209/Clarinda+Park+Playspace+Essendon+Copyright+Mamma+Knows-5.jpg?format=1500w","_status":"ok"}
{"name":"De Chene Parade playground, Coburg North","description":"De Chene Parade play space is the sister play space to the very popular Coburg Lake Reserve Playground and only across the Coburg Lake bridge. This is super cute and is filled with so many little pockets of excitement. You and your little ones will enjoy the 'outdoor lounge' with its magical creatures and favourite toys carved into a lounge suite. There is also a great flying fox, a five-way swing, a maze and a outdoor 'Twister' board. This play space is perfect for a little gathering or a play. Bring a ball and enjoy the grassy space for a game of footy or cricket.\n\nMamma's special mention: Unfortunately there are no toilets close by, you are however with Coburg Lake Reserve playground close by, it's a quick walk over the bridge. Check out Pomona they are only a 5 minute drive away but super delicious.\n\nThe nitty gritty: Outdoor table - street parking - outdoor gym - bike/walking track. Want to know more? http://www.moreland.vic.gov.au/events-recreation/parks-and-trails/playgrounds/\n\nDe Chene Parade, Coburg North","urgency":"medium","formattedAddress":"De Chene Parade, Coburg North, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/595c4c92ccf2107d76bd4868/1602462562937/de+chene+parade+playground+front.jpg?format=1500w","_status":"ok"}
{"name":"Curtain Square, Carlton North","description":"This park ticks all of Mamma's playground 'fun requirement' boxes - with green open space, gorgeous mature trees, a variety of places to play - including a playground for the little tots, the bigger kids and another swing section, some hoops to play netball or b ball, toilets and close by to the lovely Rathdowne St to grab a coffee, have a browse and grab some lunch. Mamma (and the kids) also love the handcrafted totem poles covered in carved animals and the other creative touches that make this place special.\n\nMamma's special mention: The Carlton Library is right across the road so grab some books on your way home.\n\nNitty gritty: Free parking 2 & 4 hrs, coffee close by - toilets - shade (trees and shade sail) - dogs on leads - fenced (with open gateways)\n\nLocation text on page: Rathdowne St, Carlton North","urgency":"medium","formattedAddress":"Rathdowne St, Carlton North, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1492571613608-2DS95F2YBLWAAH9G8HXD/Curtain+Square+%285+of+37%29.jpg?format=500w","_status":"ok"}
{"name":"Ford Park, Bellfield (Ivanhoe)","description":"This park is filled with fun for all. There are slides for some slippery action and spider webs and ropes to climb, turrets to tower over the land, stepping logs and did we mention the sandpit!? Mamma loves the musical instruments and rocks dotted around the park giving little explorers a little surprise every now and then and for those who prefer a ball game, there is also an oval nearby.\n\nBring the push bike and check out the little bike ramps and scooter trails made especially for the little ones. It’s small and perfect! This would have to be Mamma’s first look at an expression swing in the north. And the verdict - AMAZING! Such a delight seeing your little one smile as you both swing together. Ford park also includes BBQ’s and shelter making this place perfect for your next family gathering.\n\nMamma's special mention: The Train Yard is a 6 minute drive away and serve up some delicious food. The kids menu is on point and the staff always have a smile. Worth a visit!\n\nThe nitty gritty: good shade - toilets - barbeque - benches - street parking - open green space","urgency":"medium","formattedAddress":"247A Banksia St, Bellfield/Ivanhoe","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5cbe51589b747a71ce1f16da/1602461405510/ford+park+front.jpg?format=1500w","_status":"ok"}
{"name":"Eltham Lower Park Playground, Eltham","description":"A fresh addition to Eltham Lower Park, this upgraded playspace is a great option for an easy park pit stop or the perfect place to set up for a party or family BBQ. There are multiple picnic tables, covered rotundas, and several BBQs, making it super family friendly and ideal for gatherings. The playground caters to both little ones and bigger kids. The main climbing structure is a bit of a challenge (better suited to the 5+ crew), but still plenty of fun options to keep the younger kids entertained.\n\nOne of the best parts about this park is everything else that’s around it. You’re right next to the Diamond Valley Railway, so if you’re there on a Sunday, you can pair your park visit with a train ride and a treat from the ice cream truck which is regularly set up on Sundays and always a winner.\n\nDirectly across the road there’s an oval, perfect if you’ve got a ball obsessed kid like mine. You can get a good play in at the park, then cross over for a kick of the footy or to run off some extra energy.\n\nThe nitty gritty: Hohnes Rd, Eltham VIC. Drinking fountains - undercover seating - BBQ facilities - off street parking.","urgency":"medium","formattedAddress":"Hohnes Rd, Eltham VIC","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/68954d6b648bef3170772a35/1757122246876/Copyright%2BMamma%2BKnows%2BNorth%2B-%2BLower%2BEltham%2BPark-4621.jpg?format=1500w","_status":"ok"}
{"name":"Fanny Street Reserve, Moonee Ponds","description":"Here’s a spot that offers so many options for fun! With a playground, BBQ, large open space, and even a dirt BMX track, Fanny Street Reserve will surely please everyone and keep you entertained! The amazing wooden boat-shaped playground, with its attached climbing structures, slides and monkey bars, is the perfect place to start. There's even a space underneath that can be used as a play house or shop. Next to it, you’ll find a multilevel sandpit, flying fox, rowboat, see-saw and basket swing.\n\nAround the playground, there are plenty of seating options and a patched area for easy access for prams and wheelchairs. Younger riders may like to use this path to ride their bike or scooter as well, while the more confident riders can show off their skills on the dirt track. You’ll find this park along the Moonee Ponds Creek Trail, a great travel option if you want to ride your bike here! But if the trail is not part of your route, not to worry, there's a car park attached to the park.\n\nThe nitty gritty: 18 Fanny St, Moonee Ponds — picnic tables - BBQ - bike track - seats - toddler friendly - no toilets.\n\nMamma's special mention: Brother Hen is only a short walk away and is home to some of the most delicious, unique dishes that everyone will enjoy.","urgency":"medium","formattedAddress":"18 Fanny St, Moonee Ponds","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/64a35a5f80ab2d7d7c261145/1689034461441/fanny+street.jpg?format=1500w","_status":"ok"}
{"name":"Coburg Lake Reserve, Coburg North","description":"Wow! Wow! Wow! If it's fun, exciting and all about adventure you are looking for, then this place is for you. Coburg Lake Reserve is perfect for the WHOLE family. This place has it all - bike/walking tracks, lake, BBQ area and loads of seating.\n\nThere is onsite parking and tonnes and tonnes of space. And then there's the playspace - Wow! It's huge! There is a rocket ship playground with two huge slides, swings, mini space playground for the little ones and a climbing gym. After a play, we love to watch the local ducks by the lake! Coburg Lake Reserve is also the home of regular festivals and events. Check out the Moreland City Council website for upcoming events.\n\nMamma's special mention: Paninoteca is just up the road and has some delicious home-made rolls - Perfect for lunch in the park.\n\nThe nitty gritty: 2A Gaffney Street, Coburg North. onsite freeparking - toilets - seating - lake - bike/walk trail - outdoor gym -  BBQ - picnic tables - coffee and jaffle van during popular times. Want to know more? See the Moreland City Council page linked on the original article.","urgency":"medium","formattedAddress":"2A Gaffney Street, Coburg North","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1691038528459-U7SYZ22S86T7IJ0GL2VL/coburg+lake+reserve%2C+coburg+north+-+copyright+2023+mamma+knows+melbourne-3.jpg","_status":"ok"}
{"name":"CB Smith Reserve, Fawkner","description":"CB Smith Reserve in Fawkner has had a glow up and Mamma is so impressed. A brand new double climbing tower is the stand out attraction here, with various climbing options, a huge tunnel slide and a rope bridge at the top, way up high to help you cross over to the other tower. The little ones will love the shop front, jail rope bars, xylophone and line up 4 game built in at the bottom. There’s a massive sandpit, which Mamma has made a mental note to bring some diggers and sand toys next time we come to utilise it for longer. A set of 4 swings plus a rope web swing, floor spinner and musical flowers.\n\nWith so much fun to have here, Mamma loves that there are toilets, undercover table and chairs, bbqs and drink taps, making it easier to really settle in for a few hours here. There’s also so many shady spots around thanks to the big trees and sails. This playground is at an awesome location. It is right next to Fawkner Library as well as the newly refurbished pool and Maternal and Child Health Centre. There’s also a skate park and footy oval accessible from the car park. Something for everyone to enjoy!\n\nThe nitty gritty: 58 Ledger Ave, Fawkner — drink taps, toilets, undercover picnic tables, BBQ facilities, carpark.","urgency":"medium","formattedAddress":"58 Ledger Ave, Fawkner","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/67c8ef792a70422b652c519f/1745374252421/CB+Smith+Reserve+Fawkner-3.jpg?format=1500w","_status":"ok"}
{"name":"De Chene Reserve, Coburg","description":"Have you ever wanted to play inside a castle? Well, at De Chene Reserve Playground in Coburg, you can! Parks like this bring Mamma right back to her own childhood of running up and down the boardwalks and paying tiggy with our buddies. Mind you, we NEVER had a slide this wide or this shiny! De Chene Reserve is tucked in, off the busy Bell Street and the kids will love the castle design.\n\nEnter via the draw bridge or climb the wall using the chain to the towers. There are stairs and ladders to help you navigate the two slides, one very long or a wide slide you could go on with a friend! Below the castle are hiding spots to explore, a funhouse mirror, a clock and a play shop. Set among the trees and shrubs with Merri Creek running behind it, De Chene Reserve Playground is a lovely spot to visit. There is also a seesaw, two sets of swings and a sandpit with a digger. A few picnic tables and a water fountain for refuelling after a play can also be found here.\n\nAlthough the playground feels quite hidden, getting here is easy! De Chene Reserve car park is a short stroll uphill from the playground and is accessible via Urqhart Street. There is also a bus and tram stop on the main roads nearby. There’s plenty of nature play with a sand pit and trails nearby. So grab the crew, have a stroll along the Merri Creek Trail and have a play at this little beauty.\n\nThe nitty gritty: 193 Urquhart St, Coburg — Picnic tables - water fountain - carpark - NO toilets - walking trails nearby - ovals nearby - off leash dog park nearby","urgency":"medium","formattedAddress":"193 Urquhart St, Coburg","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5cfdc46030938c00012c32af/1730710118196/de+chene.jpg?format=1500w","_status":"ok"}
{"name":"eaglehawk play space, eaglehawk (bendigo)","description":"This place is about as wonderful as wonderful playgrounds can possibly get! Named and themed after the Banjo Patterson poem “Mulga Bill’s Bicycle” which is set in Eaglehawk - the playground is separated into different areas, including a gated toddler section, nature play area and active and adventure play spaces. The lovely Neangar Lake makes for an epic backdrop.\n\nThere is so much to discover here but some of the highlights include 2 human sized hamster wheels, a double bicycle pedal spinner ride, a ginormous wide slide for side-by-side sliding, a flying fox, cable climb section, tree stump forest, 3-slide, multi level climbing tower, huge basket swing and an in ground trampoline. In the fully fenced toddler area you’ll find a talking book audio station reading the story of Mulga Bill (so cool!) and a wooden Mulga Bill cubby house, a large sandpit with water play, giant butterfly sculptures, an adult and child expression swing, see-saws, musical play stations, balance logs and a small climbing tower with slide.\n\nMamma’s special mention: Bring the bikes and go for a ride at the nearby Mulga Bill Bicycle Trail. And don’t forget to check out the Discovery Science & Technology Centre while you’re in town!\n\nthe nitty gritty: Napier Street,Eaglehawk — toilets with change facilities - playground shade sales - several picnic tables with cover - green space - street parking - pram accessible and all abilities play options","urgency":"medium","formattedAddress":"Napier Street, Eaglehawk","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5ff3a7a2c477ea2dc0794a4a/1621751264967/excerpt+bendigo+eaglehawk+play+space.jpg?format=1500w","_status":"ok"}
{"name":"Aston's Debonair Parade Park, Craigieburn","description":"Mamma loves a community park and Peet have done it again with this little gem at Aston. Nestled in among some gorgeous big trees you will find a playspace that is lots of fun for the kids. The main attraction is a large 'Indiana Jones' inspired rope bridge leading to a cool wooden cubby structure - complete with windows and a slide, the whole space encourages lots of imaginative play.\n\nThere is also a smaller playground structure with a smaller slide for the little ones plus some great swings purpose built for safety! Mamma also loves the walking, scooting and bike trail around the perimeter too. Oh and there is plenty of spots for parents to sit and relax and watch the kids play!\n\nThe nitty gritty: Debonair Pde (Near Craigieburn Road), Craigieburn — pram accessible; some shade; picnic tables; walking/bike trail; no toilets.","urgency":"medium","formattedAddress":"Debonair Pde (Near Craigieburn Road), Craigieburn","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/591e71a26a496390edc5e880/1705003684800/debonair.jpg?format=1500w","_status":"ok"}
{"name":"Edinburgh Gardens and Playground, North Fitzroy","description":"What a beautiful place to explore. There are playgrounds, an off-leash dog area, a basketball half court, volleyball, tennis courts, BBQ facilities, lawn bowls, bike paths. You can quite simply take a stroll or have a picnic. You could easily spend a day here with friends and family, in fact, Mamma has had plenty of good times here with friends over the years - it is in fact a great spot for everyone to enjoy.\n\nWith plenty of magnificent trees for shade and lots of lush grass to pull up a picnic blanket, the playground closer to St Georges road is great for all ages. There are climbing ropes, swings, a sandpit and lots of options for both toddlers and preschoolers. Bring your skateboard or scooter and test yourself on the skate ramps. The all-inclusive vibe of the park gives little ones the opportunity to chat and learn from some of the professionals skating around.\n\nHead to Edinburgh over the weekend and you may even catch some local DJs busting out some tunes as well as Mr Whippy doing ice cream laps around the park. Mamma can honestly say, every time we visit there is always something fun and surprising around.\n\nThe nitty gritty: Alfred Cres, Fitzroy North — toilets, shaded seating, BBQ, picnic tables.","urgency":"medium","formattedAddress":"Alfred Cres, Fitzroy North","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/63fec686597f963daac498ff/1682457159356/edinburgh.jpg?format=1500w","_status":"ok"}
{"name":"ceres playspace: terra wonder, brunswick east","description":"This awesome and incredibly unique play space re-opened late last year with a very cool new addition - a GINORMOUS millipede structure! It’s huge enough that you can climb through it and was built (incorporating some ideas from surveyed local kids) using materials like recycled truck and crane parts. We love dropping by for a play here while at CERES - the play equipment’s construction using recycled industrial objects makes it a spot like no other. You won’t find any plastic at this ‘soil’ themed play space but you will spot beetles and bugs, a multilevel sandpit, a hive-shaped mud cubby, steep rocky banks with a tree house built from old tyres with pulleys for climbing and heaps of nature play elements. There’s also nearby seating, toilets and cafes.\n\nMamma's special mentions: CERES is one of Mamma's all time fave places to visit with the kids in Melbourne. As well as the play space there are two cafes, an organic grocery shop, a nursery, a weekly Makers and Flea Market (Saturdays) and so many chickens to visit - there’s heaps to do here!\n\nThe nitty gritty: free admission (donations accepted). Park and grounds are open during daylight hours. Dogs are allowed on leashes. Merri Cafe: Thursday – Sunday 9am – 3pm. Organic Grocer and Cafe: 9am - 5pm (cafe closes at 3:30pm) 7 days a week. Location: Stewart St & Roberts St, Brunswick East. Wanna know more? http://ceres.org.au/","urgency":"medium","formattedAddress":"Stewart St & Roberts St, Brunswick East, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/600f7cffec993c3d7c0a3317/1730709933572/terra+wonder+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"Aurora Adventure Park, Wollert","description":"Just take a look at this amazing playground in Wollert! There are slopes, rope bridges, mini trampoline, tunnels and kinetic movement play equipment - honestly Mamma could go on and on and on about the elements of play here. It is fantastic. There is heaps for the big kids here too. Aurora Adventure Park is everything futuristic. It even has FREE WIFI!! It got Mamma super excited and the little one burning that extra energy made our evening time a whole lot easier. AND!! It glows in the dark at night!! You are really going to have to just take Mamma's word for it and go and check this one out! Like....go....NOW!\n\nMamma's special mention: Worked up an appetite? Stop over at Waterside Cafe for lunch with a view!\n\nthe nitty gritty: park benches - rain shelter - picnic table - electric BBQ - pram access - WIFI\n\nWant to know more? click here (Facebook link available on page).","urgency":"medium","formattedAddress":"Cnr Craigieburn East Road and Edgars Road, Wollert.","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/59a8e03a893fc067169685b3/1562197456237/aurora+front.jpg?format=1500w","_status":"ok"}
{"name":"edwardes lake park, reservoir","description":"If you grew up in the north, you would have definitely heard of Edwards's Lake Park and most would have either played, picnicked or attended a sports or community festival there. Edwardes Lake Park has been a part of Reservoir for as long as this Mamma can remember. With a flying fox, a massive slide, 2 rope climbing stations, sandpit and music play, this park is perfect for any adventurer. Not to mention excellent facilities, BBQ's, gazebos and easy parking. Most weekends you'll find the Mr Whippy van out front serving up your favourite treats. Edwards's Lakes park is the host to cultural festivals, scouts and school activities, but mostly a popular venue for young families to play on the swings, and young athletes to train on the track.\n\nPerfect for all age groups, even the BIG kids.\n\nMamma's special mention: Enjoy a play and then head over to Off The Boat for a take away pizza or to dine in.\n\nthe nitty grittyold train to climb - most of playground is fully fenced - good shade - bbqs - flying foxes - public toilets - picnic shelter - walking trails - sporting fields - fitness equipment\n\nEdwardes St & Griffiths StReservoir","urgency":"medium","formattedAddress":"Edwardes St & Griffiths St, Reservoir, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/58f82341b3db2b6374b831fc/1602462713304/edwards+lake+park+169.jpg?format=1500w","_status":"ok"}
{"name":"Darebin Creek Parklands Playground, Epping","description":"The Darebin Creek Parklands playground has been transformed with fresh features including heaps of nature play elements, unique climbing structures, a cubby house, rockers, spinners, an arched see-saw and an exercise equipment station. There is also a great covered picnic area and a pedestrian/bike park. The trees, logs and shrubs make for a lovely bush setting.\n\nMamma's special mention: Looking for another cool playground in Epping? Head to Lehmans Farm Park!","urgency":"medium","formattedAddress":"Dalton Road / Park St, Epping","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/61944d4b38513f0ebbbbcd39/1642057791656/darebin+creek+parklands%2C+epping.jpg?format=1500w","_status":"ok"}
{"name":"warr reserve, brunswick","description":"Nestled behind the busy Sydney Road in Brunswick, Warr Reserve is a perfect space to let the children roam and play. The park isn't too big but includes three great play spaces -  one which has been newly refurbished, an old school favourite and a nature play space. This park is not too big making it relaxing and not so overwhelming. It's also a popular picnic spot for families and Mamma now knows why. This heritage listed park is your quiet space in a busy city. This is one park to definitely tick of your list.\n\nMamma's special mention: Miss Marmalade isn’t far! Pop in for a little play and a bite to eat. (https://www.mammaknowsnorth.com.au/eats/miss-marmalade-brunswick)","urgency":"medium","formattedAddress":"5 Wraith St, Brunswick","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5a26742824a694db5ade6330/1730709972469/warr+front.jpg?format=1500w","_status":"ok"}
{"name":"Woodend Children's Playground, Woodend","description":"What a gorgeous playground! Firstly, it’s HUGE, and has so many zones, so kids of all ages will love it here. At the front is the fenced playground for the little toddlers, then as you wander along the lawn and pathway you hit the BBQ’s and shelters that were full of kids parties when Mamma visited. Beyond this ‘party’ area you will find another playground for mid-aged kids with a slide lots of places to climb and swing, and more BBQ’s. Just outside of the designated play space, Mamma’s kids love the rocks and ‘dragon’ log - so good to climb and ride on! Further around the park you will find a huge spider web to climb and flying fox and even a stage! Mamma says you must visit here on your next road trip!\n\nThis park was created by the community of Woodend 10 years ago in memory of a brave little local boy called Robbie Lodder. The community got together and raised funds, volunteered their time and worked hard to create this wonderful space. What a great community.\n\nThe nitty gritty: 12 Nicholson Street Woodend — street parking - toilets nearby (across the footbridge that crosses the creek) - undercover bbq’s.\n\nMamma’s special mention: After a good play head to Bourkies Bakehouse for a pie and vanilla slice!","urgency":"medium","formattedAddress":"12 Nicholson Street Woodend","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5ce8c0b7ec212dd47af6cdf7/1727729019387/woodend+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"woodlands park, essendon","description":"Woodlands Park is the perfect green space amongst the beautiful homes and businesses of Essendon. An excellent, spacious spot for a picnic. Nestled behind Bulla Road - it's a great open space with wetlands, a playground, lush green grass and beautiful old trees. Recent upgrades have included improvements to the ponds with the addition of three new floating islands, creating a habitat for local wildlife, upgrades to pathways and park furniture, new exercise equipment and bike repair stations, new bbq areas and rotunda and a new storm water harvesting project, helping to more sustainably irrigate the park.\n\nThe playground has been improved while retaining some favourite play structures like Bunyip Sculptural Garden, the large seesaw and the bumble bee rocker. The most noteworthy new additions are the nature play elements like rocks, dry creek beds, logs and beams. There are rope climbing frames, small and larger slides, monkey bars, swings and lots more. Woodlands Park House is being upgraded during the next phase of development and will eventually be available for hire. The most special part is all the wildlife you can spot. There are lots of duck families living in the ponds. Just a reminder - do not feed the ducks! They have all the food they need in their natural environment.\n\nMamma's special mention: Demazzi Stone and Grill is literally a 4 minute walk and worth checking out. There is a bike path, playground and lake. Essendon Traffic School is also nearby for future reference.\n\nThe nitty gritty: Toilet - undercover; BBQs - Shelter; free street parking; smooth pram friendly paths; picnic benches and tables; shady picnic spots; active supervision of children needed around water.\n\nCnr Woodlands Street and Carnarvon Road, Essendon","urgency":"medium","formattedAddress":"Cnr Woodlands Street and Carnarvon Road, Essendon","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5b53f5f08a922d868edbeead/1602461989255/woodlands+park+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"Wylie Reserve Playground, Brunswick West","description":"Wylie Reserve Playground in Brunswick has had a fabulous new upgrade! It is fully fenced and full of fun! There is a large sandpit, ride-on wobble animals, a merry-go-round and two play structures for kids to explore. One is a double-story cubby house with a speak/listen to tube travelling between both levels, a tunnel, a double slide, a climbing pole, a rope climbing frame and monkey bars attached. The other one is better suited for toddlers and has a shop front, tunnel, small slide, abacus and even a chalkboard for drawing! Mamma and bubs can join in on the fun, with a parent and child swing here too!\n\nThere is a picnic bench to sit and have snacks on and some space near the front of the playground to place a picnic rug. The playground is next to a dog-friendly oval with BBQ facilities and soccer goals for even more fun!\n\nThe nitty gritty: 256 Union St, Brunswick West — fully-fenced playground - BBQ - soccer oval - dog-friendly.\n\nMamma’s Special Mention: Feeling hungry? Check out one of Mamma’s top cafes in and around Melbourne’s north.","urgency":"medium","formattedAddress":"256 Union St, Brunswick West","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/64e4116bd0caac53663060b3/1730709938966/wylie+reserve+playground%2C+brunswick+west+-+mamma+knows+north+-+copyright-5.jpg?format=1500w","_status":"ok"}
{"name":"Whittlesea Public Gardens, Lalor","description":"What a way to bring in 2023, with a brand-spanking new re-vamp playground. Whittlesea Public Gardens is HUGE! The wooden structure has been designed to give kids of all ages a challenge. The main playground is a whopping five levels high with ladders and ropes along the way. Make it to the top and use the speaker to chat with your friends below. Then slide your way down the GIANT slide. The second play space is smaller and perfect for the littlest of adventurers. You’ll find soft foam surfaces around the place too, making it super safe. Whittlesea Public Gardens also includes a flying fox, a trampoline, and climbing ropes. There is a ropes course, wooden cross-over beams and challenging bridges to cross. There is also a ‘learn-to-ride’ track, so don’t forget your bike, scooter or skates! The park also includes a water tap and toilets which is a big tick Mamma thinks. Follow the pathway around the large man-made lake, spot some water birds and then head over the Hume Highway overpass for something different. We even spotted some gym equipment and a basketball court near the car park.\n\nYou are going to want to prepare for this park before visiting. Bring a picnic and some snags for a BBQ. There are picnic tables are covered, keeping you right out of the sun. Don’t forget a hat on warmer days. Although there are trees almost everywhere, the park is still pretty new and many trees around the playground are still small, limiting shade while the kids play.\n\nMamma special mention: There is still a lot Mamma needs to discover about Lalor but if you are wanting something to eat before a play, head over to our Eats page and find something on the way.\n\nThe nitty gritty: 158 Barry Rd, Lalor — BBQ facilities, large shelters, picnic tables, public toilet, free parking, pram and wheelchair accessible.","urgency":"medium","formattedAddress":"158 Barry Rd, Lalor","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/63afb459aac0bb5713a4a6a8/1672464664165/whittlesea+gardens.jpg?format=1500w","_status":"ok"}
{"name":"wonguim wilam playspace, warrandyte","description":"The locals of Warrandyte are always on to a good thing and now they have a BRAND NEW playground to find some adventure!\n\nTucked in behind the lolly shop and down the stairway from The Bakery, the playground is the perfect starting point for exploring the treasures that lie along Yarra Street. Gone is the gold mining theme of the previous playspace and now it is a new wooden masterpiece, with epic treetop style cubby houses to explore and the playground is now named wonguim wilam (pronounced won-goom-wil-lum).\n\nThe kids certainly won’t get bored quickly here. There are heaps of challenging ropes courses (similar vibes to ones found at Valley Reserve), swing sets along with a dancing snake (the spinning rope structure), inbuilt trampoline mats and a water pump complete with a blue riverbed and dam walls. There are little treasures to be found too - a shop under the slide that makes great milkshakes (or so they tell us) and a little tea party table made of logs. The playground is fenced (although, not the most secure of barriers!) and shaded by both the stunning ghost gums, as well as shade sail.\n\nMamma's special mentions: be sure to take a stroll along the banks of the Yarra River. Just down the stairs from the playground is a perfect spot to dip your toes in the chilly water or watch the rapids. You can also dig out a gold coin and grab a bag of duck food (the proper stuff - not bread) from the Bakery and feed the ducks.\n\nThe nitty gritty: shaded - water play - bbqs further down near the car park - toilets within walking distance - limited pram access (some stair cases to navigate) - cafe - picnic shelter. Location reference: Yarra Street, Warrandyte.","urgency":"medium","formattedAddress":"Yarra Street, Warrandyte","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/6326c66794210c5910a351dd/1669004145998/01+Copyright+Mamma+Knows+East+-+wonguim+wilam%2C+warrandyte-0741.jpg?format=1500w","_status":"ok"}
{"name":"Wombat Bend Playspace, Templestowe Lower","description":"Wombat Bend has got a wonderful reputation - Mamma can see why. It has everything. A maze with interactive Marco Polo buttons. Noisy stomping bridges. A sand pit with its own water and tunnel system. Slides. Swings. Cubbies and climbing frames. But what this park is known for is the flying foxes and bat-winged spinning wheel. Kids were lining up for ages waiting for their turn on the bat wings and flying from one end to the other. The park is fully fenced and is laced with beautiful carved wombats and other tile art through out, including a map - just in case you get lost. There are lots of pathways and grasses to walk through too. It is nice that there is plenty of natural elements that act as screens between activities - it feels like it is huge! Just outside the gates too is a nature play centre where children are encouraged to build bush cubbies - Oh how Mamma LOVES a bush hut!! The playground sits beside the Yarra and has wonderful picnic facilities around.\n\nMamma’s special mentions: If you are needing refuelling head up to Power Plant!\n\nthe nitty gritty — BBQs - toilets - picnic - good shade - fully fenced - walking and riding trails nearby - water fountain - sand - water play\n\nDuncan Street, Templestowe Lower","urgency":"medium","formattedAddress":"Duncan Street, Templestowe Lower, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/58f703a546c3c424ad7820ab/1602462842926/Wombat+Bend++%281+of+34%29.jpg?format=1500w","_status":"ok"}
{"name":"quarries park adventure playground, clifton hill","description":"If you love a classic wooden, adventure style playground, that is EXACTLY what you will find at Quarries Park in Clifton Hill. Located just off the city end of the Eastern Freeway, this treasure is anything but little. A maze of boardwalks, plenty of swings, sand everywhere and one massive slippery dip! The park is great for a family bbq catch up, has heaps of green space to explore - although mindful of the snake warning signs - and some epic views of the city. The skate park is in walking distance too. A whole family winner of a park!\n\nMamma's special mention: Pack the hats and the sunscreen! There is very limited shady parts, unless of course if you are choosing to play in the cave like alcoves under the boardwalks!","urgency":"medium","formattedAddress":"Ramsden Street, Clifton Hill, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5c1187b121c67c7a9647769a/1602461649501/quarrie+park3.jpg?format=1500w","_status":"ok"}
{"name":"norris bank reserve, bundoora","description":"Wow, wow, wow! What an incredible spot! There is truly something here for everyone. There’s is a big, super cool scooter loop, a skate ramp, an in-ground trampoline, 4 swings plus a liberty swing AND a basket swing, 2 flying foxes (one is accessible and big enough for adults!), and a 6 metre high climbing tower which sits in the middle of the playground and is complete with 3 slides (one of them is a twin slide so really there are 4!) There is a seperate nature play/quiet play section with a sandpit and also a running water play area with numerous manual foot pumps (just try dragging the little ones away!) and wooden sculptures and a mini theatre stage area - Mamma has never seen anything like this! Lots of new plants and trees have also been planted at the reserve, making it such an attractive spot. So much to see and do! The park is perfect for picnics and gatherings too with several brand new undercover picnic and barbeque areas. There are lots of accessible toilets with changing facilities. You just must check this one out during the warm weather! Mamma spied lots of very relaxed adults supervising in the shade while the kids played happily!\n\nMamma's special mention: Swing past Bundoora All Abilities Playspace (https://www.mammaknowsnorth.com.au/parks-and-playgrounds/bundoora-all-ablities-playspace-bundoora) while you’re in the area!\n\nthe nitty gritty: good shade - accessible toilets with change facilities - barbeques - benches - street parking - open green space - nature play - water play - sandpit","urgency":"medium","formattedAddress":"135 McLeans Rd, Bundoora VIC 3083","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5db929c6ae69931bf8da0d51/1613367583663/norris+bank+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"Toms Park, Sunbury","description":"Here’s a little playground with big attitude! Check out that slide! It’s set in a tranquil spot with lush natural elements making it so pretty to look at.\n\nThere are 2 areas, one designed for younger kids and one for the older. The area for the littlies has swings, climbing towers with a slide, a little seesaw, a basket swing and is overlooked by a covered picnic table area. The older kids area has the giant slide which comes off of a lookout tower with epic views. There are also rope climbing structures and in-ground trampolines. Grassy areas suitable for running around or kicking a ball are a nice extra addition. Mamma's special mention: Sunbury has a gorgeous, new library - be sure to check it out while you’re in the area!\n\nthe nitty gritty covered park benches - nature play - seperate areas for different age groups - street parking - drinking fountain","urgency":"medium","formattedAddress":"Cnr Budhurst & Rosenthal Blvd, Sunbury","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5e4d04987b1c6c0311ab54a6/1602461045932/toms+park+sunbury+.jpg?format=1500w","_status":"ok"}
{"name":"Orchard Road Playground, Doreen","description":"Mamma and her little one can not get enough of the new playgrounds built for families out here in the north. This gorgeous little playground in the Riverstone Estate in Doreen is not only set amongst the beautiful River Red Gum trees - it looks fantastic and it was built with a sensory focus making it perfect and adaptable for all ages and abilities.\n\nThe park also includes climbing frames, a nest swing, giant slide, swings and percussion play. There is also wooden structured playground great for smaller children as-well as a flying fox. There are bbq’s and picnic tables and open grass space for a game of footy.\n\nUnfortunately there are no toilets around, so make sure the little ones do a stop before a play.\n\nMamma's special mention: Have you checked Slices in Doreen. This place ticks every box when it comes to family dining and delicious food. They even do takeaway.","urgency":"medium","formattedAddress":"Corner of Sunstone Boulevard and Orchard Road, Doreen","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5b8387f3c2241ba18121d49e/1602461740548/riverstone+front.jpg?format=1500w","_status":"ok"}
{"name":"Queens Park, Moonee Ponds","description":"This gorgeous park is seriously fit for... well, a Queen! With a cafe and two playgrounds, huge shady trees, grassed areas and of course the Queens Park Lake - this is not just a place you can just pop to for a short play. Mamma loves the island rotunda and the wooden playground was a firm fave with the kiddos so put aside a good couple of hours to explore here and guaranteed you'll want to come back to do it all over again.","urgency":"medium","formattedAddress":"Cnr The Strand and Mt Alexander Rd, Moonee Ponds","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/596d7878893fc08e6d41bc64/1683268103917/queens+park+playground%2C+ascot+vale+-+copyright+2023+mamma+knows+melbourne.jpg?format=1500w","_status":"ok"}
{"name":"Serle Wetland Park, Doreen","description":"Serle Wetland Park in Doreen is tucked just off the main streets, making it super easy to access this peaceful spot. It’s a perfect place to slow down, soak in the nature around you, and just enjoy some fresh air. This place is a paradise for birdwatchers, especially if you’ve got little ones who love spotting wildlife. The wetlands are home to many water birds, so there’s always something to see. Pack in a binocular too, you never know who you might spot amongst the reeds. You can take a stroll along the boardwalk, which makes it easy to get around while taking in the views.\n\nThe fenced-in playground is a big win for parents. It has two gates, which is quite rare in the area, so you can relax knowing the kids are safe and secure. There’s even space for a BBQ, so you can keep socialising while the little ones play. The playground has two main areas: one for younger kids with timber climbing structures to explore, and another for the bigger kids, featuring a cool climbing tower to challenge their skills.\n\nThe nitty gritty: 41W Serle St, Doreen. Fenced-in playground - pram friendly - no toilet facilities - perfect for birdwatchers - undercover picnic tables available - BBQ facilities - ample street parking.\n\nMamma’s Special Mention: After enjoying the wetlands, why not head down the boardwalk trail towards Orchard Rd and grab a bite at Magnolia on Orchard.","urgency":"medium","formattedAddress":"41W Serle St, Doreen","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/67a980f4c09cf6268d4146df/1745374541845/Serle+wetland+park+doreen%2C+copyright+mamma+knows+north+collage.jpg?format=1500w","_status":"ok"}
{"name":"Ruthven Reserve, Reservoir","description":"We love a good nature play playground over here and the lovely new play space at Ruthven Reserve is full of natural play elements like wood, rope, loose sticks and balancing stumps. As well as new paths, garden beds and plants, there’s a challenging rope climbing structure for the older kids and a junior play area with a small slide and spinner for the younger ones. Mamma’s favourite is the informal nature play area where loose natural elements like pods, plants, mounds and sticks allow for some really lovely open-ended play. Some excellent, sturdy cubbies have already been created.\n\nA proper name for this special spot is currently being decided upon - so watch this space for the name that wins the vote!\n\nEdwardes Lake Park is also in the area.","urgency":"medium","formattedAddress":"74-76 Glasgow Ave, Reservoir, 3073","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/62f9c256a2dd5520ec1df557/1663485543419/ruthven+reserve+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"eltham north adventure playground, eltham north","description":"Like so many others in the local community, Mamma was heartbroken when the well loved Eltham Adventure Playground was destroyed by fire in late 2017. However, like what will often happen in the aftermath of a tragedy, the community rallies together and gets it done. Like a phoenix rising from the ashes, the new Etham North Adventure Playground was born last year! The locals really wanted to replicate the design of the original playspace, and that request has been met. The main structure - Mamma wants to call it the shed - is fantastic. Although sightly larger than before, it continues to be an undercover, wooden gem. There are stacks of staircases, climbing challenges and walkways for the kiddos to run wild. Although it is brand spanking new, Mamma loves that it feels so familiar. It even includes the tractor! The features continue to delight beyond the shed. There is a double flying fox, sandpit, spinners, swings, dry creek bed and a water play trough. The other delightful feature is the collection of cubbies. These bright and beautiful playspaces of their own make their own little neighbourhood, with a general store post office and even an ice-cream shop. The rest is up to the kids.\n\nMamma's special mention: Did I mention that Edendale Farm is in walking distance. Definitely a back to back adventure!\n\nthe nitty gritty: bike trail - public toilets - shade - parking - bbqs - liberty swing - picnic tables - shelters - sand","urgency":"medium","formattedAddress":"Wattletree Road, Eltham North","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5c10e2b121c67cf3cf1abffa/1602461596120/Eltham+North+Adventure+Playground+2018+-+Mamma+Knows+East+%281+of+34%29.jpg?format=1500w","_status":"ok"}
{"name":"Porto Kallo Playground, Donnybrook","description":"Donnybrook has a newly built playground and it is well worth a visit. Porto Kallo Playground has so much to keep the kiddos occupied. You can find a ropes course that the big kids will love, balancing towers, musical chimes, a trampoline, butterfly rocker, giant hamster wheel and even a rolling tube slide. The spinning seesaw is always a hit with Mamma’s little one but what we love most here is the pump track! The colourful loop of mini rolling hills is just perfect for little bikes and scooters. It’s got so many ups and downs that confident riders can enjoy the ride but at a size beginners will appreciate.\n\nThe big playground structure is one for the climbers! Lots of rope ladders, webs and a bridge to climb that will get you to two different slides. The open slide is super curvy, so expect a super fun and wobbly ride down, and then you also have a big tunnel slide if you can get yourself all the way to the top of the tower! There’s bench seating scattered around the playground but if you are after a shady spot out, you can find two tables undercover with seating. Perfect spot to refuel before going back for a play, or another lap around the pump track!\n\nThe nitty gritty: 1W Creek Esplanade, Donnybrook. Features: pump track, drink tap, undercover seating. Mamma's special mention: If you’re after some waterplay fun, Cloverton Water Playground and Park is close by!","urgency":"medium","formattedAddress":"1W Creek Esplanade, Donnybrook","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/674598faf889da198211089f/1736846846123/20241126_210500.jpg?format=1500w","_status":"ok"}
{"name":"Norris Bank Playground, Bundoora","description":"Mamma thinks she might have found a playground that has it all! Norris Bank Play Space in Bundoora is what playground dreams are made of…. where to start?! The main playground is a climber's paradise! There are so many ropes, nets, foot stumps and monkey bars to get around on and 4 slides to get you back down to the ground quickly to do it all again. There are heaps of swing options, including a wheelchair-friendly liberty swing and two flying foxes, side by side, one with a belted bucket seat, making flying fox races more accessible and fun.\n\nIf you bring your scooter or bike, you can hit the pump track or pack your footy or soccer ball and have a kick on the large grass oval area. There's also a basketball court a short walk away from the main play space. You can gather your friends onto the log seats and take to the stage to put on a show, then explore the sensory wall and sandpit. Mamma loved the nature play elements here, too! Heaps of large sticks, leaves and logs to play with and even some permanent frames to place these resources on to create different things. There is a large water play set up, which unfortunately wasn't turned on when we visited.\n\nThe seating and tables here are great, and most are undercover, with some amongst the trees, meaning lots of shaded options on a sunny day. Some seated areas also have barbecues and water taps nearby. The toilet facilities here are also very impressive and include a change area! Norris Bank playspace really does have it all, a great option for a big day out with the kids!\n\nMamma's special mention: Grab a coffee on the way for a play. Check out some of Mamma’s TOP drive-through coffee stops.","urgency":"medium","formattedAddress":"135 McLeans Rd, Bundoora","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1706754237209-KC5SAJIWN9HVQT8K2QHE/norris+bank+playground%2C+bundoora+-++mamma+knows+melbourne+-+copyright-8.jpg","_status":"ok"}
{"name":"rathdowne central park, wollert","description":"Here’s another cool and unique spot to add to your playground list for the local area! The design is exciting: bright and colourful! There’s one of those very cool tumble slides, swings, including basket and baby swings, in-ground trampolines, slides, spinners, see-saw, rope climbing structures and more! Add to this the undercover picnic area and you’ve got your next play date sorted!\n\nmamma’s special mention: Keep the playground hop going! You’re 4 minutes from the incredible Lyndarum North Community Park (https://www.mammaknowsnorth.com.au/parks-and-playgrounds/lyndarum-north-community-park-wollert)\n\nthe nitty gritty\n1 broad way, wollert\ncovered picnic tables - pram accessible - active play - street parking","urgency":"medium","formattedAddress":"1 broad way, wollert","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1618819076635-H7L5E2U8UCK4P3RIZS0S/Rathdowne+Central+Park%2C+Wollert-3.jpg?format=500w","_status":"ok"}
{"name":"turner reserve, thornbury","description":"This is truly a little community playspace like no other. Turner Reserve in Thornbury is loved by its locals and has this Mamma bursting with joy. Locals have filled the park with loads of kids toys, ride ons and sports equipment for everyone to share, making this play space so loved. There is a sandpit filled with toy diggers and buckets. A wooden little cubby frame, with its own register and shopping goods. There is also a wooden framed playground which includes tunnels, a climbing wall, slide and all your favourites, not to forget the swings. There are rocks and logs to climb and balance along plus a grass space to kick a ball. Unfortunately, there are no toilets around, so you may want to remind the little ones before you leave the house. Turner Reserve is truly something special. Mamma says treat this one kind.\n\nMamma's special mention: If you are wanting to grab a bite to eat, or a coffee for the road, pop into Welcome to Thornbury. These guys are open most days of the week and have a variety of cuisines to choose from.","urgency":"medium","formattedAddress":"Smith street, Thornbury","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5b838b6f352f53cbba3d820d/1602461760585/turner+front.jpg?format=1500w","_status":"ok"}
{"name":"the boathouse playground, moonee ponds","description":"Look, we have said this many a time and we will say it again - playgrounds next to a place where you can get coffee or even sit down and have a meal are just well, Mamma heaven!\n\nTo be honest this playground is fantastic as a stand alone spot to play too - those views! Plus it is always teeming with people which is nice if you are like this Mamma and need to have a chat with other parenting folks! It is set on a hill leading down to the beautiful Maribyrnong River and has some great features. Mamma loves the special sculptures here too - they just make for an interesting story! You'll also find all the usual play equipment here including swings, a ride in boat, slides and heaps more!\n\nMamma's special mention: The Boathouse Kiosk or The Boathouse is RIGHT here and great for food and/or coffee!\n\nthe nitty gritty: toilets - parking - shade sail - near water - coffee","urgency":"medium","formattedAddress":"48 The Blvd, Moonee Ponds","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5b68d963f950b7dc20e28a18/1602461935757/Boathouse+Playground+Mamma+Knows+West+%2835+of+48%29.jpg?format=1500w","_status":"ok"}
{"name":"vr michael reserve, lalor","description":"Ahoy Captain! This lovely playground was updated this year and Mamma thinks you are going to love it! It’s a play space filled with fun, exciting equipment that every little and big person is going to love. There is a ship complete with slide, climbing ropes and sliding pole. There are swings, wobble boards, trampolines and a rock climbing wall. There are bbq’s and picnic tables, not to mention Mamma’s favourite - the rope pyramid! This play space is great for a day out, a play before hitting the Costco across the street or a pop in after school.\n\nMamma's special mention: Readings Cinema is a short drive away and have some cheap movie tickets. Check out some of their latest family flicks.\n\nThe nitty gritty: shelter - no toilets - barbeque - benches - parking","urgency":"medium","formattedAddress":"High Street, Lalor","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5c7649c8652dea58da9459fc/1602461460193/VR+FRONT.jpg?format=1500w","_status":"ok"}
{"name":"Sycamore Bicycle Track, Mill Park","description":"WOW! The brand NEW upgraded bicycle track at Sycamore Reserve is the perfect spot for anyone to test out their skills from the BMX pros to those with less experience under their belt. The upgrade has seen the demolition and replacement of the previous pavilion and resurfacing to create an all-weather track as well as the addition of a starter gate and track lighting. The track is large enough that the little ones can have a turn without disrupting the more experienced riders but of course active supervision is required at all times. This is a spot you’ll have to drag the kids away from!\n\nThe track is shared with The Northern BMX Club so they have allocated track usage times, the track is only open to the public at other listed times.\n\nMamma's special mention: Mill Park is also home to one of the best Northside Play Spaces, Mill Park All Abilities Play Space! It’s a short car trip away.\n\nthe nitty gritty: toilets (including accessibility) - carpark onsite. Public open times: Mon, Wed & Fri 7am-4pm; Tues 7am-6pm; Sat 1pm-6pm; Sun 7am-6pm.","urgency":"medium","formattedAddress":"Sycamore Recreation Reserve, Mill Park, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/6106124c3ff6c719e6812af6/1628825251091/sycamore+bicycle+track+mill+park+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"the promenade playground, south morang","description":"This new playground may be small, but it’s such a gorgeous little spot to soak up some sunshine while the kids enjoy a play! It has a tunnel slide, as well as two smaller side-by-side slides, a small rock climbing wall with a rope, and swings including our favourite nest swing. It also highlights the surrounding wildlife with a giant frog statue and pictured rocks showing the life cycle of a frog! There are balance rocks sprinkled throughout the area too.\n\nThere are a few bench seats and tables including an undercover area, but Mamma’s favourite part is the lovely lake right beside it, with a bridge and walking tracks for some more exploring. Watch the ducks swimming by, and keep an eye out for the resident swan!\n\nThe nitty gritty: The Promenade, South Morang — Undercover seating, parking spaces, drinking fountain, rubbish bin. Mamma's Special Mention: Pop in to St Ivy Cafe, right across the road for a coffee and some lunch!","urgency":"medium","formattedAddress":"The Promenade, South Morang","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/689ed58989456d29c77d2b09/1755308706054/The+Promenade+Playground%2C+South+Morang%2C+Copyright+Mamma+Knows+North-7.jpg?format=1500w","_status":"ok"}
{"name":"partington’s flat reserve playground, greensborough","description":"The new and improved Partington’s Flat Reserve Playground is located in the heart of Greensborough. This great playspace includes some old favourites like multiple swings and slides for different age groups, and equipment for the more adventurous, like a vertical rock wall and climbing net. There’s a soccer field right next to it and lots of grass space, too, so bring along your soccer ball and sports equipment for extra fun! There are a number of new picnic tables available for when you need a snack break. Partington’s Flat Reserve Playground is next to the Plenty River Trail, so bring your bikes or scooters for a ride afterwards.\n\n(Signage to get to Partington’s Flat Reserve Playground isn’t great and there is a small bit of road you have to cross that is subject to flooding in the wet months. Look out for the Diamond Valley United Soccer Club on Kalparrin Ave and you’ll find the playground directly opposite.)\n\nMamma's special mention: Partington's Flat Reserve is a 5-minute drive to the super family-friendly cafe, Mable Jones.","urgency":"medium","formattedAddress":"Kalparrin Ave, Greensborough","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/64a26b3fdf04412c40b220b1/1688427103928/Partingtons+Flat+Reserve.jpg?format=1500w","_status":"ok"}
{"name":"raeburn reserve playground, pascoe vale","description":"We were so glad to discover a freshly upgraded playground at this pretty and leafy spot! The perfect place for a picnic on a sunny day. The unique insect themed sculptures are a real hit with the toddlers and are low to the ground, perfect for little ones to explore. There’s a climbing structure with small and larger slides, a seesaw, nature play including balance logs and a sandpit further afield. The flying fox will be a hit with the older kids and there’s lots of space for ball play. Throw in some exercise equipment, toilets and lots of shady trees and you’ve got the perfect spot to spend the morning or afternoon.\n\nMamma’s special mention: Conveniently located near St. Derby! Pick up a babycino on the way and check out their spooky Halloween decorations!","urgency":"medium","formattedAddress":"8-42 Landells Road, Pascoe Vale","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1602817568477-NE7D3KO7OT9Q5OUO2LBA/Raeburn+Reserve%2C+Pascoe+Vale-11.jpg","_status":"ok"}
{"name":"Service Street Playground, Coburg","description":"A brand-new playground has arrived in Coburg, and it will surely be a new favourite!! It has some super fun and inclusive play equipment, a huge undercover seating area, lush grass with a hill perfect for rolling down, raised garden beds for community gardening, and a produce share table at the park's entry. The huge central play tower has various slides, tunnels, ropes and poles for climbing, and many interactive games, including Find the Pairs, noughts and Crosses, let’s Fly, three in a Row and Musical Bells. Underneath, you can also find a shop front and a car window with a moving steering wheel and gearbox.\n\nA range of different things to spin and talking tubes are spread across the whole playground, and you’ll also find a wooden spiral climbing frame that is visually amazing, a water pump for waterplay, a basket swing, a parent/baby swing and a spinning carousel. A toddler play area also includes some climbing and sensory fun. Make sure you also take the time to walk the path around the playground, the garden has a lovely mix of plants to view and some cool animal statues (don’t forget to look up as you search for some of them).\n\nThe nitty gritty: 41 Service St, Coburg. Facilities: tables and chairs - drink taps - mini community book library - no toilets.\n\nMamma’s Special Mention: Wanna grab a bite to eat? What about a burger at Hey’Burg in Coburg?","urgency":"medium","formattedAddress":"41 Service St, Coburg, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/655d66a30441470d75cb4f02/1730709671279/service+st+playground%2C+coburg+-+mamma+knows+melbourne+-+copyright-2.jpg?format=1500w","_status":"ok"}
{"name":"Playground Drive Playground, Bundoora Park","description":"This playground has so much fun to offer! You can park your car along Playground Drive or walk from the other playgrounds scattered around Bundoora Park to find this awesome modern playground. There are heaps of different swings available to choose from: a wobble snake for one, a wobble boat for more and a trampoline. It has a seesaw and another seesaw that not only goes up and down but spins around as well, so good luck not getting dizzy on that!\n\nThe climbing circuit here is great for older kids with balance beams, ropes, rock climbing, a wobbly ladder, a slide and a netted tunnel, but there is also a smaller climbing frame with a slide, so no one has to miss out. The playground is not under any shade, but some of the tables and chairs available here are close enough to the giant trees to provide a shaded spot to sit during the day for breaks or watch the kids.\n\nThe nitty gritty: 1069 Plenty Road, Bundoora — toilets - baby change area - table and chairs\n\nMamma's special mention: Treat the kids to a little real-life farming at Bundoora Farm. This place is interactive and you even get to feed the Guinea Pigs.","urgency":"medium","formattedAddress":"1069 Plenty Road, Bundoora","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/65d56ae884e7174daacf8b05/1708486389930/playground+drive.jpg?format=1500w","_status":"ok"}
{"name":"shore reserve, pascoe vale south","description":"There’s so much room to move at Shore Reserve! A great spot if you’re looking for a combo of space to play sports, a playground, a barbeque, toilets and off leash dog areas! Because of this, it’s a popular spot for gatherings and picnics, but the good news is there’s room for everyone! The playground (Reynard St end) is simple but has a huge sandpit with a digger. There is a slide, monkey bars, wobble bridge and a large climbing pyramid. The retro seesaw swing is a very fun addition and wooden circus figures are dotted around the place, along with some nature play elements. There’s an oval attached which is a great spot for throwing the ball to the dog when there isn’t any sport happening (there’s also a whole other playground to discover on the other side of it, Woodlands Road side). Mamma's special mention: You’re a short stroll from the always amazing Miinot Gelato!\n\nthe nitty gritty: toilets - sandpit - nature play - drinking tap - plenty of room for picnics - shade - park benches - dogs permitted - some parking on Reynard and Woodlands Streets\n\nLocation: 223 Reynard St (cnr Reynard & Melville Rds) Pascoe Vale South","urgency":"medium","formattedAddress":"223 Reynard St (cnr Reynard & Melville Rds) Pascoe Vale South","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1581227391737-PWP67KNMFE4G0WDCN25K/collage+shore+reserve+pascoe+vale.jpg","_status":"ok"}
{"name":"Penders Park, Thornbury","description":"Well just when we thought Penders Park couldn’t get any better - the upgrade we’ve been patiently awaiting is ready to go! In addition to the fully fenced toddler playground, the existing play space with native Australian themed structures and sculptures, the grassy, off leash expanses for sports and picnics and the several shaded tables and benches there’s now a BRAND NEW all abilities play space! This space has new in ground trampolines, flying foxes, wood and rope climbing structures, spinners, MORE tables and chairs and BBQs. It’s a lovely addition to the rest of the park and with even more tables and chairs it’s the perfect spot for a party of picnic.\n\nMamma's special mention: Stop by Preston Market for some groceries on your way home!\n\nThe nitty gritty: Pender St, St David St, Thornbury, 3071 — street parking - nature play - sheltered picnic tables - toilets - off leash area - fully fenced toddler playground","urgency":"medium","formattedAddress":"Pender St, St David St, Thornbury, 3071","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/61dfce1122e72d4589f8127a/1644028478357/penders+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"Mt Aitken Reserve & Playground, Greenvale","description":"Mt Aitken Reserve is a great place to take the kids for a mini hike and play. Take the walking loop through the reserve and look out for some lovely native wildlife along the way. Mamma and her little ones were lucky enough to see a mob of kangaroos enjoying a feed on the grass! Continue up the slight incline, and you’ll arrive at the lookout point, where you'll find 360-degree views across Melbourne's North and the city skyline on show. The lookout is undercover and has seating, so you can sit back, rest your legs, and take in the views before trekking back down towards the reserve’s playground.\n\nHere, you’ll find an awesome play space with slides scattered everywhere, 4 swings to choose from, and musical instruments like drums and a xylophone. Mamma can relax and organise the snacks in the undercover area with multiple picnic tables while the kiddos play a game of naughts and crosses or jump their way through the hopscotch. There’s also a climbing frame with multiple entry points leading to a super long tube slide and listening tubes. So much fun to have here! You can also access Mt Aitken Reserve via Fairways Boulevard, Craigieburn for a longer scenic hike. For the quickest access to the playground, enter via Topographical Crescent, Greenvale.","urgency":"medium","formattedAddress":"22 A Topographical Cres, Greenvale","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/66a75ce5642ee50bcf13cc9b/1722910717855/mt+aitken+reserve+%26+playground%2C+greenvale+-+mamma+knows+melbourne+-+copyright-9.jpg?format=1500w","_status":"ok"}
{"name":"Traffic Park at Aston, Craigieburn","description":"Beep beep, look out! Mamma comin’ through!\n\nAston Traffic Park is a ‘Mamma Approved’ Playground at Aston in Craigieburn! The Mamma’s helped design this fantastic space with Peet Limited for the community to enjoy for years to come.\n\nNot only does it have great play equipment like a tower, slides, rope bridge, mini trampolines, swings and more…but it has its very own TRAFFIC PARK! Yes, the little kids can zoom, ride, skate or scoot around the track and roundabouts, over the speed humps and moguls and even across the train tracks! This gorgeous park is a hit with Mamma’s clan and will be for yours, too! Mamma says this park has OUR stamp of approval!\n\nBoth Peet and Mamma Knows North believe that one of the most important elements of a strong community is high quality parks and playgrounds and we are committed to bringing a whole new level of fun to Aston.\n\nthe nitty gritty: 69 Elevation Boulevard Craigieburn\nshelter - no toilets - traffic park - benches - street parking","urgency":"medium","formattedAddress":"69 Elevation Boulevard Craigieburn","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1692587432201-XAFZB4IWYCMITOMR0TSH/Traffic+Park+Craigieburn+Aston+2023+UWM-81.jpg","_status":"ok"}
{"name":"Pentridge playground and waterplay, Coburg","description":"Mamma loves a family-friendly play space that boasts curiosity and fun and Pentridge playground and water play is no exception. This simple wooden playground gives little ones the confidence to challenge themselves. There are ropes courses, bridges and climbing ropes surrounded by grassy spots for the folks to set up a rug and relax. The play space also includes a water play area. Push the giant button and dodge your way through the water spurts. The playground is surrounded by the bluestone brick buildings of the old Pentridge prison and although sounds eeiry there is something really lovely about it.\n\nThere is so much about Pentridge, making it a great outing for the family. Head over to the independent cinema, Palace, or grab a bite to eat at some delicious restaurants or cafes close by.\n\nDid you know at Pentridge, they do Family Fridays? There is face, painting, giant bubbles, games and live music. Plus loads of cool restaurants to enjoy an end of week dinner.\n\nMamma special mention: Pair this great park with a classic pub meal at the newest brewery in the north, Brewdog!","urgency":"medium","formattedAddress":"1 Champ St, Coburg","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/63afc3035871774403597f3f/1708910339604/pentridge.jpg?format=1500w","_status":"ok"}
{"name":"Preston to Bell Playground & Public Spaces, Preston","description":"Mamma is excited to share about the newly renovated Darebin bike path beside the train tracks and the incredible green spaces developed along the way. The latest addition near the Preston Oval is a huge playground, perfect for kids and adults to enjoy. The playground features a giant three-level climbing structure that towers high above the ground, with a giant green slide and two smaller slides for little kids. There is also a flying fox, swings, bridges, and rock climbing - all designed to keep kids entertained for hours. The playground also has a xylophone and one Mamma enjoyed was the steel tap drum for kids to play some music and make some noise. Not to mention the basketball half court.\n\nThe area has ample space for families and friends to relax, have a picnic, and enjoy a BBQ together. The playground is particularly exciting because you can see and hear the trains passing overhead, which adds to the experience.\n\nThe playground is not the only main attraction in the area. There's also a public exercise space with equipment, running tracks, and a long jump area. The equipment is well-maintained and suitable for people of all fitness levels. If you're looking for a fun and exciting place to spend time with family and friends, the Preston and Bell train station playground is definitely worth a visit.\n\nThe nitty gritty: Preston Train Station, Bell Station — tables and chairs - drink taps - BBQ - exercise equipment - bike track - no toilets.\n\nMamma’s Special Mention: Feeling hungry? Grab something fresh to eat at Arepa Days. Only a short walk away and they make a good coffee.","urgency":"medium","formattedAddress":null,"isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/65937913eadb821bf5e33f84/1704172793369/preston+to+bell+.jpg?format=1500w","_status":"ok"}
{"name":"Princes Park Playground, Carlton North","description":"Mamma LOVES this great little playground. It has something for everyone and continues to challenge our 5 year old. The main play structure is a climbing frame, cubby house and ladder in one. Your confident kiddos will be up in a flash, just keep an eye on them as they skip over the gap to the slide. Beyond this popular hub, is your classic sandpit play, with added tools to scoop, sift and build with. There are a bunch of little huts, some with tunnels, others with slides and all with plenty of space for Mamma to grab a seat and supervise the fun in this little village. The entire area at Princes Park is beautiful and a hive of activity with the ovals hosting soccer matches and the running track constantly flowing.\n\nMamma's special mention: Looking for a treat or a coffee before heading home? Brunetti’s is always a nice stop off for the whole family. Or check out the Carlton Farmers Market on the 1st & 3rd Saturday of the month.\n\nthe nitty gritty  sandpit - nature play - drinking taps - walking trails nearby - ovals nearby - public toilets - bbq - street parking","urgency":"medium","formattedAddress":"Princes Park Drive, Carlton North","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5d1c17df429273000149d7f3/1602461310701/Princes%2BPark%2BPlayground%2BCarlton%2B-%2BMamma%2BKnows%2BNorth%2B%252810%2Bof%2B14%2529.jpg?format=1500w","_status":"ok"}
{"name":"symon crescent playground, thomastown","description":"Well isn’t this just a gorgeous little place to play! Symon Crescent playground in Thomastown is tucked away behind some houses and the M80, but you wouldn't even know you were near the freeway, with all the greenery around and trickling water from Edgar’s Creek nearby. There’s a flying fox and climbing frame attached to a fort that includes a slide, fireman's pole and a shop front underneath. There’s also a double slide, octopus rocker, a swing set and a merry go round. The rock steps and balancing logs are fun to climb as well. Take a rest on a bench, or there’s a table and chairs available if you pack some snacks with you.\n\nThe playground is accessible from Symon Crescent but also from the Edgar’s Creek trail and M80 trail. Mamma recommends hopping on the bikes and riding along the Edgar’s Creek trail. It's a pleasant bike ride along mostly flat ground, with minimal turns meaning it's easy to keep an eye on the kids if they go ahead or to see if other riders are coming towards you. You will find a council bike repair station at the playground! These are such helpful tools for bike riders, tighten up any loose fittings or pump up your tires. Mamma’s little ones love (pretend) working on their bikes, according to them they are making their bikes go faster.\n\nThe nitty gritty: 27W Symon Cres, Thomastown. Bike or walking access available along Edgar Creek Trail and M80 Trail. Bike repair station.\n\nMamma's special mention: If riding along Edgar’s Creek, you can visit another great playground at Main Street Recreation Reserve.","urgency":"medium","formattedAddress":"27W Symon Cres, Thomastown","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/678b43481880ab257ce3844f/1737335197692/20250118_213145.jpg?format=1500w","_status":"ok"}
{"name":"Shore Reserve Playground (south-side playground), Pascoe Vale South","description":"If you’re looking for a park that allows Mamma to sit back and watch the kids play, then Shore Reserve Playground (South) is a great choice! A small and secluded park at the end of the West Coburg football oval, there’s plenty of seating, heaps to keep the kids busy, and it is semi-fenced. The playground offers various climbing frame challenges to access the slide, curvy bridge, binoculars, steering wheel and monkey bars. You’ll find a wobble bike to ride, a four-seater cross seesaw, noughts and crosses and even a find-the-word game. A basketball court and an undercover BBQ with a table and chairs also exist.\n\nIts best access is via Woodlands Ave, with a car park to use. Remember that this car park may get busy on local footy game days. If you’re up for a stroll after watching the kids play, you can follow the path along the oval to the North side of the reserve, where there’s a whole other playground to explore or save the visit for your next outing!\n\nMamma’s Special Mention: Feeling hungry? Pop over to Poppy Cafe and Pantry for some delicious treats.","urgency":"medium","formattedAddress":"12 Woodlands Ave, Pascoe Vale South","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/64e28612398b362f228ef5f2/1730710250001/shore+reserve+south.jpg?format=1500w","_status":"ok"}
{"name":"Pinnacle Park, Mickleham","description":"Here’s a super cool spot with a toddler area as well as adventure play for the older kids! The larger area has big, clear climbing towers with mega slides, long, elevated mesh tunnels (so fun!), an extensive, double flying fox, monkey bars, mini rock climbing wall, musical pipe station and green area for picnics. The lower section for little kids has a 4 person see-saw, swings, small climbing frame with slide and is overlooked by shaded picnic tables. An exciting playground with nice views of local surrounds.\n\nmamma’s special mention: Hop on over to Foundation Park while you’re in the area, it’s just down the road and has toilets!\n\nthe nitty gritty: covered picnic tables - pram accessible - flying fox - adventure play - nature play - toddler area. Faraday St, Mickleham","urgency":"medium","formattedAddress":"Faraday St, Mickleham","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/6046dd80d1af077bab59e484/1622280551732/pinnacle+park+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"Redleap Reserve, Mill Park","description":"Redleap Reserve in Mill Park has got you covered when it comes to adventure, new experiences and fun. There are two playspaces to choose from and both including your park favourites - swing, slides, climbing frames, net swing and monkey bars. The reserve is filled with huge trees, perfect for shade and shelter. Plus the perfect picnic! There are BBQ's, seats and toilets. The lake usually takes around 10 - 15 minutes to walk around. There are feeding platforms for the little ones to feed the ducks. Check out the wooden sculptures of birds, climb the trees and don't forget to bring the footy to play a game on the oval. We loved the bushy area, because it gave the kids a good chance to explore and climb.\n\nMamma's special mention: There is lots to keep you busy in Mill Park with the NEW entertainment precinct at Westfield Plenty Valley which includes a great range of cafes and shops. Maybe you little one needs a little more care when the cooler months are around. Check out Salts of the Earth.\n\nThe nitty gritty: park benches · shelter · picnic tables · pram access · public toilets nearby · lots of shade · walking/bike tracks. Want to know more? click here (page links to Whittlesea directory).","urgency":"medium","formattedAddress":"Redleap Ave, Mill Park","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5977e817f14aa1ed17679cbd/1602462168581/redleapfront.jpg?format=1500w","_status":"ok"}
{"name":"rubie thomson reserve, northcote","description":"What a gorgeous little spot for a picnic and a play! There’s heaps of room to kick the footy or explore the nature play areas and dry creek bed and there are shady trees to sit under. The playground has everything - a large sandpit with a metal scooper, 2 wooden climbing structures, 2 slides, a swing set, a climbing wall and rope climbing frame, bridge, tunnel and noughts and crosses! There’s a see-saw, stand-on spinner, monkey bars, a fireman pole - and more! There are elements to keep toddlers and older kiddos (up to about 10 Mamma thinks) entertained.\n\nMamma's special mention: You are right down the road from Fairfield Library! Time your trip after a free Story or Rhyme Time (Mondays (during school terms)) and make a morning of it!\n\nthe nitty gritty sandpit - nature play - drinking tap - plenty of room for picnics - shade - park benches - dogs on lead\n(parking on hillside ave & main street, limited spots on separation street)","urgency":"medium","formattedAddress":"356 Separation St, Northcote","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1568092499514-09HSFPOSQA2RCAPS5GVO/rubie+thomson+reserve+mknfield+black+cafe+mamma+knows+north-14.jpg?format=500w","_status":"ok"}
{"name":"Petrie Park, Montmorency","description":"When the sun comes out in winter, Mamma loves getting outside! Petrie Park in Montmorency is a cute local play space for kids who love trains! Located right next to the Hurstbridge railway line, little train lovers will love watching the trains pass by and waving to passengers! Meanwhile, they can pretend to sell and collect tickets on their miniature play train. The playground also has multiple swings and slides, a sliding pole, a climbing net, and a wall.\n\nMamma loves the undercover picnic and BBQ area - perfect for long mother group catch-ups or a summer playground birthday party! Mamma's special mention: Head around the corner to A Stones Throw cafe in Were Street for a hot cuppa or burn off some more energy on the oval directly next to the playground.\n\nFacilities: parking onsite - toilets - water tap - undercover BBQ area - bowls - cricket pitch - tennis court - oval","urgency":"medium","formattedAddress":"12-28 Mountain View Road, Montmorency, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/64a25d14df04412c40b0fd93/1688379814517/petrie.jpg?format=1500w","_status":"ok"}
{"name":"Riverside - Pirate Ship - Park, Aberfeldie","description":"Both little ones and bigger kiddos will love exploring the 'life sized' pirate ship at Riverside Park. Mamma says the attention to detail is very cool - check out the crows nest, treasure map, captains quarters, bells, telescopes, sunken treasure and even a wooden ships wheel. In fact, the 'Black Sapphire' is so well built it seriously looks like it could float down the river all the way into our bay! The playground extras on the ship are fab too with slides, climbing ropes, tunnels and of course no buccaneers boat would be complete without a 'plank' to walk (or jump). The park itself is right on the banks of the Maribyrnong River and somewhere you will want to spend extra time, its always busy with families picnicking and enjoying this very special place. Get on board me hearties. The black sapphire ship is sitting in a huge sandpit - buckets and spades are a must for treasure huntin' me hearties!\n\nMamma's special mention: Ascot Food Store is only an 8 minute drive and worth every coffee sip.\n\nthe nitty grittybbq's - park benches - lots of free parking - picnic tables - pram access - public toilets - lots of shade - shelters.","urgency":"medium","formattedAddress":"118 The Boulevard, Aberfeldie VIC 3040, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5a24d3be71c10b3508f1a1d5/1602462401688/riverside+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"Splendour Circuit Playground, Diggers Rest","description":"This fresh new playground is half play, half WORK OUT! There is a fun area for the kids to hang and climb, plus a great little track around the outside of the park and grassy areas, which is perfect for scooters and bikes. So while the kiddies are off doing that, YOU can have a play on all the workout equipment - and there are heaps of options - that Mamma hasn’t seen before at a playground: kettlebells, exercise bike, rings and more.\n\nMamma’s special mentions: Grab a bite at Fifteen Bar and Cafe up the road!\n\nThe nitty gritty: off street parking - bbq - shelter - no toilets (go to Fifteen Bar Cafe).","urgency":"medium","formattedAddress":"Splendour Circuit, Diggers Rest","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5d10774c7aee47000179562c/1602461350582/splendour+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"timbertop park playground, doreen","description":"Discover the new and improved playground at Timbertop Park in Doreen. The kids are going to love it, and so will you!\n\nThe playground has climbing and balancing fun for young kids, with a rock climbing wall, rope bridge, and stepping poles. You can swing across the monkey bars, play tic tac toe, or make your way to the top of the tower and race down the super-fast tunnel slide. There’s also a koala rocker, stand-up spinner and swings.\n\nThe park includes a half basketball court and plenty of grassy areas. BBQs and picnic tables are available with some shading. Mamma's special mention: Hungry after your play? Head to Slices, Doreen for a yummy feed!\n\nFacilities: Drink taps, BBQs, Picnic Tables, No Toilets.","urgency":"medium","formattedAddress":"47 Timbertop Dr, Doreen","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/66d18d05d837336daa950213/1727233430635/timbertop%2Bplayground%2Bdoreen-07.jpg?format=1500w","_status":"ok"}
{"name":"Shore Reserve Playground (north-side playground), Pascoe Vale South","description":"Shore Reserve Playground (North) is home to a well-known icon in the local area, a clown swing that spins. He is definitely worth saying hi to. Jump onto one of his swings and ride around and around for heaps of fun! A ringmaster and an acrobat sculpture join the clown, and you can even be a circus performer on the coloured steps around the park! Next, you can head to the climbing pyramid, mini parkour obstacle course, merry-go-rounds, ride on wobble dinosaur and giraffe or climb up to try walking across the wobble bridge to a slide. The sandpit here is excellent, too. It’s massive and has a ride-on digger!\n\nTable and chairs, toilets, BBQ and water fountain are found near the playground, making it an excellent place for a picnic. There’s plenty of space here to run around in between all the play equipment and an oval for those wanting to kick a ball or bring the dog. This park has multiple entry points, with many local streets accessing the paths around the reserve. For the most direct access to the North Playground, parking is best done along Reynard St. Make your way around the path and check out the Shore Reserve north-side playground too!\n\nAddress: 326 Reynard St, Pascoe Vale South. Facilities: BBQ; toilets; tables and chairs; water fountain; walking track.","urgency":"medium","formattedAddress":"326 Reynard St, Pascoe Vale South, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/64e2ab2bddb7932eb7025238/1730710268946/shore+reserve+north.jpg?format=1500w","_status":"ok"}
{"name":"Rosanna Parklands and Playground, Rosanna","description":"Looking for a fun family adventure that won't break the bank? Check out Rosanna Parklands and Playground - it's totally FREE and FUN! If you're looking for a fun place to take the kids, you should definitely check out the Rosanna Parklands. They've got an awesome playground with a big slide, a flying fox, and climbing bars and webs. There's lots of space for picnics and kicking a ball around.\n\nWhy not take a leisurely stroll and observe the local wildlife? Children will enjoy spotting lizards, kookaburras, possums, and lorikeets. You might even see the yellow-tailed black cockatoo.\n\nThe nitty gritty:\nRuthven Street & Lower Plenty Road, 10 Ferrier Ct, Rosanna\npark benches, walking and bike tracks - off the lead dog walking - wildlife observation\nMamma's special mention: Baketico by Wonder Pies (nearby for coffee/pastry).","urgency":"medium","formattedAddress":"Ruthven Street & Lower Plenty Road, 10 Ferrier Ct, Rosanna","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/64579b3a03f76e680035f6c8/1687336989426/rosanna+parklands.jpg?format=1500w","_status":"ok"}
{"name":"Royal Park Natureplay Playground, Parkville","description":"This park is nature play at its best! You'll find timber climbing structures, slides of all sizes, and two water play areas, one even connects to a sandpit. There are also hills to climb and spots to take in the city views. With plenty of trees around, it’s a great spot for keeping an eye on the kids, even on a hot summer day, while parents and carers can relax under the shade. Mamma and her family especially love the large water play area at the top of the playground. It’s so spacious, making it perfect for the kids to run through the water jets and cool off, so be sure to pack towels and bathers for a refreshing water play experience to cool off during your summer visit. Mamma’s kids also love to pretend they’re adventurers, zig-zagging between all the trees and bushes. Sometimes they’ll hide behind one of the sculptures, each following a different trail path, only to find each other at the end of the trail. It’s always an exciting adventure! Whether you’re coming with a baby, toddler, or bigger kids, there’s something for everyone here. It’s also a peaceful spot for a solo visit if you want to just enjoy the views and relax.\n\nNature Play at Parkville: Located at the corner of Flemington Road and Gatehouse Street, Parkville, this adventure area features a climbing forest, water play zones, and rocky structures with slides. Perfect for active play and exploration.\n\nManningham Street Reserve Playground: Found at the northwest corner of the park, this playground offers swings, slides, and timber play equipment, making it a great spot for children to enjoy.\n\nThis park is conveniently located next to the Royal Children’s Hospital, so it's an ideal place to take a break and get some fresh air while visiting the hospital.\n\nIf you're looking for a peaceful end to your day, take a stroll around the tranquil wetland at Trin Warren Tam-boore (Bellbird Waterhole), where you can enjoy the calming surroundings.","urgency":"medium","formattedAddress":"28 Gatehouse St, Parkville","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/6789a5bbf620a70538429efa/1738901795751/Royal+Park+Parkville+Mamma+Knows+North+Copyright-10.jpg?format=1500w","_status":"ok"}
{"name":"Seabrook Reserve Playground, Broadmeadows","description":"✨ NEW PLAYGROUND ✨ Described in three words?… spacious, interactive and YELLOW! We love this brand new playground in Broady, it’s very well thought out and we had so much fun here! The play spaces are separated nicely over different levels, between paths, across rocky embankments and among newly planted gums and other native flora. Mamma is excited to see this playground evolve into the future when the vegetation forms its own natural play element.\n\nRight now, you can enjoy some serious slide action, the highest-flying nest swing you’ve ever seen, and time and energy consuming obstacle courses - one space has a series of rope and net structures to climb and navigate through, another with balance beams and poles with stilts to scramble across! A sizeable sand and water play straddles between flying foxes and a picnic area with tables and 4 electric BBQs. In-ground trampolines, swings and a spinning carousel are here and a basketball ring and adult exercise stations are just beyond the playground down paths perfect for scooters and bikes.\n\nAND - toilets, taps and soap, water fountain and baby change table are here so you know what that means - the perfect place for a party (for party suppliers in the North hit up Mamma Knows Parties).\n\nthe nitty gritty: Goulburn St, Broadmeadows\nfeatures: park benches - big carpark - picnic tables - pram access - public toilets - baby change - shelter - water fountain\n\nMamma's special mention: Siconi Gelato for a special treat.","urgency":"medium","formattedAddress":"Goulburn St, Broadmeadows","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/6454a207d83cfa67505dbbb5/1683503592401/seabrook+reserve+playground%2C+broadmeadows+-+cover%2C+copyright+2023+mamma+knows+melbourne-2.jpg?format=1500w","_status":"ok"}
{"name":"Sanger Reserve Nature Playspace, Coburg North","description":"Here’s a cute little spot to stop by on a nice day. It’s clearly a well loved and well kept park where locals have lined up their diggers for the sandpit and scooters and ride-on cars for the path - how sweet! As well as the sandpit, there’s an undercover picnic and barbeque area, a low, accessible slide, swings - including a basket swing - and a cool parkour obstacle course! It’s set in a shady, leafy park with room for picnics or ball play. A great spot for toddlers - older kids will enjoy the obstacle course and basketball hoop! Mamma's special mention: Want to pick up some coffee beans or indoor plants on your way home? Head to Selvatica! Or grab some takeaway from the always awesome Forty Flips!\n\nthe nitty gritty  undercover picnic tables - barbecues - drinking fountain - basketball hoop - sandpit -obstacle course - street parking - dogs on leash -","urgency":"medium","formattedAddress":"14 Warner St, Coburg North","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5e64a596190266288c4b69da/1622280155620/excerpt+sanger+reserve+mkn.jpg?format=1500w","_status":"ok"}
{"name":"Rosehill Park Playground, Keilor East","description":"Rosehill Park Playground in Keilor East has all the little details covered for the perfect play day for you and your kids! Mamma really appreciates when a park has been thoughtfully designed - we think that Rosehill Park Playground has nailed it. Play equipment for all the ages, amenities galore and lots of space for family sports, Mamma loves to spend hours at this park on a weekend with the kids.\n\nWhen you first walk in you’ll notice the nature logs and the water play space to your left - pumps, water tracks and a frog sculpture with a pond. There’s a kids play area for the younger kids with a smaller slide, a little trampoline and a huge sand pit. The main attraction is a huge climbing structure with a fast slide, plus ladders, ropes, a flying fox, heaps of swings and more.\n\nMamma loves the shaded seating area, the bbq facilities, the fact that there are water fountains and toilets on site, and the fantastic spaces for kids sport - multiple basketball courts, a skate park area and a huge grass area.","urgency":"medium","formattedAddress":"35 Rachelle Road, Keilor East","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1754440946968-DRLJRR2T5P64VK8XOTJW/Rosehill+Park+Playground+Keilor+East+Mamma+Knows+Melbourne-5.jpg","_status":"ok"}
{"name":"Rodger Court Playground, Bundoora","description":"Mamma loves a visit to this beautiful spot for a play. Tucked away within the streets of Bundoora you will find a little playground gem. Rodger that! There are swings, a rocking frog, a long twirly tunnel slide, a fireman's pole and an F1 racing game. A double slide on a hill with climbing footholds and a rope to help get you to the top and an awesome multi-level climbing set-up with ropes, ladders, nets and a rock wall. Tired yet?\n\nNeed more? Well, there are also lots of great natural elements, including balancing logs and even a dry creek bed to explore. Rodger Court park is accessible from a few streets (not just Rodger Court) with walking paths down to the playground. There is also a table and seats available, so Mamma can relax and enjoy the view while the kids play! Rodger over and out!\n\nThe nitty gritty: 9W Rodger Ct, Bundoora table and chairs - no toilets - walking paths\n\nMamma's special mention: Feeling peck-ish? What about an epic toastie from the guys at Sammich? Only a short drive away, this place is worth a try.","urgency":"medium","formattedAddress":"9W Rodger Ct, Bundoora","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1707190382453-B6ZM7NZOKJ84NWM5FT6B/rodger+court+playground%2C+bundoora+-++mamma+knows+melbourne+-+copyright-10.jpg","_status":"ok"}
{"name":"Thomas Street Recreation Reserve, Thomastown","description":"Don’t let this playground fool you, walking past you may think the kids will only have a quick play here but trust Mamma, they will want to stay a while!  There’s a two tower structure that is connected by a large rope climbing frame and is full of fun additions, such as fire poles on each end, noughts and crosses, steering wheel, binoculars, a shop front, tunnel and an open twisty slide. Then there’s the ninja course that even the big kids will love. Start by crossing the wobbly bridge and then swinging your way across the rope handles. Next climb up the robe ladder, but watch out, it can swing and you’ll need to climb back down the other side as well. Cross the floating foot steps and carefully side step along the balancing rope. Mamma and her crew love seeing who can finish the course the fastest!\n\nYou can also test your balancing skills on a wobbly surfboard, sit in a wobble police car or enjoy the set of swings. If you have a ball with you, head across to the large grassed area next to the playground where there’s a soccer goal to use!There’s tables and chairs here for Mamma to rest, and it's a great spot to enjoy the view of the beautiful tall trees lining Edgar’s creek trail. The path along Edgar’s Creek is a great way to get here by foot, bike or scooter, otherwise you can drive and access the park where Thomas Street meets Travers street.\n\nMamma's special mention: If you’re looking for a fun family adventure, grab your kids bikes or scooters and head out for a ride along Edgar’s Creek, there’s more playgrounds to stop at for a play including Main Street Reserve and Symon Crescent Playground.","urgency":"medium","formattedAddress":"47 Thomas St, Thomastown","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/67de78ae7e41ff7348f1ed70/1749091141165/thomas+st+recreation+reserve+thomastown-1.jpg?format=1500w","_status":"ok"}
{"name":"Overland Park, Doreen","description":"There is a little adventure in every corner of Doreen, and Overland Park is a great example. With walking, bikes tracks, bbq’s and shelter, this park is perfect for your next family fun day, mid afternoon stroll and a quick energy burner for the little ones. The playground includes all the favourites; slides, climbing wall, bridge and number game. The playground is perfect for younger kids and for the older ones - bring a footy, your cricket set or a ball to kick and enjoy the open space.\n\nMamma's special mention: Have you checked out Slices in Doreen? This place ticks every box when it comes to family dining and delicious food. They even do takeaway.","urgency":"medium","formattedAddress":"9W Mondadale Drive Doreen","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1534416383274-83ZIYPPUKAXRC2GU281I/overland+park%2C+doreen-16.jpg","_status":"ok"}
{"name":"Ninja Training Playground, Albion","description":"Attention Ninja Warriors! This training ground has all the obstacles needed to train up the little and not-so-little ninja superstars! The kiddos can balance across the rope, wire and ladder tightropes, swing their way through the spinny, circle monkey bars and take a run and jump up the incredible wall! There’s loads of courses to run through here in this brand spanking new playground, that even the adults will be hard pressed to avoid testing their own skills as well!\n\nMamma's special mention: Keep adventuring at Brimbank Park!","urgency":"medium","formattedAddress":"Selwyn Street, Albion, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1627285855366-2A4JZEI6HD9T3J7DJYEZ/ninja+training+playground%2C+albion+-+copyright+mamma+knows+melbourne.jpg","_status":"ok"}
{"name":"Richards Reserve Pump Track, Coburg","description":"Pump tracks are great for when the kids want to go for a bike ride but Mamma does not! The pump track here at Richards Reserve in Coburg is made up of 2 connected loops, like the number 8, meaning the kids can change up their route and makes for easy overtaking. There’s some benches and seats around the track to get comfortable on while supervising, and tables and BBQs if the kids work up a real hunger after their ride or you want to make a day of it!\n\nCheck out the sign for the rules and expectations and you can also find some tips for those on proper BMX or dirt jump push bikes.\n\nYou’ll know your kid’s riding level best, Mamma likes to bring her little ones down here for a ride during school hours, as it’s more likely to not being used by older riders. Mamma’s 2 and 3 year old have loved coming here ever since they were tall enough for balance bikes. Naturally, both kids have had a few falls here over the years, but we’ve always got our helmets on and it’s never anything a quick hug or pat on the back can’t fix. Richards Reserve is also home to the Coburg velodrome and cycling club, which is where you’ll find toilets open during the day to use. Always handy!\n\nThe nitty gritty: 30-34 Charles St, Coburg.\nAmenities: Drink taps, BBQs, Tables & Seats, Toilets (short walk).\n\nMamma's special mention: Back Alley Bakes is just a short walk away and serving up delicious baked goods and epic sandwiches.","urgency":"medium","formattedAddress":"30-34 Charles St, Coburg","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/66f217f5e2ea465a37d2d432/1727233453248/Richards%2Breserve%2Bpump%2Btrack%2Bcoburg-8.jpg?format=1500w","_status":"ok"}
{"name":"River Red Gum Avenue Playground, Bundoora","description":"Just off Plenty Road, this playground in Bundoora Park is surrounded by lush trees, picnic shelters, BBQs, tables and chairs, and four other playgrounds within walking distance.\n\nThe playground boasts a double seesaw, flying fox and merry-go-round. You can take the steps up to a smaller slide or try the harder climbing frames to ride the longer slide. There’s also a curvy bridge to cross, a pole to slide down, monkey bars and a shop front for pretend play underneath. A highlight here is always the super fun spinning swing! You can also find some cool wooden poles here with interesting cravings to check out.\n\nMamma suggests taking a short walk across the field and visiting Aia’s Meadow, an elevated daisy chain art installation. It’s a lovely spot to take a moment to sit, reflect or just admire the beauty of the space with the kids.\n\nMamma's special mention: Feeling hungry? What about a toastie from Sammich? They are delicious!","urgency":"medium","formattedAddress":"River Red Gum Av and Playground Drive, Bundoora","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/65d66d950923a1682c051fed/1709084298394/rivergum+drive.jpg?format=1500w","_status":"ok"}
{"name":"Victory Park, Ascot Vale","description":"There is something about this adventure style park and playground, we ALWAYS stay longer than intended as it is just so intricate and unique! The kids can be the 'kings and queens of the castle' here as it is literally a big wooden castle complete with turrets, slides, ramps, stairs, hidey holes, sandpit, swings and much more. There is a good toddler section with a smaller slide and sandpit plus the bigger kids will love discovering the five other slides around their fortress.\n\nMamma's lil' tip: The majority of this playground is fenced in making it easier to keep track of the crew and Mamma says bright clothing is a good idea so you can see the little ones inside all the nooks and crannies of this structure.\n\nThe nitty gritty: BBQ - lots of free parking - lots of shade - public toilets and kiosk at nearby swim centre.","urgency":"medium","formattedAddress":"Cnr Langs and Epsom Road, Ascot Vale","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/58f706858419c29107135d07/1602462926949/victory+park+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"Romsey Ecotherapy Park","description":"Mamma loves a community park like this one! You can almost feel the energy and commitment that has gone into creating a space dedicated to nature, play, wellbeing and relaxation! And it is still a work in progress, meaning more exciting additions are still to come! The inspiration for the park came from a committee of dedicated locals who saw how much Romsey would benefit from a place like this. Located in the outdoor area of an old primary school, the park already has a flying fox, a basket swing, a hammock, a wooden forte with a wide slide (the latter is built in and around an incredible, cavernous old oak tree!) and 2 epically tall rope & wood climbing structures. The play area is surrounded by tree shade, rocks, wooden planks and stumps and there’s lots of space for ball-play and picnics. There’s a really lovely vibe here with friendly locals chatting to one another as the kids play. Being surrounded by nature like this really inspires imaginative play - the little ones found feathers, pointed at bugs, collected fallen acorns and balanced on the rocks and wooden beams.\n\nMamma can’t wait to see the possible future additions of an arts/culture space, a woodland ramble, a sensory therapeutic space and a billabong! Wow. Mamma's special mention: Check out the new Sunbury Library on your way home! If you’re heading further North - make SURE you check out the incredible Cleveland Winery. Or, if you’re staying put, Mamma noticed a really lovely wine & cheese bar across the road with a pretty & spacious garden!\n\nthe nitty gritty \nnature play - playground - small carpark - toilets across the road at Lions Park (there is also a very small playground here) and another bigger one further down Main St","urgency":"medium","formattedAddress":"140 Main St, Romsey, 3434","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5e4d0f637b1c6c0311ac5fad/1621751313162/romsey+ecotherapy+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"h swain reserve, preston","description":"This play space is was surprise for Mamma and her little one. It’s quiet, big and away from all the hustle. H Swain Reserve in Preston is a delight for any sort of play.\n\nThe wooden structured playground is built with all of Mamma’s favourites - wave slide, tunnels, rock climbing wall, monkey bars and blackboard. There is a little shop front perfect for role playing and train structure perfect for any little train obsessed kiddo. There is a half court for a game of basketball and sandpit. Not to mention the sit on spinning carousel, big pyramid rope climbing frame, nest swing and upside down u shaped see-saw. There are two unshaded tables and seats plus good sized grassy area.\n\nMamma's special mention: Merri Clan (https://www.mammaknowsnorth.com.au/eats/the-merri-clan-thornbury?rq=merri%20clan) is a short walk around the corner and makes some of Mamma’s most favourite Nachos. It’s also all vegan but lets just say you may not pick it.\n\nthe nitty gritty: street parking - shade - BBQ's - dog park - no toilets","urgency":"medium","formattedAddress":"Oakover Road, Preston","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5bbee9cdeef1a1350e60b0fc/1602461610765/h+swain+reserve+front.jpg?format=1500w","_status":"ok"}
{"name":"golden sun moth park, craigieburn","description":"Wow! Wow! Mamma and Little Miss 4 love a new adventure park but Golden Sun Moth Park made our morning that little more fun. With something to learn in every play space, this park not only burns that energy, you walk away learning something new about the Golden Sun Moth. There are the two play spaces. Play space one is structurally designed to look like the the Golden Sun Moth, packed with loads of interesting facts about the moth. There are rope climbing frames and tunnel slide. Play space two includes a wooden frame climbing wall, ladders and slides. There are spinning disks, speak and listen system and swings. There are bugs sculptures scattered around and perfect for climbing. The play space is made for smaller kids and is surround by seating, so the folks or guardians are not too far away. There are also pyramid climbing structures, disk spinners and swings scattered around the park for that little extra fun.\n\nGolden Sun Moth Park is perfect for a quick play or the whole day out.\n\nMamma's special mention: Craigieburn is filled with lots of great play spaces for kids. This up and coming area is perfect for new families. Check out some other parks and playgrounds in Craigieburn - Aston Fields Playground, Aston Debonair Parade Park and Aston’s Champion Parade Playground.","urgency":"medium","formattedAddress":"Grand Boulevard/Packington Ct, Craigieburn","isPublic":true,"tags":["park","playground"],"imageURL":"https://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5c0da911cd8366f04fd4761c/1602461619536/MOTH+FRONT.jpg?format=1500w","_status":"ok"}
{"name":"kalparrin gardens, greensborough","description":"What a gorgeous little spot to take the family. At Kalparrin Gardens you’ll find a lake full of ducks and geese, a fully fenced playground as well as walking tracks set in a beautiful, leafy park. With toilets and pram friendly paths it’s really the perfect spot for a picnic, walk, play or scoot! The lake is actually a stormwater harvesting lake, a water quality and conservation system used to store stormwater underground in order to use it to water parks and ovals in the local area. The wetland on top of the water storage attracts heaps of birdlife which is a thrill for the kids. The ducks are (mostly) friendly and comfortable around humans, but of course make sure there is an adult close by just in case - the goose has been known to be a bit wary of the little ones! Also remember to tell the kids that it’s not good to feed human food like bread to any birds - they have plenty of bugs and plants to eat in their habitat.\n\nThe playground is fully fenced which is excellent being so close to the lake. The equipment includes a boat themed tower with slides and climbing equipment, swings, whale rockers and a balance surfboard. Mamma’s special mentions: If you’re keen to explore further, the garden is also home to a skate park and BMX jumps. It’s also very close to Greensborough Plaza. If it’s a family meal you’re after, you can’t go past Espresso 3094, the next suburb over in Monty Village.\n\nThe nitty gritty: pram friendly - toilets near the playground - easy parking in surrounding streets and small carpark at the Cnr of Pinehills Dr & Kempston Street.","urgency":"medium","formattedAddress":"Cnr Kempston St and Pinehills Dr, Greensborough","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5ee5bfdfdd4fcc494805d0ea/1602460855732/excerpt+kalparrin+gardens+greensborough.jpg?format=1500w","_status":"ok"}
{"name":"lyndarum north community park, wollert","description":"WOW - is pretty much all you will say when you get your first look at this fresh, new Northside playground! The epic triple tower, complete with 2 winding slides, sits in the middle of a huge circuit set on colourful, padded soft fall. There you’ll find additional slides, tunnels, a pipe xylophone, in ground trampolines, rock climbing and pulley sections and nature play elements. There are some lower to the ground areas suitable for the smaller ones while the climbing towers are designed for older kids to master - little ones will have trouble getting up there. Further down around the tower are several swings, a metal spinner, a table tennis table, an undercover picnic table area and even a separate basketball half court! This is the perfect, bright and engaging spot to visit for a picnic and a play over the school holidays!\n\nMamma’s special mention: This is a really hot area for cool playgrounds! Jump back in the car and do a whistle stop tour. Make sure you include: Aurora Adventure Park, Aurora Tree Tops Park and the Playspace at Craigieburn Rd!","urgency":"medium","formattedAddress":"Cnr Edgars & Kendon Drive, Wollert","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5fc9d12cee6dcf7e36338227/1609803725900/excerpt+lyndarum+north.jpg?format=1500w","_status":"ok"}
{"name":"Jones Park, Brunswick East","description":"City parks and open spaces are rare in Melbourne’s inner north but when you find them, they are something to shout about and share. Mamma says Jones Reserve in Brunswick East ticks every box when it comes to nature, city and adventure. The playground is packed with fun - a slide, swings and rock climbing wall, there is a sandpit with diggers and musical mushrooms to belt out a few tunes.\n\nJones Reserve also has a basketball ring, frog swamp, oval and a giant hill perfect for tumbling down. There are sheltered picnic tables and gas BBQ’s overlooking the playground making this perfect for weekend picnics or weekday catch ups. Bring the dog and your bike and make the most of the tracks too. There is lots to see and discover. It’s also a great spot for city views and to catch those special event fireworks.\n\nThe nitty gritty: 9-23 Albion Street, Brunswick East — street parking, shade, BBQs, dog park, toilets.","urgency":"medium","formattedAddress":"9-23 Albion Street, Brunswick East","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5b754e74b8a045d2f8ba84a4/1732064750152/jones.jpg?format=1500w","_status":"ok"}
{"name":"hilltop playground and splash park, doreen","description":"Hilltop Playground is a new gem! This park really has it all and caters beautifully for all ages. From slides, swings, climbing frames and a trampoline, to unique nature play elements like logs and boulders, and a super cool stick teepee, which was such a sweet addition and a big hit with the kids.\n\nThe water play area was another highlight. Even with the main splash zone yet to open for summer, the kids were loving what’s already there. It’s easy to see this will be a hot favourite once the warmer months roll in. Prepare for a splash pad with jets, misters and water channels for interactive play.\n\nThere’s plenty of parking, undercover picnic tables and BBQs, plus well kept grounds that make it a gorgeous spot for a family day out. Whether you’re popping in for a quick play or settling in for a full day catch up, Hilltop ticks all the boxes.\n\nThe nitty gritty: 20 Landano Way, Doreen — Undercover seating - parking - toilets - BBQ facilities - rubbish bins.\n\nMamma's Special Mention: Turners Bakehouse in Mernda is just over in Mernda and is the perfect spot for brunch!","urgency":"medium","formattedAddress":"20 Landano Way, Doreen","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/68ca10277e0f30103c4d3b6d/1759730732538/Hilltop+Playground+and+Splash+Park%2C+Doreen%2C+Copyright+Mamma+Knows+North-2.jpg?format=1500w","_status":"ok"}
{"name":"moreland city playgrounds","description":"Moreland City has some lovely parks and playgrounds to offer, with leafy picnic spots and room to move. Here are some of our top picks!","urgency":"medium","formattedAddress":null,"isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5f83a50e27466f23a4fe060f/1622779993073/moreland+playgrounds+excerpt+copy.jpg?format=1500w","_status":"ok"}
{"name":"Lavender Rain Park, Donnybrook","description":"Funky NEW playground alert! How cool is this?! Donnybrook's new Kinbrook Estate is where you won’t be able to miss this 4-level enclosed play tower. The kiddos will LOVE climbing this one before making their way down the giant slide.\n\nWhile the tower is more suited for the bigger kids, there is still fun to be had for the younger ones with a small slide, swings and more. There’s also a basketball court and hit-up wall if ball sports are in mind.\n\nThe park pays homage to the heritage of the lavender blooms that once cultivated this land, with cute little touches like bee statues and splashes of purple.\n\nThe nitty gritty: 90 English St, Donnybrook — Drinking fountain - Undercover seating - rubbish bins - street parking.\n\nMamma's special mention: Shared Cup Cafe is just down the road for a bite to eat.","urgency":"medium","formattedAddress":"90 English St, Donnybrook","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1749705858695-5WVZAP8B5D84MUTLHZOL/Lavender+Rain+Park+Donnybrook+Copyright+Mamma+Knows+North-2.jpg","_status":"ok"}
{"name":"Harmony Park, Coburg","description":"Harmony Park is one of Mamma's most favourite Northside parks to visit with little kids. And now that it’s been given a freshen up, it’s even better. Not only does Mamma feel relaxed and get that harmonious vibe after spending a couple of hours here. The little one loves it too and do not want to leave. The best parts of the original playground remain - the swings, seesaw, boat, musical play tires, hammock and of course the big sandpit area with a sand digger and conveyor belt.\n\nThe well-loved climbing area with concrete tunnel has been replaced with some fresh equipment including climbing structures with different-sized slides, rope bridges, connect 4, monkey bars, a basket swing and balance beams. The undercover picnic areas have been upgraded too and are looking lovely. The playground has been designed for all abilities, making it especially perfect for everyone. There is even a bike path and skate park.\n\nThe nitty gritty: 187-195 Gaffney St, Coburg — onsite freeparking - toilets - shaded seating - BBQ - picnic tables - ice cream van, most weekends.\n\nMamma's special mention: Grab your scooter and a bite to eat at Paniniteca and make a day of it.","urgency":"medium","formattedAddress":"187-195 Gaffney St, Coburg","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/58afa18fb3db2b50981e1055/1730710082180/HARMONY.jpg?format=1500w","_status":"ok"}
{"name":"Heathcote Play Space at Barrack Reserve, Heathcote","description":"For the wine loving Mamma’s, you are sure to find delight in this winery themed playground located in the beautiful wine region of Heathcote. This play space is fully fenced and includes some giant grapes to climb over, wine barrels for the water play and as balancing steps, and vine prints decorating the ground as well as some real ones growing around the poles. Then who can miss the giant wine barrel that centres the playground and spurts out two slides and climbing frames for entrances.\n\nThere’s also a flying fox, trampoline, self spinning merry-go-round, seesaws and swinging hammock. Mamma’s two loved playing shop at the play “Heathcote Market”, with a cash register and scales. BBQs are available to use outside the fenced area or you have a heap of eating options, and even a cellar door, on the same street the park is located. It’s just a short walk to the public toilets as well, at the other end of the reserve.","urgency":"medium","formattedAddress":"126 High St, Heathcote","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/66f10c575328181fff8d5cae/1727233421732/heathcote%2Bplay%2Bspace%2B-9.jpg?format=1500w","_status":"ok"}
{"name":"Community Bank Adventure Playground, Wallan","description":"If your little one loves a good park, then here is one that will send them squealing. This place has it all plus more. It’s so popular it is surprising that there are not more of these water play parks in and around the north! The playground has an eye-catching 'treehouse tower' with three slides accessed by varying levels of challenging climbing routes as well as numerous cubby spaces throughout and underneath. It includes a sand play station, rock climbing, a 25m long flying fox and a family size see-saw - not to mention the interactive tractor play, swings and spinning carousal! What more could you want?! Oh yes - a water splash park! The water splash park is located on the side of the playground area. Expect to find water play table with pumps, water channels, a three ring water tunnel with squirting water jets, a tipping bucket and a \"creek\" padded area perfect for little feet. The park also includes sheltered grassy areas, tables are scattered about, and a shaded BBQ, water taps and toilets with a change room.\n\nMamma special mention: Mamma says this place is perfect all year round and you may even need to plan for the whole day. Chances are you won't want to leave. Pack a picnic and if you plan to go in summer don't forget your towel and togs. There is also a delicious bakery across the street called Pretty Sally. They have great menu options. You can eat in, take away or drive through!","urgency":"medium","formattedAddress":"66-80 High St, Wallan VIC 3756, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/58c1f445d1758ed40671ccb9/1733195106777/01+Copyright+Mamma+Knows+North+-+community+bank+adventure+playground%2C+wallan+2022-2.jpg?format=1500w","_status":"ok"}
{"name":"mernda adventure park, mernda","description":"This fenced play space in Mernda really is the spot for an adventure! The multi-level playground has so much to climb and explore, with ladders, steps and slides, as well as hidden treasure maps and ‘farm find’ animal counting challenges. The giant tractor is a hit, which is next to the popular sandpit, complete with a digger!\n\nThe area is scattered with climbing rocks and lots of lovely plants and greenery. A great spot for Mamma to take a seat under the shaded picnic area or even have a BBQ! There’s also a walking trail and lake nearby if you’re looking to add even more adventure to your day out.\n\nMernda Village Drive, Mernda — public toilets - pram access - small amount of parking onsite - shaded picnic tables.\n\nMamma's Special Mention: Turners Bakehouse is just down the road and is the perfect spot for brunch!","urgency":"medium","formattedAddress":"Mernda Village Drive, Mernda","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/59ed6c2dc027d8ed8429925c/1758072871951/Untitled+design+%2812%29.jpg?format=1500w","_status":"ok"}
{"name":"Green Gully Reserve, Keilor Downs","description":"Mamma had her eagle eye on this one and swooped in early to check it out! We all know what they say about the early bird! Green Gully Reserve is a real treat. The whole area is very spacious with plenty of room for picnics, ball games and to just generally spread your wings! There are toilets and a large undercover area with a barbeque, perfect for gatherings. The actual playground includes a tower, a tunnel, balancing and climbing posts, 2 slides, swing sets, fitness stations and beautiful nature play elements, like tree stumps, stepping stones and garden flower beds. There are lots of native bird sculptures, which are a really sweet (or should I say tweet…) touch. It was nearly a shame when it was time to fly the coop. (Ok I’ll stop now!) But you must go and have a sticky beak!\n\nmamma special mention: Free as a bird and keen to keep adventuring? Check out Brimbank Park while you’re in the area!","urgency":"medium","formattedAddress":"151C Green Gully Road, Keilor Downs","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5d217734e56ef70001e631b9/1602461264455/green+gully+exerpt.jpg?format=1500w","_status":"ok"}
{"name":"galaxyland play space, sunbury","description":"You’ll be in another world when you launch into Galaxyland Playspace! This upgraded playground boasts lots of vast play areas for all age groups, with plenty of pathways to dash around on a scooter. There’s swings, a giant slide tower, see-saws, nest swings, climbing pyramids, in-ground trampolines, basketball half court, GIANT lizard, plenty of nature play with rocks and wooden stumps, flying foxes and rock climbing walls! Exhausted yet?! Never fear! There’s ample seating for resting and picnicking, and 2 undercover bbq areas!\n\nAnd if the family still isn’t worn out, why not take a stroll, scoot or ride down the Jacksons Park circuit trail that's connected to the playground?\n\nGalaxyland is a favourite for locals, but it’s also worth a special mission from further afield just to have a play! Mamma’s special mentions: If you’re on a Sunbury playground hop, stop off at Tom’s Park as well!\n\nthe nitty gritty: toilet & baby change - carpark - pram friendly -  448 bus stop - undercover seating & bbq’s - water fountain - rubbish bins","urgency":"medium","formattedAddress":"Cnr Belleview Drive & Betula Terrace, Sunbury","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5edf1aa61040b27751c15eb8/1602460874165/galaxy+land+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"Moomba Park Reserve, Fawkner","description":"This recently upgraded playground is cute and colourful with climbing towers, swings, rockers, lots of nature play including: garden beds, trees and balancing rocks and logs and there are educational opportunities like a little shop front, a clock with movable hands and find-a-words. There’s also a basketball half court and picnic tables with tree shade. The best part is that it’s set between a leash-less dog oval and walking/bike paths AND a nearby staircase leads down to the Merri Creek so you can go for a walk and explore along the creek, looking for native wildlife after your play.\n\nMamma's special mention: Take away pizza on the way home? Try Off The Boat Pizzeria (https://www.mammaknowsnorth.com.au/eats/off-the-boat-reservoir) or Hi Italy! (https://www.mammaknowsnorth.com.au/eats/hi-italy-pizzeria-reservoir)","urgency":"medium","formattedAddress":"26A Somerlayton Crescent, Fawkner","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/6115e6a358faf3163ff53669/1730710147170/moomba+park+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"Merri Park playground & wetland, Northcote","description":"Here’s a local spot we love to spend a morning or afternoon. It’s lovely getting out into nature for some fresh air and if you’re lucky, you might spot some native wildlife: birds, bugs and frogs! The playground is adventurous enough to entertain the older kids, with smaller structures, a large sandpit and swings for the littlies. It overlooks an oval where you can play games or sport (just avoid recess and lunch times during the school term as it is shared with the local high school). As you wander further down the path, you’ll see that the wetlands are fenced off, you can enter via the gate - just make sure you don’t bring the fur babies for this one - the wetland is home to native wildlife that needs to be protected. There’s lots of fun to be had in nature - explore the Merri Creek, balance on logs, look for flowers and mushrooms, find animal homes, spy birds up in the trees! If you stop for a snack along the way, make sure that you take all rubbish with you so that we can keep this spot clean and peaceful.\n\nMamma's special mention: You’re a hop, skip and a jump from CERES Environment Park. You can grab a take-away coffee and some fresh produce from the CERES Grocery Cafe.\n\nthe nitty gritty: street parking surrounding - benches - pram friendly paths but rough surfaces in the wetlands - bird watching - native wildlife - strictly no dogs in the wetlands - creek water - walking trails. Sumner Ave, Northcote","urgency":"medium","formattedAddress":"Sumner Ave, Northcote","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1593497292217-ZG3AMV7KDG1PI2FWAVQF/Merri+Park%2C+Northcote+mkn-6.jpg","_status":"ok"}
{"name":"Hudson Park, Kilmore","description":"Mamma is a big fan of road trips and country parks, and there is one park that she loves to visit - Hudson Park in Kilmore. This park is an ideal spot to spend your weekends with family and friends. Mamma thinks the park is quite impressive. It has a basket swing, stepping stones, slides, and a climbing net, which can keep kids of all ages entertained for hours. The playground also has sand play and a pebble stream, which are perfect for little ones on warmer days. Bonus - the playground is also fully enclosed, providing peace of mind for carers as the children play independently on their own.\n\nBut that's not all - the park also includes walking tracks, exercise equipment, and skate ramps for the bigger kids. If you're looking for a fun and active day out, Hudson Park is a great choice. The park is surrounded by beautiful greenery.\n\nThe nitty gritty: 10 Sydney St, Kilmore — park benches - picnic tables - pram access - public toilets - lots of shade - BBQ\n\nMamma's special mention: Feeling hungry? With all the bakery classics, Kilmore Bakery and Cafe is totally worth a stop on your next road trip.","urgency":"medium","formattedAddress":"10 Sydney St, Kilmore","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5a9e75c724a6940b3d527ae1/1704660279534/hudson+park%2C+kilmore-+mamma+knows+north+-+copyright-18.jpg?format=1500w","_status":"ok"}
{"name":"merrilands reserve playground, reservoir","description":"Mamma is ready to share this hidden gem of a playground with you! Merrilands Reserve playground is such a sweet spot in Reservoir to let the kids run off some energy. The big wooden structure has a variety of rock climbing walls, rope ladder and fireman’s pole and is broken up into three towers that are connected with different bridges. The tallest tower hosts a massive enclosed slide and the smallest has a little open slide.\n\nScattered around the playground there is also a set of swings, a nest swing and a frog rocker. The favourite here for Mamma’s little ones are the cute flower stools you can sit on and spin yourself around! You’ll have so much fun on this playground that you might even miss that there is a sandpit as well. It’s located at the back, behind “the forest” of trees. Hiding back here are also two unshaded tables, BBQ, water tap and small grassy area, so you can easily refuel here and stay a while. If you’re a fan of tennis and have rackets and a ball, bring them along and have a hit at the free tennis court in the reserve!\n\nThe nitty gritty: 7 Asquith St, Reservoir — BBQ, Picnic Tables, Drink Tap, Tennis Court.","urgency":"medium","formattedAddress":"7 Asquith St, Reservoir","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/679986010e6eb26857bfa789/1745374345632/merrilands+reserve+reservoir-3.jpg?format=1500w","_status":"ok"}
{"name":"JJ Holland Park, Kensington","description":"A bright climbing tower with speedy, twisty slides spiralling out stands as the main feature, but that’s only where the fun begins! Monkey bars, spinning nets, rope climbing pyramid, flying foxes, sandpit, in-floor trampolines, slides and swings (and a half court on the way) are also great fun - all spread out nicely with plenty of natural features like rocks and trees webbed between play areas.\n\nAnd Mamma knows from experience the number one sign that a playground is top quality is when the big kids, parents and carers are joining in on the fun and games!\n\nAnd you can bet your bottom dollar there’s no one taking advantage of the ample seating surrounding the park, because even the adults are too busy getting spun around, clambouring up the tower in a game of tiggy or swinging with their little one on the double swing!\n\nMamma's special mention: You know Mamma Knows Parties is going to have her eyes on this playground, because it’s just perfect to host a birthday bash - loads of grassy spots surrounding, a couple of BBQs, picnic tables and toilets! Hip, hip, hooray!\n\nThe nitty gritty: Altona St, Kensington — bench seats; limited car parking; toilets; BBQ area; plenty of grassy spaces; soccer and football oval nearby; South Kensington train station.","urgency":"medium","formattedAddress":"Altona St, Kensington, Melbourne, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/60dae48825c1c4249c4cad45/1749677942148/jj+holland+park%2C+kensington+-+copyright+mamma+knows+melbourne+cover+3.jpg?format=1500w","_status":"ok"}
{"name":"ge robinson park, preston","description":"This playspace takes Mamma back to when she was a little girl. The equipment has everything the kids need - There are swings, slides, climbing equipment and an egg shape cubby. The little ones had a ball playing house with others at the park. The park also includes a large space to have a picnic, a game of cricket or even a lay down amongst the beautiful trees. This park has been around for a while and is a favourite with locals. Now Mamma can see why.\n\nMamma's special mention: Pop into the Hi Henry, it's only short walk down road. Grab one of their fresh fruit smoothies. Yum!\n\nthe nitty gritty pram access - climb - easy parking - trees - pet friendly - seating - limited shade\n\nWant to know more? http://www.darebin.org/Directory/Agency.aspx?MKey=921&S3Key=728","urgency":"medium","formattedAddress":"Cnr Garden Street & High Street, Preston","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/59ed6dc9fe54ef255de04868/1602462416764/ge+front.jpg?format=1500w","_status":"ok"}
{"name":"malahang reserve, heidelberg west","description":"This all abilities, all ages, all families playground is HUGE! The playground is made for all interests. There are slides, swings, flying fox, pyramid climbing frame, tunnels, spinning cups and standing spinners. There will be no time for 'I'm bored' here! There is also a toddler play space which includes everything as the bigger playground but that little smaller. Little Miss 4 enjoyed the imaginary play with the sailing boat structure and spinning wheel.\n\nThere is also a basketball court, a skate park and BMX jumps. Perfect for any dare devil, no matter the age. All play spaces are visible, making this park that little more enjoyable for everyone.\n\nMamma's special mention: Who doesn’t love a little sweetness before a big play. Sweet By Nature (https://www.mammaknowsnorth.com.au/eats/sweet-by-nature-heidelberg-west?rq=heidelberg) is a short drive away. You can dine in or grab a bite to get and head to the park. You will definitely want to get a little dessert while you are there - AMAZING!","urgency":"medium","formattedAddress":"Oriel Rd, Heidelberg West","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5c103b894ae237f9d612cc86/1602461670882/malang+reserve+front.jpg?format=1500w","_status":"ok"}
{"name":"Kelvin Thomson Park, Pascoe Vale South","description":"What’s more fun than a flying fox? Two flying foxes!! You’ll find two side by side at Kelvin Thomson Park, with a playground, basketball court and large open spaces. This well-hidden park in Pascoe Vale South is perfectly tucked away from the M2 and has two entry points connected by a walking path. It also runs along a fenced-off train track, making it an excellent spot for train spotting, with Metro and V/Line trains passing through frequently. The playground here is small but mighty, with various climbing options, a rope bridge, double slides for more side-by-side fun, a moveable clock and spinner on either end and a little cubby underneath. There are also three swings, tire hopscotch and monkey bars with two options for crossings, fixed bars or wobbly handles. There are heaps of nature play opportunities throughout the parks, with logs, large rocks and greenery scattered all around.\n\nThe park is full of substantial tall trees and has grassy open spaces perfect for ball games or frisbee. A few seating options are available, with benches to just sit back and watch the kids from or a picnic table to refuel after a play or basketball match. There’s even a cute table for the kids made from a tree log with matching seats.\n\nThe nitty gritty: Cleve Rd, Pascoe Vale South. Amenities: picnic table - playground - basketball court - drinking fountain - parking via Cleve Road - NO toilets.\n\nMamma's special mention: Hungry? Grab a bite to eat at St Derby. It’s 7 minutes away and worth the food.","urgency":"medium","formattedAddress":"Cleve Rd, Pascoe Vale South","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/64b0e7223ee7e56f425c7202/1730710227748/kelvin.jpg?format=1500w","_status":"ok"}
{"name":"laurimar drainage reserve, doreen","description":"Mamma took the kids to a recently upgraded playground with slides, swings, climbing stones, monkey bars and a timber frame that invites these little explorers to let their imaginations run wild. This playground sits just off Hazel Glen Drive, which is a busy road, but what really surprised us was what we found beyond the swings. A hidden pocket of trees and a creek that’s peaceful and quiet, with a creek that is shallow enough to hop across.\n\nMamma loves this spot because the kids can have a blast on the playground and then head over to the creek for some nature play. It’s tucked away, so it feels like a secret treasure for the little ones to stumble upon. It’s a small area, but just enough for the kids to explore, although they’ll probably get a bit muddy crossing the creek, so be sure to wear gumboots if you’re thinking of exploring here!\n\nNitty gritty: BBQ facilities - no toilets - wheelchair accessible entrance - nature play - limited allocated parking - ample street parking - walking trail - pram friendly. Mamma's special mention: After your adventure in the reserve, take a stroll along the trail toward Jo Jayz Café.","urgency":"medium","formattedAddress":"9 Hazel Glen Drive, Doreen","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/67862dfefb61a67f4639d46d/1738901885900/Laurimar+Drainage+Reserve++Mamma+Knows+North+Copyright-2.jpg?format=1500w","_status":"ok"}
{"name":"Livvi's Place Anzac Park Play Space, Craigieburn","description":"This playspace in Craigieburn has EVERYTHING you need for a fun day at the park. Kids of all ages will have an absolute blast here, there’s a merry-go-round to get you very dizzy, a cubby house, talking tubes and four swings! Climb to the top of the huge mound with help from rock climbing moulds and ropes, where you’ll find 360 views of the whole playground. Then, pick the three slides to make your way back down to the ground. Run through the tunnel underneath, and make sure you stomp on some musical steps as you go. There are many more musical play options for everyone, and the ropes course and balancing beams will provide a fun challenge for the older kids.\n\nThe sandpit here includes a digger and a water pump and tap, with the water also running into a dry creek bed for the kids to explore. But this isn’t the only water play found here! In another fenced-off section, you will find a super cool splash park that is activated by pressing two different buttons.\n\nThere are benches and seats all around the playground, with undercover seating and tables here, too. It's perfect for enjoying a feed, especially if using the two BBQs available here. Anzac Park, where the playground is located, has lovely large grassed areas with heaps of seating options and toilets, including change table facilities.","urgency":"medium","formattedAddress":"Central Park Avenue & Aitken Blvd, Craigieburn","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/66286e2a6461f13016032076/1722244325453/livvis+place.jpg?format=1500w","_status":"ok"}
{"name":"Galaxyland Playspace, Sunbury","description":"You’ll be in another world when you launch into Galaxyland Playspace! This upgraded playground boasts lots of vast play areas for all age groups, with plenty of pathways to dash around on a scooter. There’s swings, a giant slide tower, see-saws, nest swings, climbing pyramids, in-ground trampolines, basketball half court, GIANT lizard, plenty of nature play with rocks and wooden stumps, flying foxes and rock climbing walls! Exhausted yet?! Never fear! There’s ample seating for resting and picnicking, and 2 undercover bbq areas!\n\nAnd if the family still isn’t worn out, why not take a stroll, scoot or ride down the Jacksons Park circuit trail that's connected to the playground? Galaxyland is a favourite for locals, but it’s also worth a special mission from further afield just to have a play!\n\nThe nitty gritty: Cnr Belleview Drive & Betula Terrace, Sunbury — toilet & baby change, carpark, pram friendly, 448 bus stop, undercover seating & bbq’s, water fountain, rubbish bins","urgency":"medium","formattedAddress":"Cnr Belleview Drive & Betula Terrace, Sunbury","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1709086093299-23PB4ZVK6C0JL7L6RAEO/Galaxy+Land+Sunbury+Mamma+Knows+West+%283+of+22%29.jpg","_status":"ok"}
{"name":"Lynnwood Reserve, Templestowe Lower","description":"It’s so cute! A little playground for a pitstop and a run around. Lynnwood Reserve in Templestowe Lower has had a refresh and it is pretty perfect - especially for the kinder kids. Here you will find a double play structure with slides, climbing walls and ladders. Little carved buddies are dotted around the zones too. There’s a community swing circle - which we believe is the first to be found in Manningham. You’ll love the beautiful snake (which is Mamma’s favourite kind as it doesn’t move) that helps break up the zones, and keeps the little ones out of the way of the bird nest swing. Lastly, there is still the old boat lookout which, of course, was the shape of the previous playground. Gotta love a little nod to the playgrounds of the past.\n\nMamma's special mention: Coffee hit before exploring the playgrounds? Drop in to Salted Caramel for your takeaway fix.\n\nthe nitty gritty: water fountain - no toilets - walking trail nearby","urgency":"medium","formattedAddress":"44 Lynnwood Parade, Templestowe Lower","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5eee8d330a6da31edac0723c/1602460764695/Lynnwood+Reserve+-+Mamma+Knows+East+%2810+of+11%29.jpg?format=1500w","_status":"ok"}
{"name":"mitchell avenue splash park, wangaratta","description":"When heading up to Victoria’s High Country in the warmer months, Mamma’s crew loves a stop off at Mitchell Avenue Splash Park in Wangaratta. It’s fully fenced and has a decent variety of water spouts and play experiences, meaning kids of all ages will be able to get amongst it. Scattered along the ground are spraying arches to run through, mushroom shaped fountains that toddlers will love, a water channel, water shooters and a dragonfly shaped shower.\n\nWhat splash park wouldn’t be complete without a tipping bucket! The pressure of the falling water isn’t too strong here, which is good for any kiddos, or mammas, who get caught up in an out pour by accident.\n\nMamma’s little ones love climbing the huge rocky hill and using the 2 water shooters to drench those down below. There’s also a water slide to enter up here, which is so cool and underneath the rocky hill you can travel through a tunnel, dodging water spouts.\n\nWhen it’s time to dry off or just take a rest, there’s a huge grassed area to lay a picnic blanket or towels down on. There’s also shaded tables scattered around, benches and a big shaded rotunda with tables, chairs and BBQs. The family sized changing facilities here make a visit here so easy. They have toilets, showers and change tables. When it’s too cold for a splash of water play or you’re visiting outside of operating months, there is a separate fully fenced playground, flying fox, basketball court and BBQ facilities available here to enjoy!\n\nOpen November - March. 9am-9pm daily. Fenced Playground. BBQs. Shaded Picnic Tables. Drink Tap. Toilets. Showers. Baby Change Table.","urgency":"medium","formattedAddress":"26 Mitchell Ave, Wangaratta","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/d6e966d8-3612-48fe-b50c-c1add266143e/mitchell+avenue+water+play+park+wangaratta-1.jpg","_status":"ok"}
{"name":"Link Reserve, Kingsbury","description":"You can't go past a park when it's right across one of Mamma's favourite family friendly eateries. Link Reserve is a great all ages street park with lots to climb and enough green space to run off a milkshake or babycino from Red Door Cafe (https://www.mammaknowsnorth.com.au/eats/red-door-cafe-kingsbury). This recently refurbished playground has - wooden climbing structure, with stairs, a rope climb. A nest swing, sandpit, table tennis table and sound play. This playspace is perfect for all ages and all abilities. There are Cockatoo's painted throughout the playground, they represent the local wildlife in the area. How many can you find?\n\nMamma's special mention: Pop into the Red Door Cafe (https://www.mammaknowsnorth.com.au/eats/red-door-cafe-kingsbury), it's only across the road. Grab a bite to eat or dine in.\n\nthe nitty gritty  pram access - climb - pink pong table - parking - water tap - pet friendly - limited shelter. Want to know more? http://www.darebin.org/Directory/Agency.aspx?Mkey=513&S3Key=713\n\nAddress: Link Street, Kingsbury","urgency":"medium","formattedAddress":"Link Street, Kingsbury","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/59db5a3d59cc6866434d949c/1602462439568/link+front.jpg?format=1500w","_status":"ok"}
{"name":"Long Gully Splash Park, Long Gully","description":"Splash parks are the perfect in-between when you aren’t fully committed to getting wet! ‘Gold Rush’ themed Long Gully Splash Park is super cute - small but has everything you could need! The treated water is solar heated. The majority of the water runs on touch pad timers in 4 minute increments (with some smaller ground-up sprays permanently on). Once the water is turned on, there are so many interactive elements to choose from; a mist tunnel, above head buckets, swivelling horse head sprays, a tall water tank and lots of smaller structures with spouts to duck and dodge. For those not interested in a splash there is a seperate dry playground area with a slide and climbing structures and also a basketball half court.\n\nMamma’s special mention: While you’re in the area don’t miss out on a stop off at the incredible Eaglehawk Play Space! And don’t forget to check out the Discovery Science & Technology Centre!\n\nthe nitty gritty spacious toilet facilities with change tables - seperate dry playground - shade sales - several picnic tables with cover - BBQs - basketball half court - partially fenced - car park onsite - pram accessible 21 Cunneen Street, Long Gully","urgency":"medium","formattedAddress":"21 Cunneen Street, Long Gully","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5ff93dbfffea7f059fa088c5/1733195205972/long+gully+splash+park+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"Hopwood Gardens Playground, Echuca","description":"Mamma will give you ONE guess about the theme of the playground we uncovered in Echuca. It’s a Paddle steamer, of course! This wonderful and petite playground is found in the centre of town, close to the Murray River and the Port Of Echuca Discovery Centre. Its main attraction is the chimney ladder, leading to the best view - the paddle steamer’s steering wheel on the top deck. Other cool touches are the climbing walls that create the bow of the boat, old-school cargo boxes to balance across, and one of the Murray’s famous friends, the turtle. There is a cubby house, spinners, slides and even a water pump which creates its own little river trail around the edge of the playground.\n\nMamma’s Special Mention: You must drop into The Port Echuca Discovery Centre to learn all you cal about the history of the town.\n\nthe nitty gritty\nHopwood Place, Echuca\nwater play - little shade - picnic benches - close to town - bbq - limited parking at peak times","urgency":"medium","formattedAddress":"Hopwood Place, Echuca","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/608654e4676f4665433b5698/1703893558728/01+Hopwood+Gardens+Echuca+-+Copyright+Mamma+Knows+North+%281+of+27%29.jpg?format=1500w","_status":"ok"}
{"name":"Kidstown Adventure Playground, Shepparton","description":"Well, if you are looking for adventure - you just found it. We have been to a few playgrounds in our time but this is unbelievable! It is said to be the biggest adventure playground in Australia and we’d believe it. Let’s just list a couple of things you can find here:\n- a big ‘cow themed’ maze\n- rainbow fruit bin maze\n- 2 giant slides\n- the biggest nest wing we have come across\n- obstacle course\n- diggers and sandpits\n- swings and a disc golf course\n- even a little cafe with a fantastic picnic area\n\nThe facilities here are great, you really have everything you need for a day of play here.\n\nThis is a massive space with wooden structures, bridges, turrets, treehouses and cubby houses. The kids had an amazing time exploring here. The different sections are spread out and it really is suitable for all ages with toddler areas and even teen play spaces. There are lots of activities here throughout the school holidays too. So keep an eye on their what's happening page here: https://kidstown.org.au/aboutkidstown/kt-events\n\nNote: the little train that operates here is out of action at the moment.\n\nThe nitty gritty: Shepparton/Mooroopna — 7287 Midland Highway, Mooroopna. Gold coin donation for entry.\n\nMore info: https://kidstown.org.au/aboutkidstown","urgency":"medium","formattedAddress":"7287 Midland Highway, Mooroopna","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1681247993796-TSEJIOE5IDEWWLDRX8LZ/KidsTown+Adventure+Park++-+Mamma+Knows+Melbourne+Copyright+2023-0936.jpg","_status":"ok"}
{"name":"John McMahon Reserve, Sunbury","description":"This upgraded playground has something to offer everyone. With rope climbing towers, big and little slides, nature play, a very awesome scooter run, epic flying foxes (one with an adult/access seat so that everyone can enjoy it!), several swings, outdoor gym equipment, and in-ground trampolines, the little and bigger ones will be kept very well entertained! There are undercover picnic tables, a drinking fountain and a barbecue so you can have a break and then get back to playing. It’s also partially fenced for peace of mind.\n\nMamma just loves a playground with a scooter run. The track has steep enough spots to satisfy older kids on bikes but is safe enough for little ones on scooters.\n\nMamma’s special mention: Sunbury has so many amazing playgrounds to offer! Make a trip of it and stop off at Galaxyland Play Space or Toms Park!\n\nThe nitty gritty: pram friendly - toilets nearby - drinking fountain - scooter track - nature play - fitness equipment - trampolines - flying fox - running track - toddler structures - adventure play - under cover picnic tables - barbeque.","urgency":"medium","formattedAddress":"John Mcmahon Reserve, Lancefield Road, Sunbury","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1593149040920-UBWQ6F28VU8RYXEQD6ES/John+McMahon+Reserve%2C+Sunbury-2.jpg?format=500w","_status":"ok"}
{"name":"methven park, brunswick east","description":"There’s something magical about this little heritage park - especially when the autumn leaves are gently falling from the trees. A rare find in the inner suburbs. There’s a simple wooden playground with swings, a climbing frame with slide, monkey bars and a spinner. There are also barbeques, toilets and lots of green space for picnics and gatherings. It’s a great little spot for a play date - bring the fur babies too as dogs are allowed off lead.\n\nmamma’s special mention: Best sandwiches and coffee in the area? Rusty’s Sandwich Parlour (https://www.mammaknowsnorth.com.au/eats/rustys-sandwich-parlour-brunswick-east)!","urgency":"medium","formattedAddress":"7 Methven St, Brunswick East","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1619416421113-P7FULWJJIJH98R5ADTN1/methven+park+brunswick+east.jpg?format=500w","_status":"ok"}
{"name":"Lehmann's Farm Park, Epping","description":"This has to be one of the most unique play spaces we have been to. Set on the site of an old dairy farm, the playground’s elements are all relevant to its dairy theme. There are cheese shaped sculptures, a milk barrel slide, a veggie patch, a farmer and working dog statue, a windmill, cow bell, milk urn instruments and lots of other little tidbits to discover. We particularly like the little fact sheets scattered around the place providing information on the original farm and the family who owned it in the 1920s.\n\nThe playground’s bush setting is just as much fun to explore with smooth paths for scooters and bikes, a bridge overlooking Edgar’s Creek, picnic tables (covered and uncovered) and lots of natural elements to play in. This playground is so gorgeous to look at and while the play equipment is better suited to the little ones, older kids will love all the unique elements and discovering all the hidden treasures scattered around the site.\n\nMamma’s special mention: For another unique playground nearby, check out Aurora Adventure Park!\n\nThe nitty gritty: street parking - pram friendly - nature play - drinking fountain - exercise equipment - picnic tables (covered).","urgency":"medium","formattedAddress":"19W Amareth Cct, Epping, VIC","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1603600822421-OE36PR20QZ84QPJ3CZUY/collage+lehmanns+playspace.jpg","_status":"ok"}
{"name":"Main Street Recreation Reserve Playground, Thomastown","description":"Mamma just loves an outing to this play space, there is just so much for the kids to do here! Mamma’s little ones always run to the giant climbing web first! Not sure if it’s the climbing they love more or the massive slide at the top that takes them back down, either way they go up and down over and over again! There’s also 3 other slides to choose from in this playground. A double slide for tandem racing and a slide attached to a fort. The fort has a shop front, telescope and a fire mans pole as well.\n\nYou’ll also find a set of swings, including one with an all abilities seat, a nest swing, a 4 person seesaw, mini trampoline, spinner disk, wobble bridge and a double flying fox with different seat options, one all abilities and one disc. There’s a nice mix of natural elements within this play space for the kids to get amongst including giant rocks and tree stumps, a golden sun moth sundial designed as a social meeting place and half basketball court.\n\nThe play space has paths throughout, making it easy to navigate with prams and a few entry points depending on how you want to get here. It’s accessible from the Edgars Creek walking/biking trial, making it a great spot to stop if making your way along there on foot or bike. Otherwise there is access from Gardenia Rd if you drive. Mamma suggests, if you do drive, it is worthwhile to take the small walk along the path from the playground, beyond the trees to check out Edgar’s Creek. Two tables with seats and a drinking fountain can be found under a huge shady cover with access to a BBQ, and public toilets on the other side of the oval. Just what you need to spend a few hours of fun here!","urgency":"medium","formattedAddress":"74 Main St, Thomastown","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/67883243b5037a28257b7735/1737196748091/20250116_190857.jpg?format=1500w","_status":"ok"}
{"name":"Lincoln Square Playground, Carlton","description":"This playground is just so sweet. The existing 150-year-old Moreton Bay Fig Trees that are such a special feature have been incorporated into the design of the play space, giving it the feel of a fairy garden amongst a forest.\n\nThere are large climbing structures connected by a mesh tunnel, swings, metal standing chimes, speaker tubes, a small slide and a mega slide, a wobble bridge and a BBQ area as well as lots of places to sit. Mamma loves the nature play elements like the wooden cubby, hollowed trunk tunnel and balance logs are beautiful additions.\n\nThis is a very special new playground - set on the site of what was formerly Melbourne’s oldest playground - there is heaps to discover - the kids will really love it!\n\nMamma's special mention: Located only a short walk away is Tiamo’s, Carlton’s hottest spot for a nice plate of pasta.","urgency":"medium","formattedAddress":"Cnr Lincoln Square & Bouverie St, Carlton","isPublic":true,"tags":["park","playground"],"imageURL":"https://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/613d7c1eb6a38148d0a46b8b/1688362260559/lincoln+park%2C+carlton+-+mamma+knows+north+-+copyright-14.jpg?format=1500w","_status":"ok"}
{"name":"jack roper, broadmeadows","description":"Oh my goodness! Mamma has just found heaven and needs five minutes to take it all in. This playspace has only recently been made over and ticks all boxes when it comes to all abilities and all ages. You are going to love it! Mamma thought she was only going to pop in for this one but we ended up staying the whole day, so you are going to want to be prepared when you visit. There is a flying fox, cubbies, mini trampolines, balancing beams, rock climbing walls, slides and wheelchair swing - Mamma could go on with all the different play elements in this play space but she would be here for a while. Not to mention the great grassy area for a game of cricket, lake and walking track. Jack Roper is made for everyone. This park is a hidden gem and Mamma is not leaving.\n\nMamma's special mention: Pane e' Pizza by North Street Bakery is only a short drive away and worth a stop before a play. This place has some of the best tasting pizza's in the north and they do takeaway.\n\nThe nitty gritty\nwalking tracks - soccer field - shade - public toilet - parking - BBQ's - all abilities\n\nWant to know more? Click here: https://www.hume.vic.gov.au/Leisure_Sport_and_Recreation/Parks_and_Reserves/Parks_Reserves_in_Hume/Jack_Roper_Reserve","urgency":"medium","formattedAddress":"217 Camp Rd, Broadmeadows","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5afa44790e2e72b3186009c2/1602462055146/jack+roper%2C+broadmeadows+front.jpg?format=1500w","_status":"ok"}
{"name":"montgomery (pirate shipwreck) park, essendon","description":"NEWS JUST IN! The Swift Parrot Pirate Ship has been found shipwrecked in Essendon! The notorious pirate Captain Kidd sailed this almighty galleon and that can only mean one thing - treasure! Now deep beneath the sand all that is left of the ship is the mast, crows nest and tattered flags and sail - so man the lifeboats, keep a watch out for whales, find the treasure map and start digging!\n\nMamma's crew always have a ball uncovering the fun at this park. There is even a swing set, see saw, spinning climbing frame and hammock! The park has a large grassy area with tables, seating, shelter and BBQs. Perfect spot for a gathering of friends to help you hunt for the treasure!\n\nMamma's special mention: Essendon Traffic School is right next door so have some double fun one Saturday!","urgency":"medium","formattedAddress":"21 Hilda St, Essendon","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5b0e2a22f950b73551da75bb/1745374229303/front.jpg?format=1500w","_status":"ok"}
{"name":"Howitt Park playground, Bright","description":"Playgrounds don’t get much more stunning than this. This largely timber adventure playground sits on the banks of the Ovens River and is surrounded by the grand old trees that Bright is famous for - changing their glorious colours as the seasons pass. The playground has all the slides, bridges, swings, nooks crannies you need to keep them entertained for ages and can hold lots of kids without feeling too busy. Te playground sits in the larger Centenary Park, and there is some bench seating and picnic tables dotted around to take a rest, but be sure to wander over the bridge and through the whole wider park as well. The Splash Park is a great way for the little ones to cool off in the summer - the older ones may prefer the slide that goes down the into the river! Very cool.\n\nMamma’s special mentions: Bright Brewery overlooks the playground, a wonderful place for a bite and a brew!\n\nthe nitty gritty toilets - bbq’s - river nearby\nRiverside Avenue, Bright","urgency":"medium","formattedAddress":"Riverside Avenue, Bright","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/60aaf5e5028eea0f43c90587/1745318202110/Centenary+Park+Bright++2021+Copyright+Mamma+Knows+Melbourne+%2837+of+37%29.jpg?format=1500w","_status":"ok"}
{"name":"Pump Track at Montgomery Park, Essendon","description":"Grab your bikes or scooters and head down to Montgomery Park to ride the pump track before it heads to its new location! It’s challenging enough for kids who are confident on their BMX bikes with a range of hills and a good amount of turns, but small enough that new riders can make their way around and build up their confidence. The pop up pump track is set to be moved to another park sometime in 2025, through a rotating project run by the Moonee Valley Council. The council has been assessing the usage of this pop up modular track in order to establish if a more permanent facility will be built at this location.\n\nThe track compliments the huge slide and small playground already existing at this vast green space. You’ll find a large climbing frame, nest swing, tractor rocker and a swinging seesaw (note: the seesaw swings side to side but won’t complete a full 360 degree spin). There are a few tables and chairs near the playground, great to rest on after a few trips up to the top of the slide.\n\nMamma’s Special Mention: Essendon Traffic School (nearby).","urgency":"medium","formattedAddress":"43A Lawson St, Essendon, 3040, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"https://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/62ca3e620e5d6a4f92d924f9/1745374322367/montgomery+pump+track+essendon.jpg?format=1500w","_status":"ok"}
{"name":"Mode Park, Kalkallo","description":"Honestly, Mode Park - wow! This mamma is seriously impressed. This park is incredible. The attention to detail, the variety of options, the size, and the way it caters for all age groups is just brilliant. You’ve got the park classics - slides and swings, but there’s so much more. Two giant climbing structures which are connected by a rope tunnel, with three slides of different heights attached. There’s also a bouldering wall, a music play area, a flying fox, a four person see-saw, in-ground mini trampolines, and even exercise equipment.\n\nAnd it doesn’t stop there. The whole space is surrounded by a great path, perfect for scooters and rollerblading, and it was filled with happy, active kids when we visited. Multiple undercover areas, BBQs and big grassy areas make it picnic perfect. They’ve even thought to include a bike repair station.\n\nThis mamma’s little 3-year-old was beside himself, running from one activity to the next. The park truly caters for all ages, and you could easily spend an entire afternoon here or host a celebration under one of the sheltered areas. This isn’t just a local park, it’s one worth making a trip for.\n\nThe nitty gritty: 55 Cilantro St, Kalkallo — BBQs, toilets, water taps, bike repair station, rubbish bins, undercover seating.\n\nMamma's Special Mention: Marnong Estate isn’t too far away and is a lovely spot for a meal; keep an eye out for their markets and petting zoo days!","urgency":"medium","formattedAddress":"55 Cilantro St, Kalkallo","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/68e35c2c39fab50a2cb6866e/68e361f2614b84091d5a4f5c/1759732320368/Mode+Park+Kalkallo%2C+Copyright+Mamma+Knows+North-18.jpg?format=1500w","_status":"ok"}
{"name":"Kingsford Smith Ulm Reserve, Glenroy","description":"Not many parks in Melbourne have it all: a good quality play space for kids, gorgeous grassy walks AND a stunning view, but luckily for us in the North, the Kingsford Smith Ulm reserve in Glenroy can boast all that and more.\n\nSet on top of a hill combined with the Moonee Pond Creek and overlooking the heritage-listed rail bridge, the Albion viaduct - this park has something for everyone. Kingsford Smith has a play space offering nature play and play equipment catering to a broad range of abilities too! Check out the wooden owls and frogs for something unique, and as the play space is set at the top of the hill, babies and children of all ages can swing away while looking over the reserve’s best feature: its view. Mamma says this place is a calming space just to sit and watch the children run around and play in.\n\nWith picnic tables, lots of lovely grassy spots and a sheltered area, it is an excellent place for a picnic or birthday party. There are also bike and walking trails, and they are currently in the process of building a new dog park and car park. We particularly loved sitting on the grass overlooking the massive metal heritage rail bridge.\n\nThe nitty gritty: 81 Loongana Ave, Glenroy — drinking fountains, shelter, table, carpark, bike/walking tracks. Want to know more? http://www.moreland.vic.gov.au/events-recreation/parks-and-trails/find-a-park/kingsford-smith-ulm-reserve/\n\nMamma’s Special Mention: Get the family in the car, grab a takeaway meal from the local cafe Dairy Queen.","urgency":"medium","formattedAddress":"81 Loongana Ave, Glenroy","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/58fc357f6b8f5b0fe3aa1559/1692442640614/kingsford.jpg?format=1500w","_status":"ok"}
{"name":"Kyneton Community Park and Water Play, Kyneton","description":"Wow, this park is so perfect and has so much character! Located in the lush surrounds of Kyneton's Botanic Gardens, there just couldn't be a better spot for a picnic, a gathering or a casual family hang! There are barbecues, heaps of covered and uncovered park benches and tables and public toilets as well. There are lots of shady spots under trees.\n\nThe unique play equipment - which includes several sandpit areas (one with a wooden maze!), colourful tractors, climbing frames, 3 rocket towers, a giant swing, balancing logs, cubbies and a table tennis table - features a crown jewel in the form of an epic water play splash pad area!! Seriously this is so incredible on a hot day! This is a really special spot and being out of town it's not too overcrowded, even in peak season which is always a plus!\n\nThe nitty gritty:\nKyneton Botanic Gardens, Mollison Street, Kyneton. Splash pad operates from December 1st - March 9th, 9:30am-8pm. Nature play - bench seats - dogs on lead - water play - public toilets - lots of unlimited parking in surrounding streets.\n\nMamma's special mention: Mamma thinks this amazing park alone warrants a summertime trip to Kyneton but there are also so many other family friendly things to do in this area! Mamma loves Ruby Cafe for breakfast or lunch and you can’t stop in Kyneton without a visit to Squishy Minnie Kids Bookstore! And if you’re staying overnight Major Tom's is the perfect spot for an alfresco family meal!\n\nClick here for more great parks and playspaces in the north.","urgency":"medium","formattedAddress":"Kyneton Botanic Gardens, Mollison Street, Kyneton","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5e0863ea31a7876caf54fa23/1733195002698/kyneton+community+park+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"Jacobs Reserve, Brunswick West","description":"Upgraded playground alert! This one’s a real beauty! The leafy and serene Jacobs Reserve has a gorgeous new playground featuring timber play equipment to compliment its lush, green surrounds. It’s a great spot for picnics with park benches and lots of shady trees.\n\nFittingly, the playground features nature play elements including a large sandpit, rocks and logs for the small ones. There’s also a swing set, small slippery dip, small seesaw and park benches close by for supervising adults. There are more challenging areas for the older kids like netted climbing frames, a flying fox, monkey bars and a larger seesaw structure. It’s really such an attractive little park!\n\nMamma's special mention: Lady Melville’s Cafe is just a hop, skip and a jump away!\n\nthe nitty gritty sandpit - nature play - drinking taps - street parking -plenty of room for picnics - shade - park benches - dogs on lead only","urgency":"medium","formattedAddress":"180E Melville Road, Brunswick West","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1564457112826-B9LKZZWRREJ2A2FWW8S6/Jacobs+Reserve.jpg","_status":"ok"}
{"name":"mccubbin drive playground, taylors lakes","description":"A great park with an amazing BBQ area, bocce court and a soccer field! Mamma says there are some great features at this new park in Taylors Lakes. The stand out is a ginormous BBQ area! Complete with ‘chandelier’ stone benchtops, bbq, seating and tables it is tailor-made (ahem) for families and friends to catch up whilst the kids play.\n\nThere is plenty to explore here too! A great slide over a tunnel structure with climbing footholds, swings, climbing ropes and tunnels, lots of green space for soccer or all play plus a bocce court! The planting and paths around the park are gorgeous creating a space that everyone can sit back and enjoy.\n\nThe nitty gritty: 18—24 Robertsons Road &16a Robertsons Road Taylors Lakes. BBQ’s - park benches - no toilets - some shade - some parking around park. (Map: https://www.google.com.au/maps/place/McCubbin+Drive+Playground/@-37.6928741,144.7742191,20.5z/data=!4m8!1m2!2m1!1s18%E2%80%9424+Robertsons+Road+%26+16a+Robertsons+Road,+Taylors+Lakes!3m4!1s0x6ad6f553f17ff51d:0x434ebf20fcf02bf1!8m2!3d-37.6930137!4d144.7745219). Mamma’s special mentions: If you want EXTRA adventure - head to Organ Pipes National Park (https://www.mammaknowsnorth.com.au/the-great-outdoors/organpipes?rq=organ).","urgency":"medium","formattedAddress":"18—24 Robertsons Road &16a Robertsons Road Taylors Lakes","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/c4911c4d-2432-475e-9254-2dd9ff33807b/Taylors+Lakes+-++Messra+Park-140228.jpg","_status":"ok"}
{"name":"Frontier Park, Rockbank","description":"Mamma just went to revisit this fantastic park and can happily report it is still, well… fantastic! The trees have matured and provide plenty of shade and there are still towers, rope bridges, dizzy wizzy, sand pit, water play, swings, slides, rocks, tree trunks - honestly Mamma could go on and on and on about the elements of play here. It is fantastic. There is heaps for the big kids here and it is particularly appealing for daredevils! Those slides and rope tunnel are breathtaking.\n\nThe rainbow coloured soft fall complements the nature inspired climbing and play here. There is even a mini skateboard ramp, basketball court, soccer net and a large undercover areas perfect for a family gathering. You are really going to have to just take Mamma's word for it and go and check this one out! Like.... go.... NOW!\n\nOh and WATER play - so make sure you take a towel for the kids - especially in hot weather as they will love to play in the cool jets.\n\nThe nitty gritty:\nat the end Woodlea Blvd at Frontier Avenue (Off Leakes Road) Rockbank. Bench seats - undercover BBQ’s - lots of free parking - toilets - take a towel as water play is good fun!","urgency":"medium","formattedAddress":"at the end Woodlea Blvd at Frontier Avenue (Off Leakes Road), Rockbank","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/d7bcddb8-d170-4924-a268-9f3e2142aa19/frontier+park%2C+rockbank+-+copyright+2023+mamma+knows+melbourne-15.jpg","_status":"ok"}
{"name":"gardiner reserve, north melbourne","description":"Mamma says this park is super cute even though it has lots of spiders! But at least they’re the playful and sculptural kind - phew! Gardiner Reserve has had a major makeover with the installation of new park equipment designed for 2-12 year olds along with a major park expansion. There’s now so much greenery, space to run around and have a picnic. Native plants have also been added to new landscaping to bring great greenery to the neighbourhood. With most of the play equipment made from wooden materials, the whole look and feel of the play space is very organic and natural. The kids will have so much fun pulling spidey’s legs made out of rope, climbing webs and using their imagination as they play across this very well thought-out space. Each section has something different to offer, from swings to the sand pit and the cutest little cubby house Mamma has ever seen. Park perfection and well worth the visit!\n\nMamma's special mention: The park is located across the road from North Melbourne Pool so double the attraction!\n\nthe nitty gritty: good shade - no toilets - barbeque - benches - street parking - open green space","urgency":"medium","formattedAddress":"287-315 Dryburgh St, North Melbourne (opposite the North Melbourne pool)","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5cafe8d9ec212de7c2d53e1f/1602461439804/3+Gardiner+Reserve+North+Melbourne+-+Mamma+Knows+North+%281+of+17%29.jpg?format=1500w","_status":"ok"}
{"name":"macleod village playground, macleod","description":"This is a super fun and freshly UPGRADED playground right across from the cute Macleod Village shopping strip. Some of the existing elements, like the train structure, have been repurposed to compliment the location of the playground which is right in front of the (fenced) train line. It’s exciting for little train lovers to see the trains passing by as they play. The Village Book Exchange mini library has also been moved into the play space so that children can select and swap their books before finding a shady spot to read. There’s lots of green space for picnics, with social distancing circles painted on the grass. There are 2 climbing structures, each with slides - one smaller for the littler ones, flower spinner, several swings and lots of nature play elements including a dry creek bed and mini bridge, stepping stones and balance logs. The musical elements are also a cool feature with bongo drums and metal flowers that can be played with a stick.\n\nThe coolest part by far, however, has GOT to be the ‘Yalp Memo’. Mamma has never seen anything like this before. This internet connected, interactive play station is designed to encourage educational and physical play. Consisting of eight bollards on a soft fall base, children (best suited to ages 4+) can select from 56 different games involving maths, memory, fitness, creativity and team work. Following the audio prompts from the main station in order to play, it’s really nice seeing kids work together and make friends. Being app-operated, more activities will be able to be developed and added to the station as time goes on!\n\nMamma’s special mention: Great coffee and babycinos across the road at Touchstone Cafe. The parallel shopping strip has cafes, an op shop, a florist, a supermarket, a news agency, restaurants, gift stores and heaps more, so you can get some errands done while you’re in the area!\n\nAmenities: picnic tables with cover; green space; BBQ; public toilets directly across the road near tennis courts; shade sails; street parking; close to public transport.","urgency":"medium","formattedAddress":"Cnr Erskine & Aberdeen Rds, Macleod","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5fa60ba7ef83d42c479287c5/1613272377201/macleod+village+green+playground+excerpt.jpg?format=1500w","_status":"ok"}
{"name":"laurimar drainage reserve, doreen","description":"This playspace may be small but it's a fantastic space to let the little ones get their legs moving. Mamma stumbled past this little gem on her way to a local café. The playground included climbing equipment, walking bridge and spiral slide. The walking tracks is along the creek and leads to the main strip of shops. Laurimar Drainage Reserve is great picnic space for small groups or perfect for a quick play.\n\nMamma's special mention: Slices is a short walk and worth heading over, even if it's just a pizza. You'll be back for more.\n\nthe nitty gritty BBQ - wooden tables and benches - FREE street parking","urgency":"medium","formattedAddress":"Hazel Glen Drive, Doreen, Australia","isPublic":true,"tags":["park","playground"],"imageURL":"https://images.squarespace-cdn.com/content/v1/58813c79f7e0ab55271bb525/1532688063809-EATBZMAW5207N3ZP78HY/laurimar+drainage+reserve%2C+doreen-1.jpg","_status":"ok"}
{"name":"Gumnut Park and Adventure Playground, Donnybrook","description":"WOW! This epic adventure playground is just breathtaking! Inspired by May Gibbs’ Gumnut Babies Snugglepot & Cuddlepie and set amongst a nature backdrop, including gorgeous red gum trees, it’s really a sight to behold! The 3 ginormous towers lead to huge gum nut shaped climbing pods. These are connected by mesh tunnels and are finished off with 2 mega slides. There are also 2 epic flying foxes, a low-to-the-ground toddler area with a slippery dip over a sandpit, in ground trampolines, an extensive wooden climbing frame and balance section, a beautiful gum nut cubby, a basketball court, skate/BMX ramps, a huge undercover picnic area AND A CAFE!\n\nShared Cup cafe is a not for profit, social enterprise cafe which overlooks the toddler area, perfect! This is a beautiful park in a lovely bush setting, you will want to spend time here - it’s full of nature play elements to discover with something suitable for all ages. There’s really nothing more to want from a new park and playground! We can’t wait!\n\nthe nitty gritty\n1025 Donnybrook Rd, Donnybrook — pram friendly - cafe - toilets - nature play - toddler area - adventure play - under cover picnic tables - barbeques - basketball half court, skate ramp\n\nMamma’s special mention: Need a coffee? The lovely Shared Cup cafe is right beside the playground, perfection! If you’re on a themed playground hop, stop off at the awesome Aston Traffic Park on your way home!\n\nClick here for more great parks and playspaces in the north.","urgency":"medium","formattedAddress":"1025 Donnybrook Rd, Donnybrook","isPublic":true,"tags":["park","playground"],"imageURL":"http://static1.squarespace.com/static/58813c79f7e0ab55271bb525/58ecb61820099e78e671de65/5ee701df945e9b489ae4ad14/1732064773397/Gumnut+Adventure+Park+Donnybrook-9.jpg?format=1500w","_status":"ok"}